[{"ayah_number":1,"text":"«المص» في محل رفع مبتدأ. أو حروف لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":2,"text":"(كِتابٌ) خبره أو خبر لمبتدأ محذوف.\n(أُنْزِلَ) فعل ماض مبني للمجهول تعلق به الجار والمجرور (إِلَيْكَ) ونائب الفاعل مستتر. والجملة في محل رفع صفة لكتاب.\n(فَلا يَكُنْ) فعل مضارع ناقص مجزوم بالسكون ولا ناهية جازمة، والفاء للاستئناف.\n(فِي صَدْرِكَ) متعلقان بمحذوف خبر يكن.\n(حَرَجٌ) اسمها.\n(مِنْهُ) متعلقان بمحذوف صفة حرج، والجملة مستأنفة لا محل لها.\n(لِتُنْذِرَ) مضارع منصوب بأن المضمرة بعد لام التعليل، والمصدر المؤول من أن المضمرة والفعل في محل جر باللام، والجار والمجرور متعلقان بالفعل أنزل.\n(بِهِ) متعلقان بالفعل قبلهما.\n(وَذِكْرى) اسم معطوف على المصدر المؤول أي للإنذار والذكرى وقيل معطوف على كتاب.\n(لِلْمُؤْمِنِينَ) اسم مجرور بالياء لأنه جمع مذكر سالم والجار والمجرور متعلقان بالمصدر ذكرى.","surah_id":7,"source_id":7},{"ayah_number":3,"text":"(اتَّبِعُوا) فعل أمر مبني على حذف النون والواو فاعله واسم الموصول (ما) مفعوله.\n(إِلَيْكُمْ) متعلقان بأنزل.\n(مِنْ رَبِّكُمْ) متعلقان بمحذوف حال من نائب فاعل الفعل المبني للمجهول أنزل، والجملة صلة الموصول لا محل لها (وَلا تَتَّبِعُوا) مضارع مجزوم بحذف النون، والواو فاعل، ولا ناهية جازمة.\n(مِنْ دُونِهِ) متعلقان بالفعل قبلهما أو بمحذوف حال من أولياء كان صفة له فلما تقدم صار حالا.\n(أَوْلِياءَ) مفعول به (قَلِيلًا) صفة لمصدر محذوف، أو لظرف محذوف أي تذكرا أو زمنا قليلا.\n(ما تَذَكَّرُونَ) مضارع مرفوع بثبوت النون، والواو فاعل وما زائدة. والجملة تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":4,"text":"(وَكَمْ) كم خبرية مبنية على السكون في محل رفع مبتدأ.\n(مِنْ) حرف جر زائد (قَرْيَةٍ) اسم مجرور لفظا منصوب محلا على أنه تمييز.\n(أَهْلَكْناها) فعل ماض وفاعله ومفعوله والجملة في محل رفع خبر.\n(فَجاءَها بَأْسُنا) فعل ماض ومفعوله وفاعله والجملة معطوفة.\n(بَياتاً) ظرف أو حال منصوبة.\n(أَوْ) حرف عطف.\n(هُمْ قائِلُونَ) مبتدأ وخبر والجملة معطوفة على بياتا فهي في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":5,"text":"(فَما) ما نافية والفاء للاستئناف.\n(كانَ) ماض ناقص (دَعْواهُمْ) اسم كان مرفوع بالضمة المقدرة على الألف، والهاء في محل جر بالإضافة.\n(إِذْ) ظرف لما مضى من الزمن متعلق بدعواهم.\n(جاءَهُمْ بَأْسُنا) فعل ماض ومفعوله وفاعله والجملة في محل جر بالإضافة.\n(إِلَّا) أداة حصر.\n(أَنْ قالُوا) المصدر المؤول من أن والفعل في محل نصب خبر كان.\n(إِنَّا) إن واسمها.\n(كُنَّا) كان واسمها و(ظالِمِينَ) خبرها وجملة كنا ظالمين في محل رفع خبر إن.","surah_id":7,"source_id":7},{"ayah_number":6,"text":"(فَلَنَسْئَلَنَّ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة واللام لام القسم، والفاء حرف استئناف.\n(الَّذِينَ) اسم موصول مبني على الفتح في محل نصب مفعول به، والجملة لا محل لها جواب القسم.\n(أُرْسِلَ إِلَيْهِمْ) مضارع مبني للمجهول ونائب فاعله والجملة صلة الموصول لا محل لها.\n(وَلَنَسْئَلَنَّ) سبق اعرابها (الْمُرْسَلِينَ) مفعول به والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":7,"text":"(فَلَنَقُصَّنَّ) مثل فلنسألن.\n(عَلَيْهِمْ) متعلقان بالفعل قبلهما.\n(بِعِلْمٍ) متعلقان بمحذوف حال مبيّنين بعلم.\n(وَما كُنَّا غائِبِينَ) كان واسمها وخبرها وما نافية والجملة معطوفة أو حالية.","surah_id":7,"source_id":7},{"ayah_number":8,"text":"(الْوَزْنُ) مبتدأ.\n(يَوْمَئِذٍ) ظرف زمان متعلق بمحذوف خبر المبتدأ إذ ظرف لما مضى من الزمن مبني على السكون في محل جر بالإضافة، وتنوينه تنوين عوض عن جملة محذوفة يوم تقوم الساعة.\n(الْحَقُّ) صفة للوزن أو خبر، والجملة مستأنفة لا محل لها.\n(فَمَنْ) اسم شرط جازم في محل رفع مبتدأ، والفاء استئنافية (ثَقُلَتْ مَوازِينُهُ) فعل ماض وفاعله.\n(فَأُولئِكَ) الفاء رابطة واسم إشارة في محل رفع مبتدأ أول.\n(هُمُ) ضمير منفصل في محل رفع مبتدأ ثان أو ضمير فصل لا محل له و(الْمُفْلِحُونَ) خبر أولئك أو خبر المبتدأ الثاني هم وجملة هم المفلحون في محل رفع خبر أولئك وجملة فأولئك في محل جزم جواب الشرط، وجملة فعل الشرط وجوابه في محل رفع خبر المبتدأ من.","surah_id":7,"source_id":7},{"ayah_number":9,"text":"(وَمَنْ خَفَّتْ مَوازِينُهُ) الجملة الفعلية معطوفة.\n(فَأُولئِكَ) مبتدأ والفاء رابطة (الَّذِينَ) اسم موصول مبني على الفتح في محل رفع خبر المبتدأ أولئك والجملة واقعة في محل جزم جواب الشرط وجملة (خَسِرُوا أَنْفُسَهُمْ) صلة الموصول لا محل لها.\n(بِما) مصدرية والمصدر المؤول من ما والفعل الناقص (كانُوا) بعدها في محل جر بالباء.\n(بِآياتِنا) متعلقان بالفعل بعدهما وجملة (يَظْلِمُونَ) في محل نصب خبر كان.","surah_id":7,"source_id":7},{"ayah_number":10,"text":"(وَلَقَدْ) اللام واقعة في جواب القسم. وقد حرف تحقيق (مَكَّنَّاكُمْ فِي الْأَرْضِ) فعل ماض وفاعله ومفعوله، وقد تعلق الجار والمجرور بهذا الفعل والجملة لا محل لها من الإعراب.\n(وَجَعَلْنا لَكُمْ) فعل ماض تعلق به الجار والمجرور ونا فاعله.\n(فِيها) متعلقان بمحذوف حال من معايش كان صفة له فلما تقدم عليه صار حالا.\n(مَعايِشَ) مفعول به والجملة معطوفة (قَلِيلًا) صفة لمصدر محذوف.\n(ما) زائدة وجملة (تَشْكُرُونَ) مستأنفة لا محل لها أو حالية.","surah_id":7,"source_id":7},{"ayah_number":11,"text":"(وَلَقَدْ خَلَقْناكُمْ) اللام واقعة في جواب القسم وماض وفاعله ومفعوله (ثُمَّ صَوَّرْناكُمْ) عطف (ثُمَّ) حرف عطف (قُلْنا لِلْمَلائِكَةِ) فعل ماض تعلق به الجار والمجرور ونا فاعله والجملة معطوفة.\n(اسْجُدُوا) فعل أمر مبني على حذف النون والواو فاعله.\n(لِآدَمَ) اسم مجرور بالفتحة نيابة عن الكسرة ممنوع من الصرف للعلمية والعجمة، والجار والمجرور متعلقان باسجدوا، والجملة مقول القول (فَسَجَدُوا) فعل ماض وفاعل والجملة معطوفة.\n(إِلَّا) أداة استثناء (إِبْلِيسَ) مستثنى منصوب.\n(لَمْ) جازمة (يَكُنْ) مضارع ناقص مجزوم واسمها ضمير مستتر تقديره هو.\n(مِنَ السَّاجِدِينَ) متعلقان بمحذوف خبر يكن، والجملة في محل نصب حال أو مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":12,"text":"(قالَ) الجملة مستأنفة (ما مَنَعَكَ) ما اسم استفهام مبني على السكون في محل رفع مبتدأ، منعك فعل ماض ومفعوله وفاعله أنت والجملة في محل رفع خبر.\n(أن) حرف مصدري ونصب (لا) زائدة.\nوالمصدر المؤول من الفعل (تَسْجُدَ) والحرف المصدري قبله في محل جر بحرف الجر أي ما منعك من السجود والجار والمجرور متلعقان بالفعل قبلهما.\n(إِذْ) ظرف لما مضى من الزمن مبني على السكون في محل نصب متعلق بتسجد، (أَمَرْتُكَ) فعل ماض وفاعل ومفعول به والجملة في محل جر بالإضافة، (قالَ) فعل ماض، (أَنَا) مبتدأ، (خَيْرٌ مِنْهُ) خبر تعلق به الجار والمجرور بعده لأنه اسم تفضيل أصله أخير.\n(خَلَقْتَنِي) فعل ماض وفاعله ومفعوله والنون للوقاية والجملة تعليلية لا محل لها من الإعراب.\n(مِنْ نارٍ) متعلقان بالفعل قبلهما وجملة (وَخَلَقْتَهُ) معطوفة (مِنْ طِينٍ) متعلقان بالفعل قبلهما.","surah_id":7,"source_id":7},{"ayah_number":13,"text":"(قالَ) الجملة مستأنفة (فَاهْبِطْ مِنْها) فعل أمر تعلق به الجار والمجرور والفاعل أنت والفاء زائدة والجملة مقول القول (فَما) ما نافية والفاء عاطفة (يَكُونُ) فعل مضارع تام بمعنى يجوز تعلق به الجار والمجرور بعده، (أَنْ تَتَكَبَّرَ) المصدر المؤول من أن والفعل في محل رفع فاعل (فِيها) متعلقان بالفعل قبلهما، وجملة فما يكون معطوفة (فَاخْرُجْ) الجملة معطوفة.\n(إِنَّكَ) إن والكاف اسمها (مِنَ الصَّاغِرِينَ) اسم مجرور بالياء لأنه جمع مذكر سالم والجار والمجرور متعلقان بمحذوف خبر إن والجملة في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":14,"text":"(قالَ) الجملة مستأنفة (أَنْظِرْنِي إِلى يَوْمِ) فعل أمر للدعاء تعلق به الجار والمجرور، الفاعل أنت والنون للوقاية والياء مفعول به.\n(يُبْعَثُونَ) مضارع مرفوع بثبوت النون مبني للمجهول والواو نائب فاعل، والجملة في محل جر بالإضافة وجملة أنظرني مقول القول.","surah_id":7,"source_id":7},{"ayah_number":15,"text":"(قالَ) الجملة مستأنفة (إِنَّكَ مِنَ الْمُنْظَرِينَ) مثل إنك من الصاغرين.","surah_id":7,"source_id":7},{"ayah_number":16,"text":"(قالَ) سبق إعرابها (فَبِما) الفاء زائدة. الباء حرف جر. ما مصدرية (أَغْوَيْتَنِي) فعل ماض مبني على السكون، والتاء فاعل، والنون للوقاية، والياء مفعول به. والمصدر المؤول من الفعل وما قبله في محل جر بالباء، والجار والمجرور متعلقان بفعل القسم المحذوف، وجملة القسم مقول القول.\n(لَأَقْعُدَنَّ) اللام واقعة في جواب القسم، أقعدن فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة. وفاعله أنا (لَهُمْ) متعلقان بأقعدن.\n(صِراطَكَ) منصوب بنزع الخافض، أو ظرف مكان متعلق بالفعل قبله.\n(الْمُسْتَقِيمَ) صفة. وجملة لأقعدن لا محل لها جواب القسم.","surah_id":7,"source_id":7},{"ayah_number":17,"text":"(ثُمَّ) عاطفة (لَآتِيَنَّهُمْ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة والفاعل أنا، والهاء مفعول به، واللام واقعة في جواب القسم. والجملة لا محل لها جواب القسم (مِنْ بَيْنِ) متعلقان بالفعل قبلهما.\n(أَيْدِيهِمْ) مضاف إليه مجرور بالكسرة المقدرة على الياء للثقل. والهاء في محل جر بالإضافة.\n(وَعَنْ أَيْمانِهِمْ وَعَنْ شَمائِلِهِمْ) عطف.\n(وَلا تَجِدُ) فعل مضارع مرفوع. فاعله أنت لا نافية.\n(أَكْثَرَهُمْ) مفعول به أول (شاكِرِينَ) مفعول به ثان. أو حال، والجملة مستأنفة لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":18,"text":"(قالَ) الجملة مستأنفة (اخْرُجْ) منها فعل أمر تعلق به الجار والمجرور بعده فاعله أنت والجملة مقول القول.\n(مَذْؤُماً) حال.\n(مَدْحُوراً) حال ثانية.\n(لَمَنْ) اللام موطئة للقسم. من اسم شرط جازم في محل رفع مبتدأ.\n(تَبِعَكَ) فعل ماض تعلق به الجار والمجرور فاعله هو (مِنْهُمْ) والكاف مفعول به.\n(لَأَمْلَأَنَّ) اللام واقعة في جواب القسم (أملأن) مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة. والفاعل أنا (جَهَنَّمَ) مفعوله.\n(مِنْكُمْ) متعلقان بالفعل قبلهما (أَجْمَعِينَ) توكيد منصوب بالياء لأنه جمع مذكر سالم.\nوالجملة لا محل لها جواب القسم، وقد سد جواب القسم مسد جواب الشرط. وفعل الشرط وجوابه خبر المبتدأ.","surah_id":7,"source_id":7},{"ayah_number":19,"text":"(وَيا آدَمُ) يا أداة نداء ومنادى مفرد علم مبني على الضم في محل نصب، والواو عاطفة (اسْكُنْ) فعل أمر والفاعل ضمير مستتر تقديره أنت والجملة معطوفة على جملة اخرج..\n(أَنْتَ) توكيد للضمير المستتر في الفعل (وَزَوْجُكَ) اسم معطوف على أنت.\n(الْجَنَّةَ) مفعول به.\n(فَكُلا) فعل أمر مبني على حذف النون، وألف الاثنين فاعل والجملة معطوفة بالفاء.\n(مِنْ) حرف جر (حَيْثُ) ظرف مكان مبني على الضم في محل جر بمن، والجار والمجرور متعلقان بالفعل قبلهما (شِئْتُما) فعل ماض مبني على السكون والتاء فاعل وما للتثنية، والجملة في محل جر بالإضافة.\n(وَلا تَقْرَبا) فعل مضارع مجزوم بلا الناهية وعلامة جزمه حذف النون لأنه من الأفعال الخمسة، والألف فاعل (هذِهِ) اسم إشارة في محل نصب مفعول به.\n(الشَّجَرَةَ) بدل منصوب بالفتحة.\n(فَتَكُونا) فعل مضارع ناقص منصوب بأن المضمرة بعد فاء السببية وعلامة نصبه حذف النون وألف الإثنين اسمها. وأن المضمرة والفعل بعدها في تأويل مصدر معطوف على ما قبله والتقدير فلا يكن منكم قرب فظلم.\n(مِنَ الظَّالِمِينَ) متعلقان بمحذوف خبر.","surah_id":7,"source_id":7},{"ayah_number":20,"text":"(فَوَسْوَسَ لَهُمَا الشَّيْطانُ) فعل ماض تعلق به الجار والمجرور والشيطان فاعله والجملة معطوفة.\n(لِيُبْدِيَ) فعل مضارع منصوب بأن المضمرة بعد لام التعليل والمصدر المؤول في محل جر باللام، والجار والمجرور متعلقان بوسوس (لَهُمَا) متعلقان بيبدي.\n(ما) اسم موصول في محل نصب مفعول به.\n(وُورِيَ عَنْهُما) فعل ماض مبني للمجهول، تعلق به الجار والمجرور ونائب فاعله ضمير مستتر تقديره هو.\n(مِنْ سَوْآتِهِما) متعلقان بمحذوف حال.\n(وَقالَ) الجملة مستأنفة (ما نَهاكُما) ما: نافية وفعل ماض مبني على الفتحة المقدرة على الألف، والكاف مفعوله والجملة مقول القول.\n(رَبُّكُما) فاعل.\n(عَنْ) حرف جر (هذِهِ) اسم إشارة في محل جر بحرف الجر.\n(الشَّجَرَةِ) بدل مجرور (إِلَّا) أداة حصر.\n(أَنْ تَكُونا مَلَكَيْنِ) فعل مضارع ناقص وألف الإثنين اسمها وملكين خبرها والمصدر المؤول من أن الناصبة والفعل في محل جر بالإضافة أي كراهة كونكما ملكين (أَوْ تَكُونا مِنَ الْخالِدِينَ) عطف.","surah_id":7,"source_id":7},{"ayah_number":21,"text":"(وَقاسَمَهُما) فعل ماض والهاء مفعوله والميم والألف للتثنية والفاعل هو يعود إلى الشيطان.\n(إِنِّي) إن وياء المتكلم اسمها.\n(لَكُما) متعلقان بالناصحين بعدها.\n(لَمِنَ النَّاصِحِينَ) اللام هي المزحلقة (من النَّاصِحِينَ) متعلقان بمحذوف خبر إن. والجملة الاسمية (إِنِّي لَكُما لَمِنَ النَّاصِحِينَ) لا محل لها جواب القسم، وجملة (قاسَمَهُما) معطوفة على جملة قال ما نهاكما.","surah_id":7,"source_id":7},{"ayah_number":22,"text":"(فَدَلَّاهُما بِغُرُورٍ) الفاء عاطفة وفعل ماض تعلق به الجار والمجرور بعده والفاعل هو والهاء مفعول به والجملة معطوفة.\n(فَلَمَّا) ظرفية حينية والفاء استئنافية (ذاقَا الشَّجَرَةَ) فعل ماض وألف الإثنين فاعله والشجرة مفعوله والجملة في محل جر بالإضافة.\n(بَدَتْ لَهُما سَوْآتُهُما) فعل ماض مبني على الفتحة المقدرة على الألف المحذوفة منعا لالتقاء الساكنين، وقد تعلق به الجار والمجرور بعده وسوآتهما فاعل مرفوع، والجملة لا محل لها جواب شرط غير جازم.\n(وَطَفِقا) فعل ماض ناقص، والألف اسمها.\n(يَخْصِفانِ عَلَيْهِما) فعل مضارع مرفوع بثبوت النون، والألف فاعله وجار ومجرور متعلقان بالفعل وكذلك الجار والمجرور (مِنْ وَرَقِ) (الْجَنَّةِ) مضاف إليه (وَناداهُما رَبُّهُما) فعل ماض ومفعوله وفاعله والجملة معطوفة.\n(أَلَمْ أَنْهَكُما) فعل مضارع مجزوم بلم وعلامة جزمه حذف حرف العلة لأنه معتل الآخر والكاف مفعول به.\n(تِلْكُمَا) ت اسم إشارة مبني على الكسر في محل جر بعن واللام للبعد والكاف للخطاب وما للتثنية.\n(الشَّجَرَةَ) بدل (وَأَقُلْ لَكُما) مضارع معطوف على أنهكما مجزوم مثله بالسكون وقد تعلق به الجار والمجرور بعده، والجملة معطوفة.\n(إِنَّ الشَّيْطانَ لَكُما عَدُوٌّ) إن واسمها وخبرها والجار والمجرور متعلقان بعدو و(مُبِينٌ) صفة والجملة مقول القول.","surah_id":7,"source_id":7},{"ayah_number":23,"text":"(قالا) فعل ماض وفاعل.\n(رَبَّنا) منادى مضاف منصوب.\n(ظَلَمْنا أَنْفُسَنا) فعل ماض وفاعل ومفعول به والجملة مقول القول.\n(وَإِنْ) شرطية والواو عاطفة.\n(لَمْ) جازمة (تَغْفِرْ) مضارع مجزوم وهو فعل الشرط.\n(وَتَرْحَمْنا) عطف (لَنَكُونَنَّ) اللام واقعة في جواب الشرط. نكونن فعل مضارع ناقص مبني على الفتح لاتصاله بنون التوكيد الثقيلة واسمها ضمير مستتر تقديره نحن (مِنَ الْخاسِرِينَ) متعلقان بمحذوف خبرها والجملة لا محل لها جواب شرط لم يقترن بالفاء... وقد أغنى جواب الشرط عن جواب القسم. ويجوز أن تعرب جملة لنكونن جواب القسم واللام لام القسم وقد أغنى عن جواب الشرط.","surah_id":7,"source_id":7},{"ayah_number":24,"text":"(قالَ) الجملة مستأنفة (اهْبِطُوا) فعل أمر مبني على حذف النون والواو فاعله والجملة مقول القول.\n(بَعْضُكُمْ) مبتدأ.\n(لِبَعْضٍ) متعلقان بالخبر (عَدُوٌّ) والجملة مستأنفة لا محل لها.\n(وَلَكُمْ) متعلقان بمحذوف خبر، ومثلها الجار والمجرور (فِي الْأَرْضِ).\n(مُسْتَقَرٌّ) مبتدأ مؤخر (وَمَتاعٌ) عطف.\n(إِلى حِينٍ) متعلقان بمحذوف صفة متاع أي متاع ممتد إلى حين، والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":25,"text":"(قالَ) الجملة مستأنفة (فِيها تَحْيَوْنَ) مضارع مرفوع بثبوت النون، تعلق به الجار والمجرور قبله والواو فاعله.\nوالجملة معطوفة.\n(وَفِيها تَمُوتُونَ وَمِنْها تُخْرَجُونَ) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":26,"text":"(يا بَنِي) يا أداة نداء، بني منادى مضاف منصوب وعلامة نصبه الياء لأنه ملحق بجمع المذكر السالم، وحذفت النون للإضافة.\n(آدَمَ) مضاف إليه مجرور بالفتحة بدل الكسرة اسم علم اعجمي.\n(قَدْ) حرف تحقيق.\n(أَنْزَلْنا عَلَيْكُمْ لِباساً) فعل ماض مبني على السكون تعلق به الجار والمجرور ونا فاعله ولباسا مفعوله والجملة مستأنفة لا محل لها.\n(يُوارِي) فعل مضارع مرفوع بالضمة المقدرة على الياء للثقل والفاعل هو.\n(سَوْآتِكُمْ) مفعول به منصوب بالكسرة بدل الفتحة لأنه جمع مؤنث سالم، والجملة في محل نصب صفة لباس.\n(وَرِيشاً) عطف.\n(وَلِباسُ) الواو حالية لباس مبتدأ (التَّقْوى) مضاف إليه مجرور بالكسرة المقدرة على الألف.\n(ذلِكَ) اسم إشارة في محل رفع مبتدأ (خَيْرٌ) خبره. والجملة الاسمية ذلك خير خبر المبتدأ لباس.\n(ذلِكَ) اسم إشارة في محل رفع مبتدأ.\n(مِنْ آياتِ) متعلقان بمحذوف خبره، والجملة مستأنفة لا محل لها.\n(لَعَلَّهُمْ) لعل والهاء اسمها وجملة (يَذَّكَّرُونَ) في محل رفع خبرها.\nوجملة (لَعَلَّهُمْ يَذَّكَّرُونَ) تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":27,"text":"(يا بَنِي آدَمَ) تقدم إعرابها في الآية السابقة.\n(لا يَفْتِنَنَّكُمُ) يفتننّ مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، وهو في محل جزم بلا الناهية، والكاف مفعوله والميم لجمع الذكور. و(الشَّيْطانُ) فاعله، والجملة مستأنفة لا محل لها.\n(كَما) الكاف حرف جر، ما مصدرية.\n(أَخْرَجَ) فعل ماض فاعله مستتر (أَبَوَيْكُمْ) مفعوله منصوب بالياء، وحذفت النون للإضافة، والكاف ضمير متصل في محل جر بالإضافة.\n(مِنَ الْجَنَّةِ) متعلقان بالفعل أخرج. والمصدر المؤول من ما المصدرية والفعل بعدها في محل جر بالكاف والجار والمجرور متعلقان بمحذوف صفة لمصدر محذوف والتقدير لا يفتننكم الشيطان فتنة كائنة كفتنة.\n(يَنْزِعُ عَنْهُما لِباسَهُما) فعل مضارع تعلق به الجار والمجرور ولباسهما مفعوله والجملة في محل نصب حال.\n(لِيُرِيَهُما) فعل مضارع تعلق به الجار والمجرور والفاعل هو والهاء مفعوله والجملة في محل نصب حال، وهو منصوب بأن المضمرة بعد لام التعليل (سَوْآتِهِما) مفعوله الثاني منصوب بالكسرة لأنه جمع مؤنث سالم. والمصدر المؤول من أن المصدرية والفعل بعدها في تأويل مصدر في محل جر باللام، والجار والمجرور متعلقان بالفعل ينزع.\n(إِنَّهُ) إن والهاء اسمها وجملة (يَراكُمْ) في محل رفع خبر إن وجملة (إِنَّهُ يَراكُمْ) تعليلية لا محل لها من الإعراب.\n(هُوَ) ضمير رفع منفصل في محل رفع توكيد للضمير المستتر في الفعل يراكم.\n(وَقَبِيلُهُ) اسم معطوف على الضمير المرفوع في يراكم.\n(حَيْثُ) ظرف مكان مبني على الضم في محل: جر بحرف الجر، والجار والمجرور متعلقان بالفعل يراكم.\n(لا تَرَوْنَهُمْ) فعل مضارع والهاء مفعوله ولا نافية والجملة في محل جر بالإضافة.\n(إِنَّا) إن واسمها.\n(جَعَلْنَا الشَّياطِينَ أَوْلِياءَ) فعل ماض وفاعله ومفعولاه والجملة في محل رفع خبر إن. وجملة (إِنَّا جَعَلْنَا) تعليلية لا محل لها من الإعراب.\n(لِلَّذِينَ) متعلقان بالفعل جعلنا وجملة (لا يُؤْمِنُونَ) صلة الموصول لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":28,"text":"(وَإِذا) ظرفية شرطية غير جازمة، والواو استئنافية (فَعَلُوا فاحِشَةً) فعل ماض وفاعل ومفعول به والجملة في محل جر بالإضافة وجملة (قالُوا) لا محل لها جواب شرط غير جازم.\n(وَجَدْنا عَلَيْها آباءَنا) فعل ماض تعلق به الجار والمجرور ونا فاعله وآباءنا مفعوله، والجملة مقول القول مفعول به.\n(وَاللَّهُ) لفظ الجلالة مبتدأ وجملة (أَمَرَنا بِها) خبره والجملة الاسمية (اللَّهُ أَمَرَنا بِها) معطوفة.\n(قُلْ) فعل أمر والجملة مستأنفة لا محل لها.\n(إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها وجملة (لا يَأْمُرُ بِالْفَحْشاءِ) في محل رفع خبرها والجملة الاسمية (إِنَّ اللَّهَ لا يَأْمُرُ) في محل نصب مفعول به.\n(أَتَقُولُونَ) مضارع مرفوع بثبوت النون والواو فاعله والهمزة للاستفهام والجملة مقول القول.\n(عَلَى اللَّهِ) متعلقان بالفعل قبله (ما) اسم موصول في محل نصب مفعول به، وجملة (لا تَعْلَمُونَ) صلة الموصول لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":29,"text":"(قُلْ) فعل أمر والجملة مستأنفة لا محل لها.\n(أَمَرَ) فعل ماض (رَبِّي) فاعل مرفوع بالضمة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة.\n(بِالْقِسْطِ) متعلقان بأمر.\n(وَأَقِيمُوا وُجُوهَكُمْ) فعل أمر مبني على حذف النون وفاعله ومفعوله. والجملة معطوفة على ما قبلها.\n(عِنْدَ) ظرف مكان متعلق بأقيموا.\n(كُلِّ) مضاف إليه (مَسْجِدٍ) مضاف إليه (وَادْعُوهُ) فعل أمر وفاعل ومفعول به والجملة معطوفة.\n(مُخْلِصِينَ) حال منصوبة بالياء.\n(لَهُ) متعلقان باسم الفاعل مخلصين قبله.\n(الدِّينَ) مفعول به لاسم الفاعل، وفاعله ضمير مستتر.\n(كَما) الكاف حرف جر ما مصدرية.\n(بَدَأَكُمْ) فعل ماض فاعله هو والكاف مفعوله والمصدر المؤول من الحرف المصدري والفعل في محل جر بالكاف، والجار والمجرور متعلقان بمحذوف نعت لمصدر محذوف والتقدير تعودون عودا مثل بدئكم.\nوجملة (تَعُودُونَ) استئنافية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":30,"text":"(فَرِيقاً) مفعول به مقدم للفعل (هَدى). وجملة (فَرِيقاً هَدى) في محل نصب حال أي هاديا فريقا ومضلا فريقا.\n(وَفَرِيقاً) مفعول به لفعل محذوف تقديره وأضل والجملة معطوفة، وجملة (حَقَّ عَلَيْهِمُ الضَّلالَةُ) في محل نصب صفة لفريق.\n(إِنَّهُمُ) إن والهاء اسمها.\n(اتَّخَذُوا الشَّياطِينَ أَوْلِياءَ) فعل ماض وفاعله ومفعولاه.\n(مِنْ دُونِ) متعلقان بمحذوف صفة أولياء والجملة خبر إن، وجملة (إِنَّهُمُ) تعليلية لا محل لها من الإعراب.\n(وَيَحْسَبُونَ) مضارع مرفوع والجملة معطوفة (أَنَّهُمْ مُهْتَدُونَ) أن واسمها وخبرها سدت مسد مفعولي يحسبون.","surah_id":7,"source_id":7},{"ayah_number":31,"text":"(يا بَنِي آدَمَ) تقدمت في الآية 25.\n(خُذُوا زِينَتَكُمْ) فعل أمر مبني على حذف النون والواو فاعله (زِينَتَكُمْ) مفعوله، والجملة ابتدائية.\n(عِنْدَ) ظرف مكان متعلق بالفعل قبله.\n(كُلِّ) مضاف إليه (مَسْجِدٍ) مضاف إليه (وَكُلُوا وَاشْرَبُوا) عطف على خذوا (وَلا تُسْرِفُوا) مضارع مجزوم بحذف النون لسبقه بلا الناهية والجملتان كلوا ولا تسرفوا معطوفتان. وجملة (إِنَّهُ لا يُحِبُّ الْمُسْرِفِينَ) تعليلية لا محل لها من الإعراب وجملة (لا يُحِبُّ) خبر إن.","surah_id":7,"source_id":7},{"ayah_number":32,"text":"(قُلْ) الجملة مستأنفة (مَنْ) اسم استفهام في محل رفع مبتدأ وجملة (حَرَّمَ زِينَةَ اللَّهِ) خبره (الَّتِي) اسم موصول في محل نصب صفة لزينة وجملة (أَخْرَجَ) صلة الموصول لا محل لها (وَالطَّيِّباتِ) عطف على زينة منصوب بالكسرة نيابة عن الفتحة جمع مؤنث سالم.\n(مِنَ الرِّزْقِ) متعلقان بمحذوف حال، (قُلْ) سبق إعرابها (هِيَ) مبتدأ (لِلَّذِينَ) متعلقان بالخبر، وجملة (آمَنُوا) صلة الموصول لا محل لها.\n(فِي الْحَياةِ) متعلقان بالفعل (الدُّنْيا) صفة الحياة مجرورة بالكسرة المقدرة على الألف للتعذر (خالِصَةً) حال منصوبة.\n(يَوْمَ) ظرف زمان متعلق بخالصة.\n(الْقِيامَةِ) مضاف إليه (كَذلِكَ) ذا اسم إشارة في محل جر بالكاف والجار والمجرور متعلقان بمحذوف صفة لمصدر محذوف نفصل الآيات تفصيلا مثل ذلك.. وجملة (نُفَصِّلُ) تعليلية لا محل لها من الإعراب وجملة (يَعْلَمُونَ) صفة.","surah_id":7,"source_id":7},{"ayah_number":33,"text":"(قُلْ) الجملة مستأنفة (إِنَّما) كافة ومكفوفة.\n(حَرَّمَ) ماض فاعله مستتر (رَبِّيَ) فاعل حرم مرفوع بالضمة المقدرة على ما قبل ياء المتكلم، والياء في محل جر بالإضافة.\n(الْفَواحِشَ) مفعول به.\n(ما ظَهَرَ مِنْها) ما اسم موصول مبني على السكون في محل نصب بدل من الفواحش وجملة ظهر صلة الموصول لا محل لها.\n(وَما بَطَنَ) عطف.\n(وَالْإِثْمَ وَالْبَغْيَ) عطف على الفواحش.\n(بِغَيْرِ) متعلقان بالبغي.\n(الْحَقِّ) مضاف إليه، وجملة (إِنَّما حَرَّمَ) مقول القول.\n(وَأَنْ تُشْرِكُوا) مضارع منصوب بأن وعلامة نصبه حذف النون والواو فاعل، والمصدر المؤول معطوف أيضا حرم ربي الفواحش والشرك.\n(بِاللَّهِ) متعلقان بتشركوا.\n(ما) اسم موصول مفعول به (لَمْ يُنَزِّلْ بِهِ سُلْطاناً) مضارع مجزوم تعلق به الجار والمجرور وسلطانا مفعوله والجملة صلة الموصول لا محل لها.\n(وَأَنْ تَقُولُوا) المصدر المؤول معطوف تقديره حرم الشرك وقول مالا تعلمون.\n(عَلَى) حرف جر (اللَّهِ) لفظ الجلالة في محل جر متعلقان بالفعل قبلهما (ما) اسم موصول في محل نصب مفعول به وجملة (لا تَعْلَمُونَ) صلته.","surah_id":7,"source_id":7},{"ayah_number":34,"text":"(وَلِكُلِّ) متعلقان بمحذوف خبر مقدم.\n(أُمَّةٍ) مضاف إليه (أَجَلٌ) مبتدأ مؤخر والجملة مستأنفة لا محل لها (فَإِذا) الفاء استئنافية.\n(إذا) ظرفية شرطية غير جازمة وجملة (جاءَ أَجَلُهُمْ) في محل جر بالإضافة.\n(لا يَسْتَأْخِرُونَ) مضارع مرفوع والواو فاعله.\n(ساعَةً) ظرف زمان والجملة لا محل لها جواب شرط غير جازم. وجملة (وَلا يَسْتَقْدِمُونَ) عطف.","surah_id":7,"source_id":7},{"ayah_number":35,"text":"(يا بَنِي آدَمَ) سبق اعرابها (إِمَّا) إن شرطية جازمة، ما زائدة.\n(يَأْتِيَنَّكُمْ) مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة في محل جزم، والكاف مفعوله (رُسُلٌ) فاعله والجار والمجرور (مِنْكُمْ) متعلقان بمحذوف صفة (رُسُلٌ)، والجملة مستأنفة.\n(يَقُصُّونَ عَلَيْكُمْ آياتِي) فعل مضارع تعلق به الجار والمجرور والواو فاعله وآياتي مفعوله منصوب بالكسرة والياء في محل جر بالإضافة. والجملة في محل رفع صفة رسل.\n(فَمَنِ) من اسم شرط جازم في محل رفع مبتدأ، والفاء رابطة لجواب الشرط، (اتَّقى) فعل ماض مبني على الفتحة المقدرة وهو في محل جزم فعل الشرط ومثله (أَصْلَحَ).\n(فَلا) الفاء رابطة لجواب الشرط، ولا نافية لا عمل لها.\n(خَوْفٌ) مبتدأ.\n(عَلَيْهِمْ) متعلقان بمحذوف خبر المبتدأ والجملة في محل جزم جواب الشرط، وجملة (فَمَنِ اتَّقى) استئنافية.\n(هُمْ) ضمير منفصل في محل رفع مبتدأ وجملة (يَحْزَنُونَ) في محل رفع خبره وجملة (وَلا هُمْ) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":36,"text":"(وَالَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(كَذَّبُوا بِآياتِنا) فعل ماض تعلق به الجار والمجرور والواو فاعله والجملة صلة الموصول وجملة (اسْتَكْبَرُوا عَنْها) معطوفة.\n(أُولئِكَ) اسم إشارة مبني على الكسر في محل رفع مبتدأ.\n(أَصْحابُ) خبره وجملة (أُولئِكَ أَصْحابُ النَّارِ) في محل رفع خبر المبتدأ الذين.\n(هُمْ) ضمير رفع منفصل في محل رفع مبتدأ.\n(فِيها) متعلقان بالخبر المؤخر (خالِدُونَ) والجملة الاسمية في محل نصب حال. وجملة (الَّذِينَ) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":37,"text":"(فَمَنْ) من اسم استفهام مبني على السكون في محل رفع مبتدأ، والفاء استئنافية.\n(أَظْلَمُ) خبره، (مِمَّنِ) اسم موصول مبني على السكون في محل جر بمن والجار والمجرور متعلقان بأظلم.\n(افْتَرى عَلَى اللَّهِ كَذِباً) فعل ماض تعلق به الجار والمجرور وكذبا مفعوله والجملة صلة الموصول. وجملة (أَوْ كَذَّبَ بِآياتِهِ) معطوفة.\n(أُولئِكَ) اسم إشارة مبتدأ.\n(يَنالُهُمْ نَصِيبُهُمْ مِنَ الْكِتابِ) مضارع ومفعوله وفاعله من الكتاب متعلقان بمحذوف حال من نصيبهم. والجملة الفعلية خبر أولئك.\n(حَتَّى) حرف غاية وجر.\n(إِذا جاءَتْهُمْ رُسُلُنا) فعل ماض ومفعوله وفاعله والتاء للتأنيث والجملة في محل جر بالإضافة.\n(يَتَوَفَّوْنَهُمْ) فعل مضارع وفاعله ومفعوله والجملة في محل نصب حال. وجملة (قالُوا) لا محل لها جواب شرط غير جازم.\n(أَيْنَ) اسم استفهام في محل نصب على الظرفية المكانية متعلق بمحذوف خبر مقدم، (ما كُنْتُمْ) ما اسم موصول في محل رفع مبتدأ مؤخر، كنتم كان والتاء اسمها وجملة (تَدْعُونَ مِنْ دُونِ اللَّهِ) خبرها (قالُوا) الجملة مستأنفة لا محل لها وجملة (ضَلُّوا عَنَّا) مقول القول، وجملة (شَهِدُوا عَلى أَنْفُسِهِمْ) معطوفة.\n(أَنَّهُمْ) أن واسمها وجملة (كانُوا كافِرِينَ) خبرها. وأن وما بعدها في تأويل مصدر في محل جر بحرف الجر، شهدوا على أنفسهم بكفرهم، والجار والمجرور متعلقان بشهدوا.","surah_id":7,"source_id":7},{"ayah_number":38,"text":"(قالَ) الجملة مستأنفة (ادْخُلُوا) فعل أمر تعلق به الجار والمجرور (فِي أُمَمٍ) مبني على حذف النون والواو فاعله، والجملة مقول القول.\n(قَدْ خَلَتْ) قد حرف تحقيق وفعل ماض تعلق به الجار والمجرور بعده، مبني على الفتحة المقدرة على الألف المحذوفة لالتقاء الساكنين، والتاء للتأنيث والجملة في محل جر صفة لأمم.\n(مِنَ الْجِنِّ وَالْإِنْسِ) متعلقان بمحذوف صفة لأمم.\n(فِي النَّارِ) متعلقان بالفعل ادخلوا (كُلَّما) ظرفية زمانية تفيد معنى الشرط، وجملة (دَخَلَتْ أُمَّةٌ) في محل جر بالإضافة وجملة (لَعَنَتْ أُخْتَها) لا محل لها جواب شرط غير جازم، (حَتَّى) حرف غاية وجر.\n(إِذَا) ظرفية شرطية غير جازمة.\n(ادَّارَكُوا) فعل ماض مبني على الضم والواو فاعله.\n(فِيها) متعلقان باداركوا.\n(جَمِيعاً) حال والجملة في محل جر بالإضافة.\n(قالَتْ) فعل ماض.\n(أُخْراهُمْ) فاعل مرفوع بالضمة المقدرة على الألف للتعذر. هم ضمير متصل في محل جر بالإضافة.\n(لِأُولاهُمْ) اسم مجرور وعلامة جره الكسرة المقدرة على الألف للتعذر والجار والمجرور متعلقان بالفعل قالت. والجملة لا محل لها جواب شرط غير جازم.\n(رَبَّنا) منادى مضاف منصوب، ونا في محل جر بالإضافة.\n(هؤُلاءِ) اسم اشارة في محل رفع مبتدأ مبني على الكسرة.\n(أَضَلُّونا) فعل ماض وفاعله ومفعوله والجملة في محل رفع خبر المبتدأ.\n(فَآتِهِمْ) فعل دعاء مبني على حذف حرف العلة، لأنه معتل الآخر، والهاء مفعوله الأول والميم للجمع. والفاء قبله هي الفصيحة.\n(عَذاباً) مفعوله الثاني (ضِعْفاً) صفة لعذاب.\n(مِنَ النَّارِ) متعلقان بمحذوف صفة ثانية لعذاب، وجملة (آتهم) لا محل لها جواب شرط مقدر.\n(قالَ) الجملة مستأنفة (لِكُلٍّ) متعلقان بمحذوف خبر مقدم للمبتدأ (ضِعْفٌ) والجملة مفعول به لقال (وَلكِنْ) حرف استدراك والواو حالية.\nوجملة (لا تَعْلَمُونَ) في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":39,"text":"(وَقالَتْ أُولاهُمْ لِأُخْراهُمْ) تقدم إعرابها في الآية السابقة.\n(فَما) الفاء زائدة، ما نافية.\n(كانَ) ماض ناقص (لَكُمْ عَلَيْنا) متعلقان بمحذوف خبر كان.\n(مِنْ فَضْلٍ) من حرف جر زائد، فضل اسم مجرور لفظا مرفوع محلا على أنه اسم كان والجملة مقول القول مفعول به.\n(فَذُوقُوا) الفاء هي الفصيحة، والجملة الفعلية (ذوقوا الْعَذابَ) جواب شرط مقدر لا محل لها إذا كان القول حاصلا فذوقوا العذاب...\n(بِما) ما موصولة أو مصدرية (كُنْتُمْ) الجملة صلة، وجملة (تَكْسِبُونَ) في محل رفع خبر كنتم.","surah_id":7,"source_id":7},{"ayah_number":40,"text":"(إِنَّ الَّذِينَ كَذَّبُوا بِآياتِنا) الذين اسم موصول اسم إن والجملة بعده صلة الموصول لا محل لها وجملة (اسْتَكْبَرُوا عَنْها) معطوفة عليها.\n(لا تُفَتَّحُ) مضارع مبني للمجهول و(أَبْوابُ) نائب فاعله.\n(لَهُمْ) متعلقان بالفعل والجملة في محل رفع خبر إن (وَلا يَدْخُلُونَ الْجَنَّةَ) فعل مضارع وفاعله ومفعوله، لا نافية، والجملة معطوفة.\n(حَتَّى يَلِجَ) مضارع منصوب بأن المضمرة بعد حتى، والمصدر المؤول من الفعل والحرف المصدري قبله في محل جر بحرف الجر، والجار والمجرور متعلقان بيدخلون.\n(الْجَمَلُ) فاعل (فِي سَمِّ) متعلقان بالفعل يلج.\n(الْخِياطِ) مضاف إليه (وَكَذلِكَ) اسم الإشارة في محل جر بالكاف والجار والمجرور متعلقان بمحذوف نعت لمصدر محذوف (نَجْزِي الْمُجْرِمِينَ) جزاء مثل جزاء المكذبين...\n(الْمُجْرِمِينَ) مفعول به منصوب بالياء لأنه جمع مذكر سالم والجملة مستأنفة لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":41,"text":"(لَهُمْ) متعلقان بمحذوف خبر مقدم للمبتدأ (مِهادٌ).\n(مِنْ جَهَنَّمَ) متعلقان بمحذوف خبر ثان. والجملة الاسمية في محل نصب حال أو مستأنفة لا محل لها.\n(مِنْ فَوْقِهِمْ) متعلقان بمحذوف خبر مقدم (غَواشٍ) مبتدأ مؤخر مرفوع بالضمة المقدرة على الياء المحذوفة.\n(وَكَذلِكَ نَجْزِي الظَّالِمِينَ) تقدم إعرابها في الآية السابقة. وجملة (وَمِنْ فَوْقِهِمْ) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":42,"text":"(وَالَّذِينَ) اسم موصول مبتدأ وجملة (آمَنُوا) صلة الموصول لا محل لها.\n(وَعَمِلُوا) الجملة معطوفة (الصَّالِحاتِ) مفعول به لعملوا منصوب بالكسرة لأنه جمع مؤنث سالم والجملة الفعلية معطوفة (لا نُكَلِّفُ) مضارع ولا نافية.\n(نَفْساً) مفعول به أول.\n(إِلَّا) أداة حصر (وُسْعَها) مفعول به ثان والفاعل ضمير مستتر تقديره نحن والجملة اعتراضية (أُولئِكَ) اسم اشارة مبتدأ (أَصْحابُ) خبر والجملة الاسمية خبر الذي.\n(الْجَنَّةِ) مضاف إليه (هُمْ) ضمير رفع منفصل في محل رفع مبتدأ (فِيها) متعلقان بالخبر (خالِدُونَ) خبره والجملة في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":43,"text":"(وَنَزَعْنا) فعل ماض وفاعله.\n(ما) اسم موصول في محل نصب مفعول به (فِي صُدُورِهِمْ) متعلقان بمحذوف صلة الموصول.\n(مِنْ غِلٍّ) متعلقان بمحذوف حال. والجملة معطوفة.\n(تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهارُ) فعل مضارع تعلق به الجار والمجرور والأنهار فاعله والجملة في محل نصب حال.\n(وَقالُوا) الجملة معطوفة (الْحَمْدُ) مبتدأ.\n(لِلَّهِ) متعلقان بمحذوف خبره والجملة مقول القول.\n(الَّذِي) اسم موصول في محل جر صفة.\n(هَدانا) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر، وفاعله هو ونا مفعوله (لِهذا) متعلقان بهدانا.\n(وَما) ما نافية والواو استئنافية.\n(كُنَّا) كان ونا اسمها.\n(لِنَهْتَدِيَ) اللام لام الجحود، نهتدي منصوب بأن المضمرة بعد لام الجحود، والمصدر المؤول من أن والفعل بعدها في محل جر باللام، والجار والمجرور متعلقان بمحذوف خبر وما كنا ميسرين للاهتداء والجملة مستأنفة.\n(لَوْ لا) حرف شرط غير جازم.\n(أَنْ) حرف مصدري ونصب.\n(هَدانَا اللَّهُ) فعل ماض ومفعوله ولفظ الجلالة فاعله والمصدر المؤول من أن والفعل في محل رفع مبتدأ والخبر محذوف بعد لولا لولا هداية اللّه موجودة...\n(لَقَدْ) اللام واقعة في جواب القسم. قد حرف تحقيق (جاءَتْ رُسُلُ رَبِّنا) فعل ماض وفاعله ومضاف إليه (بِالْحَقِّ) متعلقان بمحذوف حال والجملة لا محل لها جواب القسم المقدر.\n(وَنُودُوا) فعل ماض مبني للمجهول مبني على الضم والواو نائب فاعل (أَنْ) مفسرة أو مخففة من أن.\n(تِلْكُمُ) اسم إشارة مبني على الكسر في محل رفع مبتدأ. واللام للبعد والكاف حرف خطاب والميم للجمع.\n(الْجَنَّةُ) بدل أو خبر وجملة (أُورِثْتُمُوها) في محل نصب حال فإن أعربت الجنة بدلا فجملة أورثتموها خبر المبتدأ (أُورِثْتُمُوها) فعل ماض مبني للمجهول مبني على السكون لاتصاله بتاء الفاعل، والتاء نائب فاعل، والميم علامة جمع الذكور، والواو لإشباع الضمة، وها مفعول به.\n(بِما) ما موصولة ومتعلقان بالفعل (كُنْتُمْ تَعْمَلُونَ) كان والتاء اسمها والجملة خبرها.","surah_id":7,"source_id":7},{"ayah_number":44,"text":"(وَنادى أَصْحابُ الْجَنَّةِ أَصْحابَ النَّارِ) فعل ماض مبني على الفتحة المقدرة وفاعله ومفعوله والجملة مستأنفة.\n(أَنْ قَدْ وَجَدْنا ما وَعَدَنا) أن تفسيرية أو مخففة واسمها ضمير الشأن محذوف والجملة بعده خبر والمصدر المؤول في محل جر بحرف الجر المحذوف، والجار والمجرور متعلقان بالفعل نادى نادوا بوجدان ما وعد... وعلى اعتبارها تفسيرية فالجملة بعدها مفسرة لا محل لها. ما اسم موصول في محل نصب مفعول به وجملة وعدنا صلة الموصول لا محل لها.\n(رَبُّنا) فاعل (حَقًّا) مفعول به ثان.\n(فَهَلْ) هل حرف استفهام والفاء استئنافية وجملة (وَجَدْتُمْ) مستأنفة.\n(قالُوا) ماض وفاعله (نَعَمْ) حرف جواب وجملة (فَأَذَّنَ مُؤَذِّنٌ) مستأنفة بعد الفاء.\n(بَيْنَهُمْ) ظرف زمان متعلق بأذن.\n(أَنْ) مخففة أو تفسيرية (لَعْنَةُ) خبر أن المخففة أو مبتدأ بعد أن التفسيرية.\n(اللَّهِ) لفظ الجلالة مضاف إليه (عَلَى الظَّالِمِينَ) متعلقان بمحذوف خبر. والجملة الاسمية مفسرة أو المصدر المؤول من أن المخففة والفعل في محل جر. وأن الثانية مثل الأولى، والجملة خبرها.","surah_id":7,"source_id":7},{"ayah_number":45,"text":"(الَّذِينَ) اسم موصول مبني على الفتح في محل جر صفة للظالمين، (عَنْ سَبِيلِ) متعلقان بالفعل يصد، (اللَّهِ) لفظ الجلالة مضاف إليه وجملة (يَصُدُّونَ) صلة الموصول لا محل لها.\n(وَيَبْغُونَها) مضارع مرفوع بثبوت النون، والواو فاعله وها مفعوله.\n(عِوَجاً) حال منصوبة والجملة معطوفة.\n(وَهُمْ) ضمير رفع منفصل في محل رفع مبتدأ، والواو حالية.\n(بِالْآخِرَةِ) متعلقان بالخبر بعدهما والجملة في محل نصب حال.\n(كافِرُونَ) خبر.","surah_id":7,"source_id":7},{"ayah_number":46,"text":"(وَبَيْنَهُما) مفعول فيه ظرف مكان متعلق بمحذوف خبر مقدم، والهاء في محل جر بالإضافة، وما للتثنية، والواو استئنافية.\n(حِجابٌ) مبتدأ مؤخر، والجملة الاسمية مستأنفة (وَعَلَى الْأَعْرافِ) متعلقان بمحذوف خبر مقدم للمبتدأ (رِجالٌ) والجملة مستأنفة.\n(يَعْرِفُونَ كُلًّا) فعل مضارع تعلق به الجار والمجرور (بِسِيماهُمْ) والواو فاعله وكلا مفعوله، والجملة في محل رفع صفة لرجال.\n(وَنادَوْا أَصْحابَ) فعل ماض وفاعله ومفعوله والجملة مستأنفة بعد الواو.\n(الْجَنَّةِ) مضاف إليه.\n(أَنْ) مخففة أو تفسيرية مثل أن في الآيات السابقة.\n(سَلامٌ) مبتدأ.\n(عَلَيْكُمْ) متعلقان بمحذوف خبره والجملة تفسيرية أو خبرية.\n(لَمْ) جازمة (يَدْخُلُوها) مضارع مجزوم بحذف النون والواو فاعل وها مفعول به والجملة مستأنفة.\n(وَهُمْ) ضمير منفصل في محل رفع مبتدأ وجملة (يَطْمَعُونَ) خبر والجملة الاسمية في محل نصب حال بعد واو الحال.","surah_id":7,"source_id":7},{"ayah_number":47,"text":"(وَإِذا) إذا ظرف يتضمن معنى الشرط (صُرِفَتْ أَبْصارُهُمْ) فعل ماض مبني للمجهول ونائب فاعله والتاء للتأنيث.\n(تِلْقاءَ) ظرف مكان متعلق بصرفت (أَصْحابِ) مضاف إليه، (النَّارِ) مضاف إليه.\nوالجملة في محل جر بالإضافة بعد إذا الشرطية.\n(رَبَّنا) منادى مضاف منصوب بالفتحة ونا ضمير متصل في محل جر بالإضافة.\n(لا تَجْعَلْنا) مضارع للدعاء مجزوم، ونا ضمير متصل في محل نصب مفعول به ولا ناهية جازمة.\n(مَعَ الْقَوْمِ) متعلقان بتجعلنا (الظَّالِمِينَ) صفة مجرورة بالياء لأنها جمع مذكر سالم، والجملة مفعول به.","surah_id":7,"source_id":7},{"ayah_number":48,"text":"(وَنادى أَصْحابُ) فعل ماض وفاعل.\n(الْأَعْرافِ) مضاف إليه (رِجالًا) مفعول به والجملة مستأنفة (يَعْرِفُونَهُمْ) فعل مضارع وفاعله ومفعوله والميم لجمع الذكور والجملة في محل نصب صفة.\n(بِسِيماهُمْ) متعلقان بالفعل قبلهما.\n(قالُوا) الجملة تفسيرية (ما أَغْنى عَنْكُمْ جَمْعُكُمْ) فعل ماض تعلق به الجار والمجرور بعده وجمعكم فاعله، وما نافية لا عمل لها، والجملة مقول القول.\n(وَما كُنْتُمْ تَسْتَكْبِرُونَ) فعل ماض ناقص، والتاء اسمها، وما مصدرية والمصدر المؤول منها ومن الفعل بعدها معطوف على جمعكم ما أغنى عنكم جمعكم ولا استكباركم. وجملة تستكبرون في محل رفع خبر كنتم.","surah_id":7,"source_id":7},{"ayah_number":49,"text":"(أَهؤُلاءِ) اسم إشارة مبني على الكسرة في محل رفع مبتدأ، والها للتنبيه والهمزة للاستفهام.\n(الَّذِينَ) اسم موصول مبني على الفتح في محل رفع خبر، (أَقْسَمْتُمْ) فعل ماض وفاعله والجملة صلة الموصول.\n(لا يَنالُهُمُ اللَّهُ بِرَحْمَةٍ) فعل مضارع تعلق به الجار والمجرور والهاء مفعوله ولفظ الجلالة فاعله والجملة لا محل لها جواب القسم ولا نافية لا عمل لها.\n(ادْخُلُوا) فعل أمر مبني على حذف النون، والواو فاعله و(الْجَنَّةَ) مفعوله والجملة مقول القول لفعل محذوف يقول اللّه لهم ادخلوا الجنة...\n(لا خَوْفٌ) لا نافية ومبتدأ مرفوع.\n(عَلَيْكُمْ) متعلقان بمحذوف خبره والجملة في محل نصب حال.\n(وَلا أَنْتُمْ) أنتم ضمير منفصل في محل مبتدأ ولا نافية وجملة (تَحْزَنُونَ) خبره والجملة الاسمية ولا أنتم... معطوفة...","surah_id":7,"source_id":7},{"ayah_number":50,"text":"(وَنادى أَصْحابُ النَّارِ أَصْحابَ الْجَنَّةِ) فعل ماض وأصحاب الأولى فاعله وأصحاب الثانية مفعوله والنار مضاف إليه، والجنة مضاف إليه، والجملة مستأنفة.\n(أَنْ) مخففة من أن أو تفسيرية.\n(أَفِيضُوا) فعل أمر تعلق به الجار والمجرور علينا (مِنَ الْماءِ) متعلقان بأفيضوا.\n(أَوْ) عاطفة (مِمَّا) مؤلفة من من وما الموصولية والجملة الفعلية (رَزَقَكُمُ ُ اللَّهُ) صلة الموصول لا محل لها، وجملة (قالُوا) مستأنفة لا محل لها.\n(إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها والجملة مقول القول وجملة (حَرَّمَهُما) في محل رفع خبر.\n(عَلَى الْكافِرِينَ) متعلقان بالفعل قبلهما.","surah_id":7,"source_id":7},{"ayah_number":51,"text":"(الَّذِينَ) اسم موصول في محل جر صفة للكافرين.\n(اتَّخَذُوا دِينَهُمْ لَهْواً) فعل ماض وفاعله ومفعولاه.\n(وَلَعِباً) عطف والجملة صلة الموصول لا محل لها (وَغَرَّتْهُمُ) فعل ماض مبني على الفتح، والتاء للتأنيث والهاء مفعوله والميم لجمع الذكور.\n(الْحَياةُ) فاعل و(الدُّنْيا) صفة مرفوعة والجملة معطوفة.\n(فَالْيَوْمَ) ظرف زمان متعلق بالفعل (نَنْساهُمْ) والفاء استئنافية والجملة مستأنفة لا محل لها.\n(كَما) الكاف حرف جر وما مصدرية، وهي مؤولة مع الفعل بعدها بمصدر في محل جر بالكاف، والجار والمجرور متعلقان بمحذوف صفة لمصدر محذوف ننساهم نسيانا كائنا كنسيان لقاء يومهم هذا.\n(نَسُوا) ماض وفاعله (لِقاءَ) مفعول به (يَوْمِهِمْ) مضاف إليه والهاء في محل جر بالإضافة.\n(هذا) اسم اشارة في محل جر بدل أو صفة.\n(وَما كانُوا) فعل ماض ناقص والواو اسمها وما مصدرية والمصدر المؤول معطوف على المصدر السابق وكونهم يجحدون (بِآياتِنا) متعلقان بالفعل بعدهما. وجملة (يَجْحَدُونَ) في محل نصب خبر.","surah_id":7,"source_id":7},{"ayah_number":52,"text":"(وَلَقَدْ) الواو استئنافية، اللام واقعة في جواب القسم المقدر، قد حرف تحقيق.\n(جِئْناهُمْ) فعل ماض ونا فاعله والهاء مفعوله.\n(بِكِتابٍ) متعلقان بالفعل قبلهما (فَصَّلْناهُ) فعل ماض وفاعله ومفعوله والجملة في محل جر صفة لكتاب وجملة (جِئْناهُمْ) لا محل لها جواب القسم (عَلى عِلْمٍ) متعلقان بمحذوف حال من مفعول فصلناه أي فصلناه مشتملا على علم.\n(هُدىً) مفعول لأجله أو حال.\n(وَرَحْمَةً) عطف.\n(لِقَوْمٍ) متعلقان بالمصدر هدى أو برحمة. وجملة (يُؤْمِنُونَ) في محل جر صفة لقوم.","surah_id":7,"source_id":7},{"ayah_number":53,"text":"(هَلْ) حرف استفهام.\n(يَنْظُرُونَ) فعل مضارع والواو فاعله (إِلَّا) أداة حصر (تَأْوِيلَهُ) مفعوله.\n(إِلَّا) أداة حصر.\n(يَوْمَ) ظرف زمان متعلق بالفعل يقول (يَأْتِي تَأْوِيلُهُ) فعل مضارع وفاعله والجملة في محل جر بالإضافة (يَقُولُ الَّذِينَ) فعل مضارع واسم الموصول فاعله (نَسُوهُ) فعل ماض مبني على الضم والواو فاعله والهاء مفعوله.\n(مِنْ) حرف جر (قَبْلُ) ظرف زمان مبني على الضم لقطعه عن الإضافة في محل جر، والجار والمجرور متعلقان بالفعل نسوه.\n(قَدْ جاءَتْ رُسُلُ) فعل ماض وفاعله والتاء للتأنيث. قد حرف تحقيق (رَبِّنا) مضاف إليه، ونا ضمير متصل في محل جر بالإضافة.\n(بِالْحَقِّ) متعلقان بالفعل جاءت.\n(فَهَلْ) هل حرف استفهام والفاء للاستئناف (لَنا) متعلقان بمحذوف خبر مقدم.\n(مِنْ) حرف جر زائد.\n(مِنْ شُفَعاءَ) اسم مجرور لفظا مرفوع محلا مبتدأ، مجرور بالفتحة ممنوع من الصرف، اسم مؤنث منته بألف ممدودة، والجملة مستأنفة لا محل لها.\n(فَيَشْفَعُوا) فعل مضارع منصوب بأن المضمرة بعد فاء السببية، وعلامة نصبه حذف النون لأنه من الأفعال الخمسة، والواو فاعل والمصدر المؤول من أن والفعل معطوف على شفعاء هل لنا شفعاء فشفاعة منهم.\n(لَنا) متعلقان بالفعل (أَوْ) حرف عطف.\n(نُرَدُّ) فعل مضارع مبني للمجهول ونائب الفاعل تقديره نحن، والجملة معطوفة على ما قبلها والتقدير فهل من شفعاء أو هل نرد؟.\n(فَنَعْمَلَ) مضارع منصوب بأن المضمرة بعد فاء السببية، والمصدر المؤول معطوف على ما قبله.\n(غَيْرَ) مفعول به (الَّذِي) اسم موصول في محل جر بالإضافة.\n(كُنَّا) كان ونا اسمها وجملة (نَعْمَلُ) خبرها وجملة كنا صلة الموصول.\n(قَدْ) حرف تحقيق.\n(خَسِرُوا) فعل ماض وفاعل (أَنْفُسَهُمْ) مفعول به والجملة مستأنفة.\n(وَضَلَّ عَنْهُمْ) فعل ماض تعلق به الجار والمجرور واسم الموصول (ما) فاعله وجملة (كانُوا) صلة الموصول وجملة (يَفْتَرُونَ) في محل نصب خبر.","surah_id":7,"source_id":7},{"ayah_number":54,"text":"(إِنَّ رَبَّكُمُ اللَّهُ) إن واسمها ولفظ الجلالة خبرها.\n(الَّذِي) اسم موصول في محل رفع صفة.\n(خَلَقَ السَّماواتِ) فعل ماض ومفعوله (وَالْأَرْضَ) عطف (فِي سِتَّةِ) متعلقان بالفعل خلق (أَيَّامٍ) مضاف إليه.\n(ثُمَّ) عاطفة وجملة (اسْتَوى عَلَى الْعَرْشِ) معطوفة، (يُغْشِي) فعل مضارع.\n(اللَّيْلَ) مفعول به أول (النَّهارَ) مفعول به ثان والجملة في محل نصب حال وكذلك جملة (يَطْلُبُهُ حَثِيثاً) حال.\n(وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ) عطفت على السموات والأرض...\n(مُسَخَّراتٍ) حال منصوبة بالكسرة لأنها جمع مؤنث سالم.\n(بِأَمْرِهِ) متعلقان بمسخرات (أَلا) أداة استفتاح.\n(لَهُ) متعلقان بمحذوف خبر مقدم.\n(الْخَلْقُ) مبتدأ (وَالْأَمْرُ) عطف (تَبارَكَ اللَّهُ) فعل ماض جامد ولفظ الجلالة فاعله.\n(رَبُّ) صفة أو بدل (الْعالَمِينَ) مضاف إليه مجرور بالياء، والجملتان مستأنفتان.","surah_id":7,"source_id":7},{"ayah_number":55,"text":"(ادْعُوا) فعل أمر مبني على حذف النون، والواو فاعله.\n(رَبَّكُمْ) مفعوله (تَضَرُّعاً) حال منصوبة.\n(وَخُفْيَةً) اسم معطوف.\n(إِنَّهُ) إن واسمها وجملة (لا يُحِبُّ الْمُعْتَدِينَ) خبرها. والجملة الاسمية (إِنَّهُ لا يُحِبُّ) مستأنفة وكذلك الجملة الفعلية (ادْعُوا رَبَّكُمْ).","surah_id":7,"source_id":7},{"ayah_number":56,"text":"(وَلا تُفْسِدُوا) فعل مضارع مجزوم بحذف النون لسبقه بلا الناهية الجازمة والواو فاعله والجملة معطوفة.\n(فِي الْأَرْضِ) متعلقان بالفعل قبلهما وكذلك الظرف (بَعْدَ) متعلق بالفعل.\n(إِصْلاحِها) مضاف إليه.\n(وَادْعُوهُ) فعل أمر مبني على حذف النون وفاعله ومفعوله والجملة معطوفة (خَوْفاً وَطَمَعاً) حالان، (إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ) إن واسمها وخبرها ولفظ الجلالة مضاف إليه، (مِنَ الْمُحْسِنِينَ) متعلقان بقريب. وجملة (إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ) تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":57,"text":"(وَهُوَ) ضمير رفع منفصل مبني على الفتح في محل رفع مبتدأ، واسم الموصول (الَّذِي) بعده خبره والجملة معطوفة.\n(يُرْسِلُ الرِّياحَ) فعل مضارع ومفعوله وفاعله هو (بُشْراً) حال والجملة صلة الموصول لا محل لها.\n(بَيْنَ) ظرف مكان متعلق بيرسل.\n(يَدَيْ) مضاف إليه مجرور بالياء لأنه مثنى وحذفت النون للإضافة. و(رَحْمَتِهِ) مضاف إليه.\n(حَتَّى) حرف ابتداء.\n(إِذا) ظرفية شرطية.\n(أَقَلَّتْ سَحاباً) فعل ماض ومفعوله والتاء تاء التأنيث الساكنة و(ثِقالًا) صفة والجملة في محل جر بالإضافة (سُقْناهُ) فعل ماض وفاعله ومفعوله والجملة لا محل لها جواب شرط غير جازم.\n(لِبَلَدٍ) متعلقان بسقناه (مَيِّتٍ) صفة.\n(فَأَنْزَلْنا بِهِ الْماءَ) فعل ماض تعلق به الجار والمجرور ونا فاعله والماء مفعوله والجملة معطوفة.\n(فَأَخْرَجْنا بِهِ) ماض وفاعله وبه متعلقان بالفعل.\n(مِنْ كُلِّ) متعلقان بمفعول به محذوف أخرجنا أنواعا من كل (الثَّمَراتِ) (كَذلِكَ) جار ومجرور متعلقان بمحذوف صفة لمفعول مطلق محذوف (نُخْرِجُ الْمَوْتى) إخراجا مثل إخراج الثمر من الشجر الميت...\n(لَعَلَّكُمْ تَذَكَّرُونَ) لعل والكاف اسمها وجملة تذكرون خبرها وجملة لعلكم تذكرون تعليلية.","surah_id":7,"source_id":7},{"ayah_number":58,"text":"(وَالْبَلَدُ) مبتدأ.\n(الطَّيِّبُ) صفة.\n(يَخْرُجُ نَباتُهُ) فعل مضارع وفاعل والجملة في محل رفع خبر المبتدأ.\n(بِإِذْنِ) متعلقان بمحذوف صفة لمفعول به محذوف يخرج طيبا بإذن اللّه.\n(رَبِّهِ) مضاف إليه. والجملة الاسمية والبلد... مستأنفة.\n(وَالَّذِي) اسم موصول مبتدأ وجملة (لا يَخْرُجُ إِلَّا نَكِداً) خبره وجملة (خَبُثَ) صلة الموصول لا محل لها.\n(إِلَّا) أداة حصر (نَكِداً) حال.\n(كَذلِكَ نُصَرِّفُ الْآياتِ) تقدم إعرابها وجملة (يَشْكُرُونَ) في محل جر صفة لقوم. والجار والمجرور لقوم متعلقان بنصرّف","surah_id":7,"source_id":7},{"ayah_number":59,"text":"(لَقَدْ) اللام واقعة في جواب القسم المحذوف، قد حرف تحقيق (أَرْسَلْنا نُوحاً) فعل ماض تعلق به الجار والمجرور (إِلى قَوْمِهِ) ونا فاعله ونوحا مفعوله والجملة مستأنفة.\n(فَقالَ) الجملة معطوفة (يا قَوْمِ) منادى مضاف منصوب بالفتحة المقدرة على ما قبل ياء المتكلم المحذوفة للتخفيف، والياء ضمير متصل في محل جر بالإضافة.\n(اعْبُدُوا اللَّهَ) فعل أمر مبني على حذف النون والواو فاعله ولفظ الجلالة مفعوله والجملة مقول القول.\n(ما) نافية لا عمل لها.\n(لَكُمْ) متعلقان بمحذوف خبر مقدم.\n(مِنْ) حرف جر زائد.\n(إِلهٍ) اسم مجرور لفظا مرفوع محلا مبتدأ (غَيْرُهُ) صفة إله على المحل مرفوعة بالضمة، والجملة تعليلية لا محل لها من الإعراب.\n(إِنِّي) إن والياء اسمها.\n(أَخافُ عَلَيْكُمْ عَذابَ) فعل مضارع تعلق به الجار والمجرور وعذاب مفعوله.\n(يَوْمٍ) مضاف إليه.\n(عَظِيمٍ) صفة. والجملة في محل رفع خبر إن.","surah_id":7,"source_id":7},{"ayah_number":60,"text":"(قالَ الْمَلَأُ) فعل ماض وفاعل.\n(مِنْ قَوْمِهِ) متعلقان بمحذوف حال من الملأ والجملة مستأنفة.\n(إِنَّا) إن ونا اسمها.\n(لَنَراكَ) اللام المزحلقة ونراك فعل مضارع مرفوع بالضمة المقدرة على الألف فاعله مستتر والكاف مفعوله، (فِي ضَلالٍ) متعلقان بالفعل قبلهما.\n(مُبِينٍ) صفة والجملة خبر إنا وجملة إنا.. مقول القول.","surah_id":7,"source_id":7},{"ayah_number":61,"text":"(قالَ يا قَوْمِ) سبق اعرابها (لَيْسَ) فعل ماض ناقص، و(بِي) متعلقان بمحذوف خبرها و(ضَلالَةٌ) اسمها والجملة مفعول به.\n(وَلكِنِّي) حرف مشبه بالفعل والياء اسمها و(رَسُولٌ) خبرها وقد تعلق به الجار والمجرور بعده (مِنْ رَبِّ).\n(الْعالَمِينَ) مضاف إليه مجرور بالياء لأنه ملحق بجمع المذكر السالم، والجملة الاسمية معطوفة، وجملة قال مستأنفة كالتي سبقتها.","surah_id":7,"source_id":7},{"ayah_number":62,"text":"(أُبَلِّغُكُمْ) فعل مضارع والكاف مفعوله الأول، والميم علامة جمع الذكور (رِسالاتِ) مفعول به ثان منصوب بالكسرة نيابة عن الفتحة لأنه جمع مؤنث سالم.\n(رَبِّي) مضاف إليه مجرور بالكسرة المقدرة على ما قبل ياء المتكلم، والياء في محل جر بالإضافة، والجملة في محل جر صفة لرسول.\n(وَأَنْصَحُ لَكُمْ) الجملة الفعلية معطوفة وكذلك جملة (وَأَعْلَمُ مِنَ اللَّهِ)...\n(ما) اسم موصول مبني على السكون في محل نصب مفعول به وجملة (لا تَعْلَمُونَ) صلته.","surah_id":7,"source_id":7},{"ayah_number":63,"text":"(أَوَعَجِبْتُمْ) فعل ماض مبني على السكون، والتاء ضمير متصل في محل رفع فاعل، والميم علامة جمع الذكور، والواو عاطفة والهمزة للاستفهام، والجملة معطوفة على جملة مقدرة أكذبتم وعجبتم..\n(أَنْ) حرف مصدري ونصب.\n(جاءَكُمْ) فعل ماض والكاف مفعول به، والمصدر المؤول من أن والفعل في محل جر بحرف الجر أو عجبتم لمجيء رجل منكم؟ (ذِكْرٌ) فاعل جاءكم (مِنْ رَبِّكُمْ) متعلقان بالفعل جاءكم.\n(عَلى رَجُلٍ) متعلقان بمحذوف صفة لذكر (مِنْكُمْ) متعلقان بمحذوف صفة لرجل.\n(لِيُنْذِرَكُمْ) فعل مضارع منصوب بأن المضمرة بعد لام التعليل والكاف مفعوله، والمصدر المؤول من أن المضمرة والفعل في محل جر باللام، والجار والمجرور متعلقان بالفعل جاء (وَلِتَتَّقُوا) مضارع منصوب بأن المضمرة وعلامة نصبه حذف النون لأنه من الأفعال الخمسة، والواو فاعله، والمصدر المؤول معطوف على المصدر قبله للإنذار والتقوى.\n(وَلَعَلَّكُمْ) حرف مشبه بالفعل، والكاف اسمها، والميم لجمع الذكور (تُرْحَمُونَ) فعل مضارع مبني للمجهول، والواو نائب فاعله، والجملة في محل رفع خبر، وجملة لعلكم ترحمون تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":64,"text":"(فَكَذَّبُوهُ) فعل ماض مبني على الضم، والواو فاعله، والهاء مفعوله، والجملة مستأنفة بعد الفاء، (فَأَنْجَيْناهُ) فعل ماض مبني على السكون ونا فاعله والهاء مفعوله والجملة معطوفة.\n(وَالَّذِينَ) اسم موصول معطوف على ضمير النصب الهاء.\n(مَعَهُ) ظرف مكان متعلق بمحذوف صلة الموصول.\n(فِي الْفُلْكِ) متعلقان بالفعل أنجينا.\n(وَأَغْرَقْنَا الَّذِينَ) فعل ماض وفاعل ومفعول به والجملة معطوفة.\n(كَذَّبُوا بِآياتِنا) فعل ماض تعلق به الجار والمجرور، والواو فاعله والجملة صلة الموصول (إِنَّهُمْ) إن والهاء اسمها والميم لجمع الذكور.\n(كانُوا قَوْماً) كان واسمها وخبرها.\n(عَمِينَ) صفة مجرورة بالياء لأنها جمع مذكر سالم، والجملة في محل رفع خبر إن. والجملة الاسمية إنهم... تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":65,"text":"(وَإِلى عادٍ) متعلقان بفعل محذوف تقديره وأرسلنا والجملة المقدرة معطوفة (أَخاهُمْ) مفعول به منصوب بالألف لأنه من الأسماء الخمسة، والهاء في محل جر بالإضافة، (هُوداً) بدل منصوب.\n(قالَ يا قَوْمِ اعْبُدُوا اللَّهَ) تقدم إعرابها في الآية 59 جملة قال مستأنفة لا محل لها (أَفَلا) الهمزة للإ ستفهام. والفاء عاطفة، ولا نافية لا عمل لها وجملة (تَتَّقُونَ) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":66,"text":"(قالَ الْمَلَأُ) فعل ماض وفاعل (الَّذِينَ) اسم موصول في محل رفع صفة، والجملة مستأنفة لا محل لها وجملة (كَفَرُوا) صلة.\n(مِنْ قَوْمِهِ) متعلقان بمحذوف حال من الملأ (إِنَّا لَنَراكَ فِي سَفاهَةٍ) تقدم إعراب مثلها في الآية 60.\n(وَإِنَّا) إن واسمها.\n(لَنَظُنُّكَ مِنَ الْكاذِبِينَ) فعل مضارع تعلق به الجار والمجرور والكاف مفعوله.\nوالجملة في محل رفع خبر إن، واللام المزحلقة.","surah_id":7,"source_id":7},{"ayah_number":67,"text":"تقدم إعراب مشابه في الآية 61","surah_id":7,"source_id":7},{"ayah_number":68,"text":"ينظر في إعرابها الآية 62- (وَأَنَا) ضمير رفع منفصل في محل رفع مبتدأ.\n(لَكُمْ) متعلقان بالخبر (ناصِحٌ).\n(أَمِينٌ) صفة أو خبر ثان والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":69,"text":"(أَوَعَجِبْتُمْ) ينظر في إعرابها الآية 63.\n(وَاذْكُرُوا) فعل أمر مبني على حذف النون والواو فاعله.\n(إِذْ) بمعنى وقت مبني على السكون في محل نصب مفعول به. والجملة معطوفة بالواو على جملة مقدرة أي لا تعجبوا واذكروا...\n(جَعَلَكُمْ خُلَفاءَ) فعل ماض والكاف مفعوله الأول و(خُلَفاءَ) مفعوله الثاني (مِنْ بَعْدِ) متعلقان بمحذوف صفة لخلفاء.\n(قَوْمِ) مضاف إليه. و(نُوحٍ) مضاف إليه والجملة في محل جر بالإضافة. و(زادَكُمْ فِي الْخَلْقِ بَصْطَةً) فعل ماض تعلق به الجار والمجرور والكاف مفعوله الأول وبصطة مفعوله الثاني أو هي تمييز والجملة معطوفة.\n(فَاذْكُرُوا آلاءَ اللَّهِ) فعل ماض وفاعله ومفعوله واللّه لفظ الجلالة مضاف إليه، والفاء هي الفصيحة أي إذا عرفتم ذلك فاذكروا آلاء اللّه، والجملة لا محل لها جواب شرط مقدر. وجملة (تُفْلِحُونَ) خبر لعل، وجملة (لَعَلَّكُمْ تُفْلِحُونَ) تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":70,"text":"(قالُوا) فعل ماض والواو فاعله.\n(أَجِئْتَنا) فعل ماض مبني على السكون والتاء فاعله، ونا مفعوله، والهمزة للاستفهام والجملة مقول القول.\n(لِنَعْبُدَ) مضارع منصوب بأن المضمرة بعد لام التعليل والمصدر المؤول من أن والفعل في محل جر باللام، والجار والمجرور متعلقان بالفعل قبلهما.\n(اللَّهَ) لفظ الجلالة مفعول به.\n(وَحْدَهُ) حال منصوبة والهاء في محل جر بالإضافة.\n(وَنَذَرَ) عطف على نعبد.\n(ما) اسم موصول في محل نصب مفعول به.\n(كانَ) فعل ماض ناقص.\n(يَعْبُدُ آباؤُنا) فعل مضارع وفاعله وقد وقع التنازع بين كان التي تطلب اسما ويعبد الذي يطلب فاعلا. وجملة كان صلة الموصول لا محل لها وجملة (يَعْبُدُ آباؤُنا) في محل نصب خبر.\n(فَأْتِنا) فعل أمر مبني على حذف حرف العلة من آخره، لأنه معتل الآخر وفاعله أنت ونا مفعوله، والفاء هي الفصيحة إذا كان قولك صحيحا فآتنا بما تعدنا...\n(بِما) اسم موصول مبني على السكون في محل جر بالباء والجار والمجرور متعلقان بالفعل قبلهما.\n(تَعِدُنا) فعل مضارع ومفعوله والجملة صلة.\n(إِنْ) حرف شرط جازم (كُنْتَ) فعل ماض ناقص والتاء اسمه والفعل في محل جزم فعل الشرط.\n(مِنَ الصَّادِقِينَ) اسم مجرور وعلامة جره الياء لأنه جمع مذكر سالم، والجار والمجرور متعلقان بمحذوف خبر الفعل الناقص، وجملة كنت ابتدائية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":71,"text":"(قالَ قَدْ وَقَعَ) سبق اعراب مثلها (عَلَيْكُمْ) متعلقان بالفعل وقع.\n(مِنْ رَبِّكُمْ) متعلقان بمحذوف حال من رجس كان صفة له فلما تقدم عليه صار حالا.\n(رِجْسٌ) فاعل (وَغَضَبٌ) معطوف.\n(أَتُجادِلُونَنِي) فعل مضارع مرفوع بثبوت النون والواو فاعله والياء مفعوله، والنون الأولى للوقاية والهمزة للإستفهام.\n(فِي أَسْماءٍ) متعلقان بالفعل قبلهما والجملة مستأنفة لا محل لها وجملة قد وقع عليكم مقول القول...\n(سَمَّيْتُمُوها) فعل ماض مبني على السكون لاتصاله بتاء الفاعل المتحركة، والتاء في محل رفع فاعل والميم علامة جمع الذكور، وقد أشبعت ضمتها إلى الواو.\n(أَنْتُمْ) ضمير رفع منفصل في محل رفع توكيد لتاء الفاعل في سميتموها (وَآباؤُكُمْ) اسم معطوف.\n(ما نَزَّلَ اللَّهُ بِها) فعل ماض تعلق به الجار والمجرور ولفظ الجلالة فاعله (مِنْ سُلْطانٍ) مفعوله ومن حرف جر زائد والجملة في محل جر صفة لأسماء، وكذلك جملة سميتموها قبلها.\n(فَانْتَظِرُوا) الفاء هي الفصيحة، انتظروا فعل أمر مبني على حذف النون والواو فاعل والجملة لا محل لها جواب شرط غير جازم مقدر إذا أشركتم فانتظروا.\n(إِنِّي) إن واسمها.\n(مَعَكُمْ) ظرف مكان متعلق بالمنتظرين بعده والكاف في محل جر بالإضافة.\n(مِنَ الْمُنْتَظِرِينَ) اسم مجرور وعلامة جره الياء لأنه جمع مذكر سالم، والجار والمجرور متعلقان بمحذوف خبر إني، والجملة تعليلية لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":72,"text":"(فَأَنْجَيْناهُ) فعل ماض مبني على السكون، ونا فاعله والهاء مفعوله والجملة مستأنفة بعد الفاء، (وَالَّذِينَ) اسم موصول معطوف على الضمير المنصوب.\n(مَعَهُ) ظرف مكان متعلق بمحذوف صلة الموصول والتقدير والذين آمنوا معه. والهاء في محل جر بالإضافة.\n(بِرَحْمَةٍ) متعلقان بالفعل أنجينا.\n(مِنَّا) متعلقان بمحذوف صفة لرحمة.\n(وَقَطَعْنا) فعل ماض وفاعله (دابِرَ) مفعوله والجملة معطوفة، (الَّذِينَ) اسم موصول في محل جر بالإضافة.\n(كَذَّبُوا) فعل ماض تعلق به الجار والمجرور بعده (بِآياتِنا) والواو فاعله، والجملة صلة الموصول...\n(وَما كانُوا مُؤْمِنِينَ) كان واسمها وخبرها وما نافية والجملة مستأنفة لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":73,"text":"(وَإِلى ثَمُودَ أَخاهُمْ صالِحاً) هذا كقوله تعالى في الآية 64 (وَإِلى عادٍ أَخاهُمْ هُوداً) الذي تقدم في السورة.\n(قَدْ جاءَتْكُمْ) فعل ماض والتاء للتأنيث والكاف مفعول به والميم للجمع (بَيِّنَةٌ) فاعل مرفوع.\n(مِنْ رَبِّكُمْ) متعلقان بمحذوف صفة بينة.\n(هذِهِ) اسم إشارة مبني على الكسرة في محل رفع مبتدأ.\n(ناقَةُ) خبر (اللَّهَ) لفظ الجلالة مضاف إليه مجرور.\n(لَكُمْ) متعلقان بمحذوف حال لآية لأنه تقدم عليه.\n(آيَةً) حال من ناقة منصوبة. والجملة الاسمية (هذِهِ ناقَةُ اللَّهِ) استئنافية أو مفسرة ل بينة قبلها.\n(فَذَرُوها) الفاء هي الفصيحة، ذروها فعل أمر مبني على حذف النون والواو فاعله والهاء مفعوله، والجملة لا محل لها جواب شرط غير جازم مقدر إذا ثبت ذلك فذروها (تَأْكُلْ) فعل مضارع مجزوم لأنه جواب الأمر، تعلق به الجار والمجرور وفاعله مستتر (فِي أَرْضِ)، (اللَّهَ) لفظ الجلالة مضاف إليه والجملة لا محل لها جواب شرط لم يقترن بالفاء أو إذ الفجائية.\n(وَلا تَمَسُّوها) مضارع مجزوم بحذف النون لسبقه بلا الناهية الجازمة، والواو فاعله والهاء مفعوله (بِسُوءٍ) متعلقان بالفعل قبلهما، والجملة معطوفة.\n(فَيَأْخُذَكُمْ) فعل مضارع منصوب بأن المضمرة بعد فاء السببية، والكاف مفعوله. والمصدر المؤول من أن والفعل معطوف على مصدر مقدر قبله (عَذابٌ) فاعل (أَلِيمٌ) صفة.","surah_id":7,"source_id":7},{"ayah_number":74,"text":"(وَاذْكُرُوا إِذْ جَعَلَكُمْ) تقدم إعرابها في الآية 69 (وَبَوَّأَكُمْ) فعل ماض تعلق به الجار والمجرور بعده (فِي الْأَرْضِ). والكاف مفعوله والفاعل ضمير مستتر والجملة معطوفة على جملة جعلكم، (تَتَّخِذُونَ) مضارع مرفوع بثبوت النون والواو فاعله.\n(مِنْ سُهُولِها) جار ومجرور متعلقان بمحذوف حال من قصورا، كان صفة فلما تقدم صار حالا (قُصُوراً) مفعول به، والجملة في محل نصب حال.\n(وَتَنْحِتُونَ) فعل مضارع وفاعله.\n(الْجِبالَ) مفعول به أول.\n(بُيُوتاً) مفعول به ثان. أو الجبال منصوب بنزع الخافض أي من الجبال... والجملة معطوفة.\n(فَاذْكُرُوا) فعل أمر مبني على حذف النون، والواو فاعله والفاء هي الفصيحة.\n(آلاءَ) مفعوله.\n(اللَّهِ) لفظ الجلالة مضاف إليه والجملة لا محل لها جواب شرط غير جازم إذا كان ذلك حقا...\n(وَلا تَعْثَوْا) مضارع مجزوم بلا الناهية وعلامة جزمه حذف النون، والواو فاعل.\n(فِي الْأَرْضِ) متعلقان بمحذوف حال من مفسدين بعدهما.\n(مُفْسِدِينَ) حال منصوبة بالياء لأنه جمع مذكر سالم، والجملة معطوفة على ما قبلها.","surah_id":7,"source_id":7},{"ayah_number":75,"text":"(قالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا) ينظر في إعرابها الآية 66.\n(لِلَّذِينَ) اللام حرف جر، الذين اسم موصول مبني على السكون في محل جر باللام، والجار والمجرور متعلقان بالفعل قال.\n(اسْتُضْعِفُوا) فعل ماض مبني للمجهول مبني على الضم، والواو نائب فاعل. والجملة صلة الموصول لا محل لها.\n(لِمَنْ) اللام حرف جر، من اسم موصول مبني على السكون في محل جر باللام، والجار والمجرور بدل من للذين قبلهما.\n(آمَنَ) فعل ماض وفاعله ضمير مستتر تقديره هو يعود إلى من.\n(مِنْهُمْ) متعلقان بالفعل آمن والجملة صلة الموصول.\n(أَتَعْلَمُونَ) فعل مضارع والواو فاعله، والهمزة للاستفهام والجملة مقول القول.\n(أَنَّ صالِحاً مُرْسَلٌ) أن واسمها وخبرها، وهما في تأويل مصدر مسد مفعولي علم.\n(مِنْ رَبِّهِ) متعلقان باسم المفعول مرسل.\n(قالُوا) جملة مستأنفة.\n(إِنَّا) إن واسمها.\n(بِما) متعلقان بالفعل.\n(أُرْسِلَ) فعل ماض مبني للمجهول، ونائب فاعله ضمير مستتر تقديره هو.\n(بِهِ) متعلقان بأرسل والجملة صلة الموصول. والجملة الاسمية إنا... مؤمنون مفعول به بعد القول.\n(بِهِ) متعلقان بالخبر (مُؤْمِنُونَ) خبر.","surah_id":7,"source_id":7},{"ayah_number":76,"text":"(قالَ الَّذِينَ) فعل ماض واسم الموصول بعده فاعله والجملة مستأنفة لا محل لها وجملة (اسْتَكْبَرُوا) صلة الموصول لا محل لها.\n(إِنَّا) إن ونا المدغمة اسمها (بِالَّذِي) متعلقان بالخبر (آمَنْتُمْ) فعل ماض، والتاء ضمير متصل في محل رفع فاعل. والميم لجمع الذكور، والجملة صلة الموصول لا محل لها.\n(بِهِ) متعلقان بالفعل (كافِرُونَ) خبر والجملة الاسمية إنا بالذي آمنتم به كافرون مفعول به بعد القول.","surah_id":7,"source_id":7},{"ayah_number":77,"text":"(فَعَقَرُوا النَّاقَةَ) فعل ماض وفاعله ومفعوله، والجملة مستأنفة.\n(وَعَتَوْا) فعل ماض مبني على الضم المقدر على الألف المحذوفة، والواو فاعل.\n(عَنْ أَمْرِ) متعلقان بالفعل قبلهما.\n(رَبِّهِمْ) مضاف إليه والجملة معطوفة.\n(يا صالِحُ) يا أداة نداء، صالح منادى مفرد علم مبني على الضم في محل نصب (ائْتِنا بِما تَعِدُنا) تقدم إعرابها في الآية 70","surah_id":7,"source_id":7},{"ayah_number":78,"text":"(فَأَخَذَتْهُمُ) فعل ماض مبني على الفتح، والتاء للتأنيث، والهاء مفعول به والميم لجمع الذكور.\n(الرَّجْفَةُ) فاعل والجملة معطوفة.\n(فَأَصْبَحُوا) فعل ماض ناقص، والواو اسمها.\n(فِي دارِهِمْ) متعلقان بالخبر (جاثِمِينَ) المنصوب بالياء لأنه جمع مذكر سالم، والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":79,"text":"(فَتَوَلَّى) فعل ماض مبني على الفتحة المقدرة على الألف، تعلق به الجار والمجرور بعده، والجملة معطوفة.\n(يا قَوْمِ) منادى منصوب بالفتحة المقدرة على ما قبل ياء المتكلم المحذوفة تخفيفا.\n(لَقَدْ) اللام واقعة في جواب القسم المقدر واللّه لقد أبلغتكم، قد حرف تحقيق.\n(أَبْلَغْتُكُمْ) فعل ماض مبني على السكون، والتاء فاعله والكاف مفعوله الأول و(رِسالَةَ) مفعوله الثاني.\n(رَبِّي) مضاف إليه مجرور بالكسرة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة، والجملة لا محل لها لأنها جواب القسم المقدر. وجملة يا قوم لقد أبلغتكم... مقول القول. وجملة (نَصَحْتُ) لكم معطوفة.\n(وَلكِنْ) حرف استدراك.\n(لا تُحِبُّونَ) مضارع مرفوع بثبوت النون والواو فاعله، ولا نافية لا عمل لها.\n(النَّاصِحِينَ) مفعول به منصوب بالياء، والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":80,"text":"(وَلُوطاً) مفعول به لفعل محذوف تقديره اذكر.\n(إِذْ) ظرف لما مضى من الزمان مبني على السكون في محل نصب.\n(قالَ) فعل ماض تعلق به الجار والمجرور بعده (لِقَوْمِهِ) والجملة في محل جر بالإضافة، وجملة اذكر لوطا معطوفة.\n(أَتَأْتُونَ) فعل مضارع مرفوع بثبوت النون، والواو فاعل والهمزة للاستفهام.\n(الْفاحِشَةَ) مفعول به والجملة مقول القول.\n(ما سَبَقَكُمْ) فعل ماض والكاف مفعوله والميم علامة جمع الذكور، ما نافية لا عمل لها.\n(بِها) متعلقان بالفعل قبلهما.\n(مِنْ أَحَدٍ) من حرف جر زائد، أحد اسم مجرور لفظا مرفوع محلا فاعل.\n(مِنَ الْعالَمِينَ) جار ومجرور متعلقان بمحذوف صفة أحد. والجملة الفعلية في محل نصب حال من الفاحشة.","surah_id":7,"source_id":7},{"ayah_number":81,"text":"(إِنَّكُمْ) إن والكاف اسمها والميم للجمع.\n(لَتَأْتُونَ) مضارع مرفوع بثبوت النون والواو فاعله، واللام هي المزحلقة.\n(الرِّجالَ) مفعول به والجملة في محل رفع خبر إن.\n(شَهْوَةً) مفعول لأجله منصوب أو حال (مِنْ دُونِ) متعلقان بمحذوف حال من الرجال.\n(النِّساءِ) مضاف إليه.\n(بَلْ) حرف إضراب.\n(أَنْتُمْ) ضمير رفع منفصل في محل رفع مبتدأ.\n(قَوْمٌ) خبر، (مُسْرِفُونَ) صفة مرفوعة بالواو، والنون عوضا عن التنوين في الاسم المفرد. والجملة الاسمية مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":82,"text":"(وَما) الواو استئنافية ما نافية.\n(كانَ) فعل ماض ناقص.\n(جَوابَ) خبرها مقدم.\n(قَوْمِهِ) مضاف إليه، والهاء في محل جر بالإضافة.\n(إِلَّا) أداة حصر.\n(أَنْ) حرف مصدري ونصب.\n(قالُوا) فعل ماض، والواو فاعله وهو في محل نصب بأن، والمصدر المؤول من أن والفعل بعدها في محل رفع اسم كان.\n(أَخْرِجُوهُمْ) فعل أمر مبني على حذف النون، والواو فاعله والهاء مفعوله والميم علامة جمع الذكور.\n(مِنْ قَرْيَتِكُمْ) متعلقان بالفعل قبلهما، والجملة مفعول به.\n(إِنَّهُمْ) إن والهاء اسمها.\n(أُناسٌ) خبرها.\nوالجملة تعليلية لا محل لها (يَتَطَهَّرُونَ) فعل مضارع وفاعله والجملة في محل رفع خبر إن.","surah_id":7,"source_id":7},{"ayah_number":83,"text":"(فَأَنْجَيْناهُ) فعل ماض مبني على السكون، وفاعله ومفعوله، والجملة مستأنفة.\n(وَأَهْلَهُ) اسم معطوف على ضمير النصب، والهاء في محل جر بالإضافة.\n(إِلَّا) أداة استثناء.\n(امْرَأَتَهُ) مستثنى منصوب والهاء في محل جر بالإضافة.\n(كانَتْ) فعل ماض ناقص، واسمها ضمير مستتر تقديره هي.\n(مِنَ الْغابِرِينَ) متعلقان بمحذوف خبر. والجملة في محل نصب حال من امرأته.","surah_id":7,"source_id":7},{"ayah_number":84,"text":"(وَأَمْطَرْنا عَلَيْهِمْ) فعل ماض تعلق به الجار والمجرور (عَلَيْهِمْ)، ونا فاعله، و(مَطَراً) مفعوله، والجملة لا محل لها جواب شرط غير جازم إذا كان ذلك حاصلا (فَانْظُرْ)...\n(كَيْفَ) اسم استفهام في محل نصب خبر مقدم.\n(كانَ عاقِبَةُ) كان واسمها.\n(الْمُجْرِمِينَ) مضاف إليه مجرور بالياء لأنه جمع مذكر سالم، والجملة في محل نصب مفعول به للفعل انظر...","surah_id":7,"source_id":7},{"ayah_number":85,"text":"(وَإِلى مَدْيَنَ) مدين اسم مجرور بالفتحة نيابة عن الكسرة، اسم علم أعجمي، والجار والمجرور متعلقان بالفعل المحذوف أرسلنا.\n(أَخاهُمْ) مفعول به منصوب بالألف لأنه من الأسماء الخمسة. والهاء ضمير متصل في محل جر بالإضافة والميم علامة جمع الذكور.\n(شُعَيْباً) بدل منصوب، والجملة معطوفة.\n(قالَ يا قَوْمِ اعْبُدُوا اللَّهَ) تقدم نظيرها في الآية 59 (قَدْ جاءَتْكُمْ بَيِّنَةٌ) فعل ماض ومفعوله وفاعله.\n(مِنْ رَبِّكُمْ) متعلقان بمحذوف صفة من بينة.\n(فَأَوْفُوا الْكَيْلَ) فعل أمر وفاعله ومفعوله والفاء هي الفصيحة، والجملة لا محل لها جواب شرط غير جازم.\n(وَلا تَبْخَسُوا) مضارع مجزوم بلا والواو فاعل و(النَّاسَ) مفعول به أول (أَشْياءَهُمْ) مفعول به ثان والجملة معطوفة.\n(وَلا تُفْسِدُوا فِي الْأَرْضِ) لا ناهية وفعل مضارع مجزوم (بَعْدَ) ظرف زمان متعلق بتفسدوا.\n(إِصْلاحِها) مضاف إليه (ذلِكُمْ) اسم إشارة مبني على السكون في محل رفع مبتدأ، واللام للبعد والكاف للخطاب.\n(خَيْرٌ) خبر و(لَكُمْ) متعلقان بخير، والجملة الاسمية استئنافية لا محل لها.\n(إِنْ) حرف شرط جازم، (كُنْتُمْ) فعل ماض ناقص والتاء اسمها.\n(مُؤْمِنِينَ) خبرها منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم.\nوالجملة استئنافية. وجواب الشرط محذوف دل عليه ما قبله.","surah_id":7,"source_id":7},{"ayah_number":86,"text":"(وَلا تَقْعُدُوا) لا ناهية وفعل مضارع مجزوم تعلق به الجار والمجرور بعده (بِكُلِّ).\n(صِراطٍ) مضاف.\n(تُوعِدُونَ) فعل مضارع وفاعله والجملة في محل نصب حال وجملة (وَتَصُدُّونَ) معطوفة عليها.\n(عَنْ سَبِيلِ) متعلقان بالفعل (اللَّهِ) لفظ الجلالة مضاف إليه (مَنْ) اسم موصول مبني على السكون في محل نصب مفعول به والجملة الفعلية (آمَنَ بِهِ) صلة الموصول لا محل لها (وَتَبْغُونَها) فعل مضارع وفاعله نصب مفعول به والجملة الفعلية (آمَنَ بِهِ) صلة الموصول لا محل لها (وَتَبْغُونَها) فعل مضارع وفاعله ومفعوله، (عِوَجاً) حال والجملة معطوفة فهي في محل نصب حال كذلك.\n(وَاذْكُرُوا) فعل أمر مبني على حذف النون والواو فاعله والجملة معطوفة على جملة لا تقعدوا.\n(إِذْ) ظرف لما مضى من الزمان مبني على السكون في محل نصب.\n(كُنْتُمْ قَلِيلًا)، كان واسمها وخبرها والجملة في محل جر بالإضافة.\n(فَكَثَّرَكُمْ) فعل ماض والكاف مفعول به والجملة معطوفة (وَانْظُرُوا كَيْفَ كانَ عاقِبَةُ الْمُفْسِدِينَ) تقدم إعرابها في الآية 84.","surah_id":7,"source_id":7},{"ayah_number":87,"text":"(وَإِنْ) الواو استئنافية، إن حرف شرط جازم يجزم فعلين مضارعين.\n(كانَ) فعل ماض ناقص، مبني على الفتحة الظاهرة وهو في محل جزم فعل الشرط.\n(طائِفَةٌ) اسمها.\n(مِنْكُمْ) متعلقان بمحذوف صفة طائفة، (آمَنُوا) فعل ماض تعلق به الجار والمجرور (بِالَّذِي)، والجملة في محل نصب خبر كان.\n(أُرْسِلْتُ) فعل ماض مبني للمجهول، مبني على السكون، والتاء ضمير متصل في محل رفع نائب فاعل، والجملة صلة الموصول، (بِهِ) متعلقان بأرسلت.\n(وَطائِفَةٌ) اسم معطوف على طائفة الأولى.\n(لَمْ يُؤْمِنُوا) مضارع مجزوم وعلامة جزمه حذف النون والواو فاعل والجملة في محل رفع صفة طائفة.\n(فَاصْبِرُوا) فعل أمر مبني على حذف النون، والواو فاعل، والفاء رابطة لجواب الشرط، والجملة في محل جزم جواب الشرط.\n(حَتَّى) حرف غاية وجر.\n(يَحْكُمَ) مضارع منصوب بأن مضمرة بعد حتى، والمصدر المؤول من أن والفعل في محل جر بحتى والجار والمجرور متعلقان بالفعل اصبروا.\n(اللَّهُ) لفظ الجلالة فاعل.\n(بَيْنَنا) ظرف متعلق بالفعل قبله.\n(وَهُوَ) ضمير رفع منفصل في محل رفع مبتدأ، والواو حالية.\n(خَيْرُ) خبر.\n(الْحاكِمِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم. والجملة الاسمية في محل نصب حال. واللّه أعلم.","surah_id":7,"source_id":7},{"ayah_number":88,"text":"(قالَ الْمَلَأُ) فعل ماض وفاعله.\n(الَّذِينَ) اسم موصول في محل رفع صفة.\n(اسْتَكْبَرُوا) فعل ماض وفاعله.\n(مِنْ قَوْمِهِ) متعلقان بمحذوف حال من فاعل استكبروا، والجملة صلة الموصول.\n(لَنُخْرِجَنَّكَ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، والكاف مفعول به، واللام واقعة في جواب القسم المقدر، والجملة لا محل لها جواب القسم.\n(يا شُعَيْبُ) منادى مفرد علم مبني على الضم في محل نصب.\n(وَالَّذِينَ) اسم موصول مبني على الفتح معطوف على الكاف في لنخرجنك.\n(آمَنُوا) فعل ماض مبني على الضم متعلق به الظرف (مَعَكَ) بعده. والواو فاعله (مِنْ قَرْيَتِنا) متعلقان بالفعل قبلهما والجملة صلة الموصول (أَوْ) حرف عطف.\n(لَتَعُودُنَّ) اللام واقعة في جواب القسم تعودن فعل مضارع مرفوع بثبوت النون وأصلها تعودون ثم اتصلت به نون التوكيد الثقيلة فأصبح تعودونن ومن ثم حذفت النون الأولى لكراهة توالي النونات فصار تعودون ثم حذفت الواو الساكنة منعا من التقاء الساكنين، وبقيت الضمة دليلا عليها، والواو فاعل إذا كان معنى تعودن ترجعن. ويمكن أن نعرب تعودون فعل مضارع ناقص بمعنى تصيرن والواو اسمها والجار والمجرور بعدها متعلقان بمحذوف خبرها، والجملة معطوفة على جملة لنخرجنك يا شعيب (فِي مِلَّتِنا) متعلقان بالفعل قبلهما.\n(قالَ) الجملة مستأنفة (أَوَلَوْ) الهمزة حرف استفهام. والواو حرف عطف.\n(لَوْ) حرف شرط غير جازم.\n(كُنَّا كارِهِينَ) كان واسمها، و(كارِهِينَ) خبرها منصوب بالياء لأنه جمع مذكر سالم والجملة مفعول به وجواب لو محذوف لدلالة ما قبله عليه.","surah_id":7,"source_id":7},{"ayah_number":89,"text":"(قَدِ) حرف تحقيق.\n(افْتَرَيْنا) فعل ماض مبني على السكون، تعلق به الجار والمجرور بعده (عَلَى اللَّهِ)، و(نا) فاعله، و(كَذِباً) مفعوله، والجملة مستأنفة.\n(إِنْ) حرف شرط جازم.\n(عُدْنا) فعل ماض، و(نا) فاعله، وهو في محل جزم فعل الشرط- أو فعل ماض ناقص، كما في الفعل أو لتعودنّ.\n(فِي مِلَّتِكُمْ) متعلقان بالفعل عدنا.\n(بَعْدَ) ظرف زمان متعلق بالفعل عدنا كذلك.\n(إِذْ) ظرف لما مضى من الزمان مبني على السكون.\n(نَجَّانَا) فعل ماض مبني على الفتحة المقدرة على الألف، و(نا) ضمير متصل مبني على السكون في محل نصب مفعول به.\n(اللَّهِ) لفظ الجلالة فاعل (مِنْها) متعلقان بالفعل نجانا والجملة في محل جر بالإضافة (وَما يَكُونُ) الواو استئنافية وما نافية يكون فعل مضارع ناقص (لَنا) متعلقان بمحذوف خبر.\n(أَنْ نَعُودَ) أن ناصبة ومضارع منصوب، والمصدر المؤول من أن والفعل في محل رفع اسم يكون.\n(فِيها) متعلقان بالفعل نعود.\n(إِلَّا) أداة استثناء.\n(أَنْ يَشاءَ اللَّهُ) فعل مضارع منصوب بأن ولفظ الجلالة فاعله.\n(رَبُّنا) بدل مرفوع. والمصدر المؤول في محل نصب على الاستثناء والتقدير ما يكون لنا أن نعود فيها إلا في حال مشيئة اللّه.\n(وَسِعَ رَبُّنا كُلَّ شَيْءٍ) فعل ماض وفاعله ومفعوله.\n(عِلْماً) تمييز منصوب، والجملة مستأنفة.\n(عَلَى اللَّهِ) متعلقات بتوكلنا (تَوَكَّلْنا) فعل ماض مبني على السكون، ونا فاعله.\n(رَبُّنا) منادى مضاف، و(نا) مضاف إليه.\n(افْتَحْ) فعل دعاء والفاعل ضمير مستتر تقديره أنت.\n(بَيْنَنا) ظرف مكان متعلق بالفعل قبله.\n(وَبَيْنَ) عطف.\n(قَوْمِنا) مضاف إليه مجرور و(نا) في محل جر بالإضافة.\n(بِالْحَقِّ) متعلقان بالفعل افتح، والجملة مستأنفة.\n(وَأَنْتَ خَيْرُ الْفاتِحِينَ) الجملة الاسمية في محل نصب حال.\n(الْفاتِحِينَ) مضاف إليه.","surah_id":7,"source_id":7},{"ayah_number":90,"text":"(وَقالَ الْمَلَأُ)... تقدم إعرابها في الآية 88.\n(لَئِنِ) اللام موطئة للقسم.\n(إن) شرطية جازمة.\n(اتَّبَعْتُمْ) فعل ماض مبني على السكون، والتاء فاعله والميم لجمع الذكور.\n(شُعَيْباً) مفعول به، والجملة مقول القول.\n(إِنَّكُمْ) إن حرف مشبه بالفعل والكاف اسمها، والميم للجمع.\n(إِذاً) حرف جواب وجزاء.\n(لَخاسِرُونَ) خبر مرفوع وعلامة رفعه الواو، والنون عوضا عن التنوين في الاسم المفرد، واللام هي المزحلقة، والجملة الاسمية لا محل لها جواب القسم، وجواب الشرط محذوف لدلالة القسم عليه على القاعدة: إذا اجتمع شرط وقسم فالجواب للسابق منهما.","surah_id":7,"source_id":7},{"ayah_number":91,"text":"«فَأَخَذَتْهُمُ الرَّجْفَةُ» تقدم إعرابها في الآية 78.","surah_id":7,"source_id":7},{"ayah_number":92,"text":"(الَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(كَذَّبُوا شُعَيْباً) فعل ماض وفاعل ومفعول به والجملة صلة الموصول.\n(كَأَنْ) مخففة من كأن المشبهة بالفعل. واسمها ضمير الشأن محذوف.\n(لَمْ يَغْنَوْا) مضارع مجزوم بلم وعلامة جزمه حذف النون والواو فاعل.\n(فِيهَا) متعلقان بيغنوا والجملة في محل رفع خبر كأن، والجملة الاسمية كأن... في محل رفع خبر المبتدأ الذين.\n(كانُوا) فعل ماض ناقص والواو اسمها.\n(هُمُ) ضمير فصل لا محل له من الإعراب.\n(الْخاسِرِينَ) خبر منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم، والجملة خبر لاسم الموصول.","surah_id":7,"source_id":7},{"ayah_number":93,"text":"(فَتَوَلَّى عَنْهُمْ).... تقدم إعرابها في الآية 79.\n(فَكَيْفَ) اسم استفهام مبني على الفتح في محل نصب حال. والفاء هي الفصيحة.\n(آسى) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر، وقد تعلق به الجار والمجرور بعده.\n(كافِرِينَ) صفة مجرورة بالياء، والجملة لا محل لها جواب شرط مقدر.","surah_id":7,"source_id":7},{"ayah_number":94,"text":"(وَما أَرْسَلْنا) الواو استئنافية ما نافية أرسلنا فعل ماض مبني على السكون، متعلق به الجار والمجرور (فِي قَرْيَةٍ) و(نا) فاعله، (مِنْ نَبِيٍّ) من حرف جر زائد.\n(نَبِيٍّ) اسم مجرور لفظا منصوب محلا على أنه مفعول به.\n(إِلَّا) أداة حصر.\n(أَخَذْنا) فعل ماض وفاعله.\n(أَهْلَها) مفعوله.\n(بِالْبَأْساءِ) متعلقان بالفعل.\n(وَالضَّرَّاءِ) عطف. والجملة في محل نصب حال على تقدير قد قبلها وما أرسلنا.... إلا حال كوننا قد أخذنا.\n(لَعَلَّهُمْ) لعل والهاء اسمها وجملة (يَضَّرَّعُونَ) خبرها وجملة لعلهم تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":95,"text":"(ثُمَّ) حرف عطف.\n(بَدَّلْنا) فعل ماض مبني على السكون و(نا) فاعله.\n(مَكانَ) مفعوله الأول (السَّيِّئَةِ) مضاف إليه.\n(الْحَسَنَةَ) مفعوله الثاني.\n(حَتَّى) حرف غاية وجر.\n(عَفَوْا) فعل ماض مبني على الضم المقدر على الألف المحذوفة لالتقاء الساكنين، والواو فاعل. والمصدر المؤول من أن المضمرة بعد حتى والفعل في محل جر بحتى، والجار والمجرور متعلقان بالفعل بدلنا، وجملة بدلنا معطوفة.\n(وَقالُوا) معطوف على عفوا.\n(قَدْ) حرف تحقيق.\n(مَسَّ آباءَنَا) فعل ماض ومفعول به، (الضَّرَّاءُ) فاعل (وَالسَّرَّاءُ) عطف والجملة مقول القول.\n(فَأَخَذْناهُمْ) فعل ماض وفاعله ومفعوله والفعل معطوف على عفوا.\n(بَغْتَةً) حال أو نائب مفعول مطلق.\n(وَهُمْ) ضمير منفصل في محل رفع مبتدأ. وجملة (لا يَشْعُرُونَ) في محل رفع خبر وجملة وهم لا يشعرون في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":96,"text":"(وَلَوْ) حرف شرط غير جازم، الواو استئنافية.\n(أَنَّ أَهْلَ) أن واسمها (الْقُرى) مضاف إليه وجملة (آمَنُوا) خبرها. والمصدر المؤول من أن واسمها وخبرها في محل رفع فاعل لفعل محذوف. والتقدير ولو ثبت إيمان أهل القرى....\n(وَاتَّقَوْا) معطوفة على آمنوا....\n(لَفَتَحْنا) اللام واقعة في جواب الشرط. فتحنا فعل ماض تعلق به الجار والمجرور بعده.\n(و نا) فاعله.\n(بَرَكاتٍ) مفعوله منصوب بالكسرة لأنه جمع مؤنث سالم.\n(مِنَ السَّماءِ) متعلقان بمحذوف صفة لبركات.. والجملة لا محل لها جواب شرط غير جازم.\n(وَلكِنْ) حرف استدراك، والواو عاطفة.\n(كَذَّبُوا) فعل ماض والواو فاعله والجملة معطوفة.\n(فَأَخَذْناهُمْ) فعل ماض وفاعله ومفعوله.\n(بِما) ما اسم موصول مبني على السكون في محل جر بالباء والجار والمجرور متعلقان بالفعل قبلهما. أو ما مصدرية..\n(كانُوا) فعل ماض ناقص، والواو اسمها وجملة (يَكْسِبُونَ) خبر وجملة كانوا صلة الموصول لا محل لها من الإعراب.","surah_id":7,"source_id":7},{"ayah_number":97,"text":"(أَفَأَمِنَ) فعل ماض، والفاء عاطفة والهمزة للاستفهام، والجملة معطوفة على جملة أخذناهم.\n(أَهْلُ) فاعل.\n(الْقُرى) مضاف إليه.\n(أَنْ يَأْتِيَهُمْ) مضارع منصوب والهاء مفعوله، والمصدر المؤول من أن والفعل في محل نصب مفعول به والتقدير إتيان بأسنا.\n(بَأْسُنا) فاعل.\n(بَياتاً) ظرف زمان أو حال بمعنى بائتين. والجملة الاسمية (وَهُمْ نائِمُونَ) في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":98,"text":"إعراب هذه الآية كسابقتها.\n(ضُحًى) ظرف زمان متعلق بالفعل قبله.","surah_id":7,"source_id":7},{"ayah_number":99,"text":"(أَفَأَمِنُوا) فعل ماض والواو فاعله، والفاء عاطفة والهمزة للاستفهام.\n(مَكْرَ) مفعول به.\n(اللَّهِ) لفظ الجلالة مضاف إليه والجملة معطوفة.\n(فَلا) الفاء عاطفة. لا نافية.\n(يَأْمَنُ) فعل مضارع والفاعل هو.\n(مَكْرَ) مفعول به والجملة معطوفة.\n(إِلَّا) أداة حصر.\n(الْقَوْمُ) فاعل.\n(الْخاسِرُونَ) صفة.","surah_id":7,"source_id":7},{"ayah_number":100,"text":"(أَوَلَمْ يَهْدِ) فعل مضارع مجزوم بلم وعلامة جزمه حذف حرف العلة، الواو عاطفة والهمزة للاستفهام.\n(لِلَّذِينَ) متعلقان بالفعل والجملة معطوفة.\n(يَرِثُونَ الْأَرْضَ) فعل مضارع وفاعله ومفعوله والجملة صلة الموصول.\n(مِنْ بَعْدِ) متعلقان بيرثون.\n(أَهْلِها) مضاف إليه والهاء في محل جر بالإضافة.\n(أَنْ) مخففة من أنّ واسمها ضمير الشأن محذوف وتقديره أنه.\n(لَوْ) حرف شرط غير جازم.\n(نَشاءُ) فعل مضارع، والفاعل مستتر، وجملة نشاء في محل رفع خبر، وأن واسمها وخبرها في تأويل مصدر في محل رفع فاعل يهد، أو في محل نصب مفعول به، وفاعل يهد ضمير مستتر تقديره هو يعود إلى اللّه.\n(أَصَبْناهُمْ بِذُنُوبِهِمْ) فعل ماض تعلق به الجار والمجرور بعده، و(نا) فاعله والهاء مفعوله، والجملة لا محل لها جواب شرط غير جازم.\n(وَنَطْبَعُ عَلى قُلُوبِهِمْ) فعل مضارع تعلق به الجار والمجرور، والفاعل ضمير مستتر تقديره نحن، والواو استئنافية.\n(فَهُمْ) ضمير منفصل في محل رفع مبتدأ.\n(لا يَسْمَعُونَ) فعل مضارع مرفوع بثبوت النون، والواو فاعل و(لا) نافية، والجملة في محل رفع خبر، والجملة الاسمية (فهم لا يسمعون) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":101,"text":"(تِلْكَ) اسم إشارة مبني على الكسر في محل رفع مبتدأ، واللام للبعد، والكاف للخطاب.\n(الْقُرى) بدل مرفوع بالضمة المقدرة على الألف للتعذر، (نَقُصُّ عَلَيْكَ) فعل مضارع تعلق به الجار والمجرور كما تعلق به (مِنْ أَنْبائِها) وفاعله نحن والجملة في محل رفع خبر المبتدأ تلك. ويجوز أن نعرب القرى خبرا والجملة بعدها حالا.\n(وَلَقَدْ) الواو استئنافية، واللام واقعة في جواب القسم المقدر.\n(قد) حرف تحقيق.\n(جاءَتْهُمْ) فعل ماض مبني على الفتح والتاء للتأنيث، والهاء مفعول به والميم علامة جمع الذكور.\n(رُسُلُهُمْ) فاعل والهاء في محل جر بالإضافة، والميم للجمع.\n(بِالْبَيِّناتِ) متعلقان بالفعل قبلهما والجملة لا محل لها جواب القسم، وجملة القسم المقدرة وجوابها مستأنفة لا محل لها.\n(فَما) الفاء عاطفة، ما نافية.\n(كانُوا) كان والواو اسمها.\n(لِيُؤْمِنُوا) اللام لام الجحود.\n(يؤمنوا) مضارع منصوب بأن المضمرة بعد لام الجحود، وعلامة نصبه حذف النون لأنه من الأفعال الخمسة، والواو فاعل، والمصدر المؤول من أن المضمرة والفعل في محل جر بحرف الجر، والجار والمجرور متعلقان بمحذوف خبر كانوا أي ما كانوا مريدين للإيمان.\n(بِما) اسم موصول مبني على السكون في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل قبلهما. أو (ما) مصدرية والمصدر المؤول منها ومن الفعل بعدها (كَذَّبُوا) في محل جر بالباء أي بتكذيبهم، والجار والمجرور متعلقان بالفعل يؤمنوا. وعلى الأول فالجملة صلة الموصول.\n(مِنْ) حرف جر.\n(قَبْلُ) ظرف زمان مبني على الضم في محل جر لانقطاعه عن الإضافة.\n(كَذلِكَ) الكاف حرف جر.\n(ذا) اسم إشارة مبني على السكون في محل جر بحرف الجر، والجار والمجرور متعلقان بمحذوف صفة مفعول مطلق مقدّر أي يطبع اللّه على قلوب الكافرين طبعا كائنا كطبعه على قلوب السابقين.\n(يَطْبَعُ اللَّهُ عَلى قُلُوبِ) فعل مضارع تعلق به الجار والمجرور ولفظ الجلالة فاعله.\n(الْكافِرِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم والجملة الفعلية مستأنفة لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":102,"text":"(وَما) نافية لا عمل لها والواو استئنافية.\n(وَجَدْنا) فعل ماض وفاعله.\n(لِأَكْثَرِهِمْ) متعلقان بالفعل وجدنا أو بمحذوف حال (مِنْ عَهْدٍ) كان صفة له فلما تقدم صار حالا على القاعدة.\n(مِنْ عَهْدٍ) من حرف جر زائد وعهد اسم مجرور لفظا منصوب محلا على أنه مفعول به، والجملة مستأنفة.\n(وَإِنْ) مخففة من الثقيلة لا عمل لها لأنه وليها فعل ولهذا جاء بعدها اللام الفارقة التي تفرق بين النافية والمخففة.\n(وَجَدْنا) فعل ماض وفاعل.\n(أَكْثَرَهُمْ) مفعول به.\n(فاسقين) مفعول به ثان واللام هي الفارقة والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":103,"text":"(ثُمَّ) حرف عطف يفيد التراخي.\n(بَعَثْنا) فعل ماض تعلق به الجار والمجرور (مِنْ بَعْدِهِمْ) و(نا) فاعله.\n(مُوسى) مفعول به منصوب بالفتحة المقدرة على الألف للتعذر.\n(بِآياتِنا) متعلقان بمحذوف حال من موسى أو بالفعل.\n(إِلى فِرْعَوْنَ) اسم مجرور بالفتحة نيابة عن الكسرة ممنوع من الصرف للعلمية والعجمة، وهما متعلقان ببعثنا، والجملة معطوفة.\n(وَمَلَائِهِ) اسم معطوف.\n(فَظَلَمُوا بِها) فعل ماض تعلق به الجار والمجرور والواو فاعل. والفاء حرف عطف، والجملة معطوفة.\n(فَانْظُرْ كَيْفَ كانَ) تقدم إعرابها في الآية 84.","surah_id":7,"source_id":7},{"ayah_number":104,"text":"(وَقالَ مُوسى) فعل ماض وفاعل والواو استئنافية، والجملة مستأنفة.\n(يا فِرْعَوْنُ) منادى مفرد علم مبني على الضم في محل نصب.\n(إِنِّي) إن والياء اسمها.\n(رَسُولٌ) خبرها.\n(مِنْ رَبِّ) متعلقان بمحذوف صفة لرسول.\n(الْعالَمِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم والجملة الاسمية: (إني رسول) مقول القول.","surah_id":7,"source_id":7},{"ayah_number":105,"text":"(حَقِيقٌ) خبر لمبتدأ محذوف تقديره: أنا حقيق.\n(عَلى) حرف جر.\n(أَنْ) حرف ناصب.\n(لا أَقُولَ) مضارع منصوب فاعله أنا ولا نافية لا عمل لها. والمصدر المؤول من أن والفعل في محل جر بعلى.\nوالجار والمجرور متعلقان بحقيق لأنه بمعنى مفعول أو فاعل.\n(عَلَى اللَّهِ) متعلقان بأقول.\n(إِلَّا) أداة حصر.\n(الْحَقَّ) مفعول به منصوب.\n(قَدْ) حرف تحقيق.\n(جِئْتُكُمْ بِبَيِّنَةٍ) فعل ماض تعلق به الجار والمجرور بعده والتاء فاعله والكاف مفعوله.\n(فَأَرْسِلْ) أمر والفاء هي الفصيحة، والفاعل ضمير مستتر تقديره أنت.\n(مَعِيَ) ظرف مكان منصوب بالفتحة المقدرة على ما قبل ياء المتكلم، والياء في محل جر بالإضافة، وهو متعلق بأرسل.\n(بَنِي) مفعول به منصوب، وعلامة نصبه الياء لأنه ملحق بجمع المذكر السالم، وحذفت النون للإضافة، وهو مضاف.\n(إِسْرائِيلَ) مضاف إليه مجرور بالفتحة نيابة عن الكسرة ممنوع من الصرف اسم علم أعجمي، والجملة الفعلية لا محل لها جواب شرط غير جازم إذا علمت ذلك فأرسل معي بني إسرائيل.","surah_id":7,"source_id":7},{"ayah_number":106,"text":"(قالَ) الجملة استئنافية.\n(إِنْ) حرف شرط جازم.\n(كُنْتَ) فعل ماض ناقص والتاء اسمها.\n(جِئْتَ) ماض مبني على السكون والتاء فاعل والجملة في محل نصب خبر كنت.\n(بِآيَةٍ) متعلقان بجئت.\n(فَأْتِ) الفاء رابطة وفعل أمر مبني على حذف حرف العلة لأنه معتل الآخر، والفاعل أنت.\n(بِها) متعلقان بالفعل قبلهما.\n(إِنْ) شرطية (كُنْتَ) فعل الشرط (مِنَ الصَّادِقِينَ) متعلقان بمحذوف خبر، وحذف جواب لشرط لدلالة ما قبله عليه.","surah_id":7,"source_id":7},{"ayah_number":107,"text":"(فَأَلْقى) فعل ماض مبني على الفتحة المقدرة على الألف، والفاعل هو.\n(عَصاهُ) مفعول به منصوب بالفتحة المقدرة على الألف، والهاء ضمير متصل في محل جر بالإضافة، والجملة معطوفة.\n(فَإِذا) إذا الفجائية، والفاء عاطفة.\n(هِيَ) ضمير رفع منفصل في محل رفع مبتدأ.\n(ثُعْبانٌ) خبر.\n(مُبِينٌ) صفة، والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":108,"text":"(وَنَزَعَ يَدَهُ فَإِذا هِيَ بَيْضاءُ).... كسابقتها.\n(لِلنَّاظِرِينَ) متعلقان ببيضاء.","surah_id":7,"source_id":7},{"ayah_number":109,"text":"(قالَ الْمَلَأُ) فعل ماض وفاعل.\n(مِنْ قَوْمِ) متلعقان بمحذوف حال من الملأ، (فِرْعَوْنَ) مضاف إليه مجرور بالفتحة نيابة عن الكسرة للعلمية والعجمة. والجملة مستأنفة.\n(إِنَّ هذا) إن واسم الإشارة اسمها.\n(لَساحِرٌ) اللام المزحلقة.\n(ساحر) خبرها.\n(عَلِيمٌ) صفة والجملة مقول القول..","surah_id":7,"source_id":7},{"ayah_number":110,"text":"(يُرِيدُ) فعل مضارع والفاعل ضمير مستتر تقديره هو والمصدر المؤول من (أَنْ) الناصبة والفعل (يُخْرِجَكُمْ) مفعول به.\n(مِنْ أَرْضِكُمْ) متعلقان بالفعل يخرجكم، وجملة يريد في محل رفع خبر ثان.\n(فَما ذا) اسم استفهام مبني على السكون في محل نصب مفعول به مقدم. والفاء هي الفصيحة.\n(تَأْمُرُونَ) مضارع مرفوع بثبوت النون والواو فاعل ومفعوله محذوف تقديره تأمروننا. والجملة لا محل لها جواب شرط غير جازم.","surah_id":7,"source_id":7},{"ayah_number":111,"text":"(قالُوا) فعل ماض وفاعل والجملة مستأنفة.\n(أَرْجِهْ) فعل أمر مبني على السكون المقدر على الهمزة المحذوفة للتخفيف أرجئه، والهاء ضمير متصل مبني على السكون في محل نصب مفعول به. والفاعل ضمير مستتر تقديره أنت.\n(وَأَخاهُ) اسم معطوف على الهاء منصوب بالألف لأنه من الأسماء الخمسة. والهاء ضمير متصل مبني على الضم في محل جر بالإضافة، والجملة مقول القول.\n(وَأَرْسِلْ) فعل أمر تعلق به الجار والمجرور (فِي الْمَدائِنِ). والفاعل ضمير مستتر تقديره أنت.\n(حاشِرِينَ) حال أو مفعول به منصوب بالياء.","surah_id":7,"source_id":7},{"ayah_number":112,"text":"(يَأْتُوكَ) مضارع مجزوم جواب الطلب أرسل. والواو فاعل والكاف مفعول به.\n(بِكُلِّ) متعلقان بيأتوك.\n(ساحِرٍ) مضاف إليه.\n(عَلِيمٍ) صفة والجملة لا محل لها جواب شرط لم يقترن بالفاء.","surah_id":7,"source_id":7},{"ayah_number":113,"text":"(وَجاءَ السَّحَرَةُ) فعل ماض وفاعل.\n(فِرْعَوْنَ) مفعول به والجملة مستأنفة.\n(قالُوا) فعل ماض وفاعل والجملة مستأنفة كذلك.\n(إِنَّ لَنا) الجار والمجرور متعلقان بمحذوف خبر إن.\n(لَأَجْراً) اسمها. واللام لام الابتداء والجملة مقول القول.\n(إِنَّ) حرف شرط جازم.\n(كُنَّا) فعل ماض ناقص مبني على السكون، ونا اسمها (نَحْنُ) ضمير فصل لا محل له أو توكيد للضمير نا.\n(الْغالِبِينَ) خبر كنا منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم. وجواب الشرط محذوف دل عليه ما قبله.","surah_id":7,"source_id":7},{"ayah_number":114,"text":"(قالَ) فعل ماض والفاعل ضمير مستتر تقديره هو يعود إلى فرعون والجملة مستأنفة.\n(نَعَمْ) حرف جواب أغنى عن قوله إن لكم لأجرا..\n(وَإِنَّكُمْ) إن والكاف اسمها والجار والمجرور (لَمِنَ الْمُقَرَّبِينَ) متعلقان بمحذوف خبرها والواو عاطفة، والجملة معطوفة على الجملة المحذوفة المقدرة.","surah_id":7,"source_id":7},{"ayah_number":115,"text":"(قالُوا) الجملة مستأنفة (يا مُوسى) منادى مفرد علم مبني على الضم المقدر على الألف المقصورة في محل نصب.\n(إِمَّا) أداة شرط وتفصيل تفيد التخيير.\n(أَنْ تُلْقِيَ) مضارع منصوب والمصدر المؤول من أن والفعل في محل رفع مبتدأ والتقدير إما إلقاؤك مبدوء به وإما إلقاؤنا...\n(أَنْ) ناصبة.\n(نَكُونَ) فعل مضارع ناقص واسمها ضمير مستتر تقديره نحن.\n(نَحْنُ) ضمير فصل أو توكيد للضمير المستتر.\n(الْمُلْقِينَ) خبر والمصدر معطوف.","surah_id":7,"source_id":7},{"ayah_number":116,"text":"(قالَ) سبق إعرابها (أَلْقُوا) فعل أمر مبني عل حذف النون، والواو فاعل والجملة مقول القول، (فَلَمَّا) ظرفية شرطية، والفاء عاطفة.\n(أَلْقُوا) فعل ماض مبني على الضم المقدر على الألف المحذوفة لالتقاء الساكنين، والواو فاعل والجملة في محل جر بالإضافة.\n(سَحَرُوا) فعل ماض وفاعل والجملة جواب لما.\n(أَعْيُنَ) مفعول به.\n(النَّاسِ) مضاف إليه.\n(وَاسْتَرْهَبُوهُمْ) فعل ماض وفاعله ومفعوله، والجملة معطوفة.\n(وَجاؤُ) فعل ماض وفاعله والجملة معطوفة.\n(بِسِحْرٍ) متعلقان بالفعل قبلهما.\n(عَظِيمٍ) صفة والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":117,"text":"(وَأَوْحَيْنا) فعل ماض تعلق به الجار والمجرور بعده (إِلى مُوسى) و(نا) فاعله.\n(أَنْ) حرف تفسير.\n(أَلْقِ) فعل أمر مبني على حذف حرف العلة والفاعل أنت.\n(عَصاكَ) مفعول به منصوب وعلامة نصبه الفتحة المقدرة على الألف والكاف ضمير متصل في محل جر بالإضافة والجملة تفسيرية لا محل لها، ويجوز أن تكون أن مصدرية والمصدر المؤول مفعول به.\n(فَإِذا) الفاء عاطفة وإذا الفجائية.\n(هِيَ) ضمير رفع منفصل مبني على الفتح في محل رفع مبتدأ.\n(تَلْقَفُ) فعل مضارع فاعله هي والجملة خبر المبتدأ والجملة الاسمية (هي تلقف) معطوفة على جملة مقدرة فألقاها فإذا هي....\n(ما) اسم موصول في محل نصب مفعول به، وجملة (يَأْفِكُونَ) صلة الموصول أو ما مصدرية مؤولة مع الفعل بعدها بمصدر في محل نصب مفعول به (تلقف إفكهم).","surah_id":7,"source_id":7},{"ayah_number":118,"text":"(فَوَقَعَ الْحَقُّ) فعل ماض وفاعل والجملة معطوفة.\n(وَبَطَلَ ما) فعل ماض واسم الموصول فاعل. أو ما مصدرية مؤولة مع الفعل بعدها بمصدر في محل رفع فاعل بطل.\n(كانُوا) الواو اسمها وجملة (يَعْمَلُونَ) في محل رفع خبر. وجملة كانوا صلة الموصول.","surah_id":7,"source_id":7},{"ayah_number":119,"text":"(فَغُلِبُوا) فعل ماض مبني للمجهول، والواو نائب فاعل.\n(هُنالِكَ) اسم إشارة مبني على السكون في محل نصب على الظرفية المكانية واللام للبعد، والكاف للخطاب. والجملة معطوفة.\n(وَانْقَلَبُوا) فعل ماض وفاعله.\n(صاغِرِينَ) حال منصوبة بالياء والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":120,"text":"(وَأُلْقِيَ السَّحَرَةُ) فعل ماض مبني للمجهول ونائب فاعله.\n(ساجِدِينَ) حال والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":121,"text":"(قالُوا) فعل ماض وفاعل والجملة مستأنفة أو حالية على تقدير قد قبلها أي قائلين.\n(آمَنَّا) فعل ماض وفاعل والجملة مقول القول.\n(بِرَبِّ) متعلقان بآمنا.\n(الْعالَمِينَ) مضاف إليه","surah_id":7,"source_id":7},{"ayah_number":122,"text":"(رَبِّ) بدل من رب قبلها.\n(مُوسى) مضاف إليه مجرور بالكسرة المقدرة على الألف للتعذر.\n(وَهارُونَ) اسم معطوف مجرور بالفتحة نيابة عن الكسرة. اسم علم أعجمي.\n«وَهارُونَ» اسم معطوف مجرور بالفتحة نيابة عن الكسرة. اسم علم أعجمي.","surah_id":7,"source_id":7},{"ayah_number":123,"text":"(قالَ فِرْعَوْنُ) فعل ماض وفاعل والجملة مستأنفة.\n(آمَنْتُمْ) فعل ماض وفاعله والميم لجمع الذكور.\n(بِهِ) متعلقان بآمنتم وكذلك الظرف (قَبْلَ).\n(أَنْ) ناصبة.\n(آذَنَ) مضارع منصوب. فاعله أنا والمصدر المؤول من أن والفعل في محل جر بالإضافة.\n(لَكُمْ) متعلقان بآذن.\n(أَنْ) حرف مشبه بالفعل.\n(هذا) اسم إشارة مبني على السكون في محل نصب اسم إن.\n(لَمَكْرٌ) خبرها واللام المزحلقة.\n(مَكَرْتُمُوهُ) فعل ماض مبني على السكون، والتاء فاعل. والهاء مفعول به وقد أشبعت الضمة فتولدت منها الواو. والجملة في محل رفع صفة لمكر.\n(فِي الْمَدِينَةِ) متعلقان بالفعل قبلهما.\n(لِتُخْرِجُوا) فعل مضارع منصوب بأن المضمرة بعد لام التعليل. والمصدر المؤول في محل جر باللام، والجار والمجرور متعلقان بمكرتموه.\n(مِنْها) متعلقان بتخرجوا.\n(أَهْلَها) مفعول به والهاء في محل جر بالإضافة.\n(فَسَوْفَ) حرف استقبال والفاء استئنافية.\n(تَعْلَمُونَ) فعل مضارع وفاعل والجملة مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":124,"text":"(لَأُقَطِّعَنَّ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، واللام واقعة في جواب القسم المقدر. والفاعل ضمير مستتر تقديره أنا.\n(أَيْدِيَكُمْ) مفعول به منصوب بالفتحة، والكاف ضمير متصل في محل جر بالإضافة والميم لجمع الذكور. والجملة الفعلية لا محل لها جواب القسم.\n(وَأَرْجُلَكُمْ) عطف، (مِنْ خِلافٍ) متعلقان بالفعل أو بمحذوف حال من أيديكم...\n(ثُمَّ) حرف عطف، (لَأُصَلِّبَنَّكُمْ) كإعراب لأقطعن والكاف مفعوله (أَجْمَعِينَ) توكيد للضمير قبله منصوب وعلامة نصبه الياء والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":125,"text":"(قالُوا) الجملة مستأنفة (إِنَّا) إن ونا اسمها (إِلى رَبِّنا) متعلقان بالخبر (مُنْقَلِبُونَ) خبرها مرفوع بالواو لأنه جمع مذكر سالم، والجملة الاسمية مقول القول..","surah_id":7,"source_id":7},{"ayah_number":126,"text":"(وَما تَنْقِمُ) فعل مضارع متعلق به الجار والمجرور منا، والفاعل ضمير مستتر تقديره أنت. وما نافية، والواو استئنافية فالجملة مستأنفة.\n(إِلَّا) أداة حصر.\n(أَنْ) حرف مصدري ونصب.\n(آمَنَّا) فعل ماض مبني على السكون، ونا فاعله والمصدر المؤول من أن والفعل في محل نصب مفعول به. وما تنقم إلا إيماننا.\n(بِآياتِ) متعلقان بآمنا (رَبِّنا) مضاف إليه.\n(لَمَّا) ظرفية حينية (جاءَتْنا) فعل ماض، والتاء للتأنيث ونا مفعول به، والفاعل ضمير مستتر يعود إلى الآيات والجملة في محل جر بالإضافة.\n(رَبِّنا) منادى مضاف منصوب، ونا ضمير متصل في محل جر بالإضافة.\n(أَفْرِغْ) فعل دعاء تعلق به الجار والمجرور (عَلَيْنا).\n(صَبْراً) مفعول به. والجملة مقول القول المحذوف.\n(وَتَوَفَّنا) فعل دعاء مبني على حذف حرف العلة. ونا مفعوله والفاعل أنت (مُسْلِمِينَ) حال منصوبة بالياء. والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":127,"text":"(وَقالَ الْمَلَأُ) فعل ماض وفاعل.\n(مِنْ قَوْمِ) متعلقان بمحذوف حال من الملأ.\n(فِرْعَوْنَ) مضاف إليه مجرور بالفتحة نيابة عن الكسرة لأنه ممنوع من الصرف للعلمية والعجمة، والجملة مستأنفة.\n(أَتَذَرُ مُوسى) فعل مضارع ومفعوله والفاعل مستتر تقديره أنت، والهمزة للاستفهام، والجملة مقول القول.\n(وَقَوْمَهُ) عطف على موسى منصوب بالفتحة، والهاء في محل جر بالإضافة.\n(لِيُفْسِدُوا) فعل مضارع منصوب بأن المضمرة بعد لام التعليل، والواو فاعل، والمصدر المؤول من أن والفعل في محل جر باللام، والجار والمجرور متعلقان بتذر.\n(فِي الْأَرْضِ) متعلقان بيفسدوا.\n(وَيَذَرَكَ) مضارع منصوب معطوف على يفسدوا، والكاف مفعول به والفاعل ضمير مستتر تقديره هو.\n(وَآلِهَتَكَ) عطف على الكاف في يذرك، والكاف ضمير متصل في محل جر بالإضافة.\n(قالَ) الجملة استئنافية.\n(سَنُقَتِّلُ أَبْناءَهُمْ) فعل مضارع ومفعوله والفاعل نحن والجملة مقول القول.\n(وَنَسْتَحْيِي) فعل مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء منع من ظهورها الثقل، والفاعل ضمير مستتر تقديره نحن.\n(نِساءَهُمْ) مفعول به، والهاء مضاف إليه.\n(وَإِنَّا) إن واسمها والواو حالية.\n(فَوْقَهُمْ) ظرف مكان متعلق بالخبر.\n(قاهِرُونَ) خبر مرفوع وعلامة رفعه الواو لأنه جمع مذكر سالم، والجملة الاسمية في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":128,"text":"(قالَ مُوسى لِقَوْمِهِ) فعل ماض تعلق به الجار والمجرور لقومه وموسى فاعل والجملة مستأنفة.\n(اسْتَعِينُوا) فعل أمر مبني على حذف النون، تعلق به الجار والمجرور بعده (بِاللَّهِ) والواو فاعله والجملة مفعول به.\n(وَاصْبِرُوا) عطف.\n(إِنَّ الْأَرْضَ) إن واسمها.\n(لِلَّهِ) لفظ الجلالة مجرور باللام متعلقان بمحذوف خبر إن، والجملة تعليلية لا محل لها.\n(يُورِثُها) فعل مضارع والهاء مفعول به أول واسم الموصول (مَنْ) المفعول الثاني والجملة في محل نصب حال وجملة (يَشاءُ) صلة الموصول.\n(مِنْ عِبادِهِ) متعلقان بيشاء.\n(وَالْعاقِبَةُ) مبتدأ مرفوع.\n(لِلْمُتَّقِينَ) متعلقان بمحذوف خبر والجملة الاسمية مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":129,"text":"(قالُوا) الجملة مستأنفة (أُوذِينا) فعل ماض مبني للمجهول، مبني على السكون، تعلق به الجار والمجرور بعده (مِنْ قَبْلِ). ونا نائب فاعل والجملة مقول القول.\n(أَنْ) ناصبة (تَأْتِيَنا) مضارع منصوب بالفتحة الظاهرة، والمصدر المؤول من أن والفعل في محل جر بالإضافة من قبل إتيانك....\n(وَمِنْ بَعْدِ) عطف على من قبل (ما جِئْتَنا) فعل ماض والتاء فاعله ونا مفعوله، وما مصدرية، والمصدر المؤول في محل جر بالإضافة: من بعد مجيئك إلينا.\n(قالَ) الجملة مستأنفة (عَسى) فعل ماض جامد.\n(رَبُّكُمْ) اسمها.\n(أَنْ يُهْلِكَ) المصدر المؤول في محل رفع خبر عسى والتقدير مهلك (عدوكم).\n(وَيَسْتَخْلِفَكُمْ) فعل مضارع منصوب معطوف، والكاف مفعوله.\n(فِي الْأَرْضِ) متعلقان بالفعل قبلهما.\n(فَيَنْظُرَ) الفاء فاء السببية.\n(ينظر) مضارع منصوب بأن المضمرة بعد فاء السببية، والمصدر المؤول معطوف على الخبر مهلك. ويجوز أن تكون الفاء عاطفة..\n(كَيْفَ) اسم استفهام في محل نصب حال.\n(تَعْمَلُونَ) فعل مضارع وفاعله والجملة في محل نصب مفعول به للفعل ينظر.","surah_id":7,"source_id":7},{"ayah_number":130,"text":"(وَلَقَدْ) اللام واقعة في جواب القسم المقدر، وقد حرف تحقيق، والواو استئنافية.\n(أَخَذْنا) فعل ماض وفاعله و(آلَ) مفعوله، (فِرْعَوْنَ) مضاف إليه مجرور وعلامة جره الفتحة نيابة عن الكسرة ممنوع من الصرف اسم علم أعجمي.\n(بِالسِّنِينَ) اسم مجرور بالباء وعلامة جره الياء لأنه ملحق بجمع المذكر السالم والجار والمجرور متعلقان بأخذنا، والجملة لا محل لها من الإعراب واقعة في جواب القسم.\n(وَنَقْصٍ) عطف على بالسنين.\n(مِنَ الثَّمَراتِ) متعلقان بالمصدر نقص.\n(لَعَلَّهُمْ) لعل والهاء اسمها، والميم لجمع الذكور.\n(يَذَّكَّرُونَ) فعل مضارع وفاعل والجملة في محل رفع خبر لعل. والجملة الاسمية لعلهم يذكرون لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":131,"text":"(فَإِذا) ظرفية شرطية غير جازمة، والفاء استئنافية.\n(جاءَتْهُمُ الْحَسَنَةُ) فعل ماض والتاء للتأنيث والهاء مفعول به (الْحَسَنَةُ) فاعل، والجملة في محل جر بالإضافة.\n(قالُوا) الجملة لا محل لها لأنها جواب شرط غير جازم.\n(لَنا) جار ومجرور متعلقان بمحذوف خبر (هذِهِ) اسم الإشارة مبتدأ، والجملة الاسمية مفعول به.\n(وَإِنْ تُصِبْهُمْ سَيِّئَةٌ) إن شرطية تصبهم فعل مضارع مجزوم لأنه فعل الشرط، وسيئة فاعله، والهاء مفعوله والجملة معطوفة.\n(يَطَّيَّرُوا) فعل مضارع مجزوم بحذف النون جواب الشرط، تعلق به الجار والمجرور (بِمُوسى) بعده والواو فاعل، والجملة لا محل لها لأنها لم تقترن بالفاء..\n(وَمَنْ) اسم موصول مبني على السكون في محل جر معطوف على موسى.\n(مَعَهُ) ظرف مكان متعلق بمحذوف صلة الموصول والتقدير والذين آمنوا معه، والهاء في محل جر بالإضافة.\n(أَلا) أداة استفتاح.\n(إِنَّما) كافة ومكفوفة.\n(طائِرُهُمْ) مبتدأ.\n(عِنْدَ) ظرف مكان متعلق بمحذوف خبر المبتدأ والجملة الاسمية مستأنفة لا محل لها.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(وَلكِنَّ) حرف مشبه بالفعل والواو حالية.\n(أَكْثَرَهُمْ) اسمها.\n(لا يَعْلَمُونَ) فعل مضارع مرفوع والواو فاعله.\n(لا) نافية لا عمل لها والجملة الفعلية في محل رفع خبر لكن. والجملة الاسمية (و لكن أكثرهم....) حالية.","surah_id":7,"source_id":7},{"ayah_number":132,"text":"(وَقالُوا) الجملة معطوفة.\n(مَهْما) اسم شرط جازم مبني على السكون في محل رفع مبتدأ والجملة مقول القول.\n(تَأْتِنا) مضارع مجزوم بحذف حرف العلة، ونا مفعوله وفاعله أنت وهو في محل جزم فعل الشرط، (بِهِ) متعلقان بتأتنا.\n(مِنْ آيَةٍ) متعلقان بمحذوف حال.\n(لِتَسْحَرَنا) مضارع منصوب بأن المضمرة بعد لام التعليل ونا مفعول به والفاعل أنت والمصدر المؤول في محل جر بحرف الجر والجار والمجرور متعلقان بتأتنا (بِها) متعلقان بتسحرنا.\n(فَما) ما نافية تعمل عمل ليس والفاء رابطة لجواب الشرط مهما.\n(نَحْنُ) ضمير رفع منفصل في محل رفع اسمها.\n(بِمُؤْمِنِينَ) خبرها والباء حرف جر زائد.\n(لَكَ) متعلقان بالخبر مؤمنين والجملة الاسمية في محل جزم جواب الشرط مجملتا الشرط خبر مهما.","surah_id":7,"source_id":7},{"ayah_number":133,"text":"(فَأَرْسَلْنا) فعل ماض وفاعله.\n(عَلَيْهِمُ) متعلقان بأرسلنا (الطُّوفانَ) مفعوله.\n(وَالْجَرادَ وَالْقُمَّلَ وَالضَّفادِعَ وَالدَّمَ) أسماء معطوفة.\n(آياتٍ) حال منصوبة بالكسرة جمع مؤنث سالم.\n(مُفَصَّلاتٍ) صفة.\n(فَاسْتَكْبَرُوا) فعل ماض وفاعل والجملة معطوفة.\n(وَكانُوا قَوْماً مُجْرِمِينَ) كان واسمها وخبرها والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":134,"text":"(وَلَمَّا) ظرفية شرطية والواو عاطفة.\n(وَقَعَ عَلَيْهِمُ الرِّجْزُ) فعل ماض تعلق به الجار والمجرور والرجز فاعله، والجملة في محل جر بالإضافة. جملة (قالُوا) لا محل لها جواب لما.\n(يا مُوسَى) منادى مفرد علم مبني على الضم في محل نصب.\n(ادْعُ لَنا رَبَّكَ) فعل أمر مبني على حذف حرف العلة، تعلق به الجار والمجرور والفاعل أنت (لَنا)، (رَبَّكَ) مفعوله، والكاف مضاف إليه.\n(بِما) مصدرية مؤولة بمصدر في محل جر بالباء، والجار والمجرور متعلقان بالفعل ادع. أو ما موصولية.\n(عَهِدَ) الجملة صلة (عِنْدَكَ) ظرف مكان متعلق بالفعل عهد.\n(لَئِنْ) اللام موطئة للقسم إن حرف شرط جازم.\n(كَشَفْتَ) فعل ماض وفاعل، (الرِّجْزُ) مفعول به.\n(عَنَّا) متعلقان بكشف (الرِّجْزُ) مفعول به.\n(لَنُؤْمِنَنَّ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة وفاعله نحن واللام واقعة في جواب القسم.\n(لَكَ) متعلقان بالفعل قبلهما والجملة واقعة في جواب القسم. وجملة كشف ابتدائية لا محل لها، وجملة (لَنُرْسِلَنَّ) معطوفة على ما قبلها.\n(مَعَكَ) ظرف والكاف مضاف إليه (بَنِي) مفعول به منصوب وعلامة نصبه الياء لأنه ملحق بجمع المذكر السالم، وحذفت النون للإضافة.\n(إِسْرائِيلَ) مضاف إليه مجرور بالفتحة.","surah_id":7,"source_id":7},{"ayah_number":135,"text":"(فَلَمَّا كَشَفْنا عَنْهُمُ الرِّجْزَ) انظر إعراب الآية السابقة.\n(إِلى أَجَلٍ) متعلقان بمحذوف حال من الرجز.\n(هُمْ) ضمير منفصل في محل رفع مبتدأ.\n(بالِغُوهُ) خبر مرفوع وعلامة رفعه الواو لأنه جمع مذكر سالم، والهاء ضمير متصل في محل جر بالإضافة، وحذفت النون للإضافة، والجملة في محل جر صفة لأجل، (إِذا) الفجائية (هُمْ) مبتدأ (يَنْكُثُونَ) الجملة خبر.","surah_id":7,"source_id":7},{"ayah_number":136,"text":"(فَانْتَقَمْنا مِنْهُمْ) فعل ماض متعلق به الجار والمجرور، ونا فاعله، والجملة معطوفة، وكذلك جملة (فَأَغْرَقْناهُمْ فِي الْيَمِّ) فأغرقناهم في اليم، (بِأَنَّهُمْ) أن والهاء اسمها، (كَذَّبُوا) فعل ماض متعلق به الجار والمجرور (بِآياتِنا) والواو فاعله والجملة في محل رفع خبر أن. والمصدر المؤول من أن واسمها وخبرها في محل جر بالباء أغرقناهم بتكذيبهم...\n(وَكانُوا) كان والواو اسمها.\n(عَنْها) متعلقان بالخبر (غافِلِينَ) والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":137,"text":"(وَأَوْرَثْنَا الْقَوْمَ) فعل ماض وفاعله ومفعوله الأول. والجملة معطوفة.\n(الَّذِينَ) اسم موصول في محل نصب صفة.\n(كانُوا) كان والواو اسمها.\n(يُسْتَضْعَفُونَ) مضارع مبني للمجهول مرفوع بثبوت النون والواو نائب فاعل. والجملة في محل نصب خبر. وجملة كانوا يستضعفون صلة الموصول.\n(مَشارِقَ) مفعول به ثان.\n(الْأَرْضِ) مضاف إليه.\n(وَمَغارِبَهَا) عطف على مشارق (الَّتِي) اسم موصول مبني على السكون في محل نصب صفة.\n(بارَكْنا) فعل ماض، ونا فاعله (فِيها) متعلقان بباركنا والجملة صلة.\n(وَتَمَّتْ كَلِمَتُ) فعل ماض وفاعله، والتاء للتأنيث.\n(رَبِّكَ) مضاف إليه.\n(الْحُسْنى) صفة كلمة مرفوعة وعلامة رفعها الضمة المقدرة على الألف للتعذر (عَلى) حرف جر.\n(بَنِي) اسم مجرور وعلامة جره الياء لأنه ملحق بجمع المذكر السالم، وحذفت النون للإضافة، (إِسْرائِيلَ) مضاف إليه مجرور بالفتحة، ممنوع من الصرف للعلمية والعجمة.\n(بِما) ما مصدرية مؤولة مع الفعل بعدها (صَبَرُوا) بمصدر في محل جر بالباء والجار والمجرور متعلقان بالفعل تمت.\n(وَدَمَّرْنا) فعل ماض وفاعل.\n(ما) اسم موصول مبني على السكون في محل نصب مفعول به والجملة معطوفة.\n(كانَ) فعل ماض ناقص واسمها ضمير مستتر.\n(يَصْنَعُ فِرْعَوْنُ) فعل مضارع وفاعل.\n(وَقَوْمُهُ) عطف على فرعون. والجملة في محل نصب خبر كان.. وجملة كان واسمها وخبرها صلة الموصول لا محل لها.\n(وَما كانُوا يَعْرِشُونَ) عطف.","surah_id":7,"source_id":7},{"ayah_number":138,"text":"(وَجاوَزْنا) فعل ماض وفاعل.\n(بِبَنِي) متعلقان بالفعل (إِسْرائِيلَ) مضاف إليه (الْبَحْرَ) مضاف إليه.\n(فَأَتَوْا عَلى قَوْمٍ) فعل ماض متعلق به الجار والمجرور والواو فاعله والجملة معطوفة.\n(يَعْكُفُونَ) فعل مضارع وفاعل والجملة في محل جر صفة لقوم.\n(عَلى أَصْنامٍ) متعلقان بالفعل (لَهُمْ) متعلقان بمحذوف صفة لأصنام.\n(قالُوا) الجملة مستأنفة.\n(يا مُوسَى) سبق إعرابها.\n(اجْعَلْ لَنا) فعل أمر متعلق به الجار والمجرور والفاعل أنت (إِلهاً) مفعوله.\n(كَما) الكاف حرف جر وما مصدرية أو موصولية.\n(لَهُمْ) جار ومجرور متعلقان بمحذوف خبر المبتدأ (آلِهَةٌ). والمصدر المؤول من ما وما بعدها في محل جر بالكاف، والجار والمجرور متعلقان بمحذوف صفة إلها أي إلها معبودا كآلهتهم....\n(قالَ) الجملة مستأنفة.\n(إِنَّكُمْ قَوْمٌ) إن واسمها وجملة إنكم قوم.. مقول القول مفعول به.\n(تَجْهَلُونَ) الجملة صفة قوم.","surah_id":7,"source_id":7},{"ayah_number":139,"text":"(إِنَّ) حرف مشبه بالفعل (هؤُلاءِ) اسم إشارة مبني على الكسر في محل نصب اسم إن.\n(مُتَبَّرٌ) خبر إنّ.\n(ما) اسم موصول مبني على السكون في محل رفع نائب فاعل لمتبر.\n(هُمْ) ضمير منفصل في محل رفع مبتدأ. و(فِيهِ) متعلقان بمحذوف خبره والجملة صلة الموصول لا محل لها. والجملة الاسمية: إنّ هؤلاء.. استئنافية.\n(وَباطِلٌ) خبر مقدم.\n(ما) اسم موصول مبتدأ.\n(كانُوا) كان واسمها وجملة يعملون في محل نصب خبرها. وجملة كانوا صلة الموصول لا محل لها والجملة الاسمية وباطل ما كانوا يعملون.. معطوفة.","surah_id":7,"source_id":7},{"ayah_number":140,"text":"(قالَ) الجملة استئنافية (أَغَيْرَ) مفعول به مقدم، والهمزة للاستفهام.\n(اللَّهِ) لفظ الجلالة مضاف إليه مجرور.\n(أَبْغِيكُمْ) فعل مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل. والكاف مجرورة بنزع الخافض. أبغي لكم (إِلهاً) تمييز. والجملة مقول القول.\n(وَهُوَ) ضمير منفصل في محل رفع مبتدأ.\nالواو حالية.\n(فَضَّلَكُمْ) فعل ماض متعلق به الجار والمجرور والفاعل هو (عَلَى الْعالَمِينَ). والكاف مفعوله والجملة الفعلية في محل رفع خبر المبتدأ. والجملة الاسمية وهو فضلكم في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":141,"text":"في سورة البقرة الآية 49 نجيناكم بدل أنجيناكم.. ويذبحون أبناءكم بدل يقتلون أبناءكم.\n(وَإِذْ) مفعول فيه لفعل محذوف تقديره: اذكروا وقت.... والجملة في محل جر بالإضافة.\n(يَسُومُونَكُمْ) فعل مضارع وفاعل ومفعول به أول.\n(سُوءَ) مفعول به ثان، (الْعَذابِ) مضاف إليه والجملة حالية، وجملة (يُقَتِّلُونَ أَبْناءَكُمْ) بدل من جملة (يَسُومُونَكُمْ).\n(وَفِي ذلِكُمْ) متعلقان بمحذوف خبر المبتدأ.\n(بَلاءٌ) (مِنْ رَبِّكُمْ) متعلقان بمحذوف صفة بلاء.\n(عَظِيمٌ) صفة والجملة الاسمية مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":142,"text":"(وَواعَدْنا مُوسى) فعل ماض وفاعل ومفعول به أول.\n(ثَلاثِينَ) مفعول به ثان.\n(لَيْلَةً) تمييز. والجملة مستأنفة.\n(وَأَتْمَمْناها) فعل ماض ونا فاعله والها مفعوله.\n(بِعَشْرٍ) متعلقان بالفعل قبلهما، والجملة معطوفة.\n(فَتَمَّ مِيقاتُ رَبِّهِ) فعل ماض وفاعله.\n(أَرْبَعِينَ) مفعوله، والجملة معطوفة.\n(لَيْلَةً) تمييز.\n(قالَ مُوسى) فعل ماض وفاعل.\n(لِأَخِيهِ) اسم مجرور وعلامة جره الياء لأنه من الأسماء الخمسة.\nوالهاء ضمير متصل في محل جر بالإضافة.\n(هارُونَ) بدل مجرور بالفتحة نيابة عن الكسرة ممنوع من الصرف للعلمية والعجمة، والجملة معطوفة.\n(اخْلُفْنِي) فعل أمر مبني على السكون والنون للوقاية، والياء مفعول به والفاعل تقديره أنت.\n(فِي قَوْمِي) متعلقان بالفعل قبلهما.\n(وَأَصْلِحْ) عطف على اخلف.\n(وَلا تَتَّبِعْ) لا ناهية ومضارع مجزوم بلا الناهية، والفاعل أنت.\n(سَبِيلَ) مفعول به.\n(الْمُفْسِدِينَ) مضاف إليه والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":143,"text":"(وَلَمَّا) ظرفية شرطية والواو عاطفة.\n(جاءَ مُوسى لِمِيقاتِنا) فعل ماض تعلق به الجار والمجرور وموسى فاعله. والجملة في محل جر بالإضافة.\n(وَكَلَّمَهُ رَبُّهُ) فعل ماض والهاء مفعوله وربّه فاعله، والجملة معطوفة.\n(قالَ) فعل ماض وفاعله ضمير مستتر والجملة لا محل لها جواب شرط غير جازم.\n(رَبِّ) منادى مضاف منصوب بالفتحة المقدرة على ما قبل ياء المتكلم.\n(أَرِنِي) فعل دعاء مبني على حذف حرف العلة لأنه معتل الآخر، والنون للوقاية. والياء مفعوله الأول. ومفعوله الثاني محذوف تقديره نفسك، والفاعل ضمير مستتر تقديره أنت.\n(أَنْظُرْ إِلَيْكَ) مضارع مجزوم جواب الطلب وفاعله مستتر ومتعلقان بالفعل قبلهما، وجواب الطلب وفعله مقول القول.\n(قالَ) الجملة مستأنفة (لَنْ) حرف ناصب.\n(تَرانِي) مضارع منصوب وعلامة نصبه الفتحة المقدرة على الألف منع من ظهورها التعذر، والنون للوقاية، والياء مفعول به، والجملة مقول القول، (وَلكِنِ) حرف استدراك والواو عاطفة.\n(انْظُرْ إِلَى الْجَبَلِ) فعل أمر تعلق به الجار والمجرور فاعله أنت والجملة معطوفة.\n(فَإِنِ) إن شرطية جازمة والفاء عاطفة.\n(اسْتَقَرَّ) ماض في محل جزم فعل الشرط.\n(مَكانَهُ) ظرف مكان متعلق باستقر.\n(فَسَوْفَ) حرف استقبال والفاء رابطة لجواب الشرط.\n(تَرانِي) مضارع مرفوع والجملة في محل جزم جواب الشرط.\n(فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ) الفاء عاطفة، لما شرطية، تجلى فعل ماض وفاعله، والجملة في محل جر بالإضافة.\n(جَعَلَهُ دَكًّا) فعل ماض ومفعولاه والفاعل هو والجملة لا محل لها جواب شرط غير جازم.\n(وَخَرَّ مُوسى) فعل ماض وفاعل.\n(صَعِقاً) حال والجملة معطوفة.\n(فَلَمَّا أَفاقَ) الفاء استئنافية لما شرطية جازمة وماض وفاعله مستتر (قالَ) الجملة لا محل لها جواب لما.\n(سُبْحانَكَ) مفعول مطلق لفعل محذوف، والكاف في محل جر بالإضافة.\n(تُبْتُ) فعل ماض وفاعله.\n(إِلَيْكَ) متعلقان بتبت. والجملة مقول القول.\n(وَأَنَا أَوَّلُ) مبتدأ وخبر والجملة معطوفة.\n(الْمُؤْمِنِينَ) مضاف إليه.","surah_id":7,"source_id":7},{"ayah_number":144,"text":"(قالَ) الجملة مستأنفة (يا مُوسى) منادى مفرد علم.\n(إِنِّي) إن واسمها.\n(اصْطَفَيْتُكَ) فعل ماض وفاعله ومفعوله والجملة في محل رفع خبر إن. وجملة إن واسمها وخبرها مقول القول.\n(عَلَى النَّاسِ) متعلقان بالفعل قبلهما.\n(بِرِسالاتِي) اسم مجرور وعلامة جره الكسرة المقدرة على ما قبل ياء المتكلم والياء في محل جر بالإضافة. والجار والمجرور متعلقان باصطفيتك.\n(وَبِكَلامِي) عطف.\n(فَخُذْ) الفاء هي الفصيحة.\n(خذ) أمر.\n(ما) اسم موصول في محل نصب مفعول به. والجملة لا محل لها جواب شرط غير جازم مقدر إذا كان ذلك حاصلا فخذ ما آتيتك..\n(آتَيْتُكَ) ماض وفاعله والكاف مفعوله والجملة صلة ما.\n(وَكُنْ) فعل أمر ناقص واسمه محذوف تقديره أنت.\n(مِنَ الشَّاكِرِينَ) متعلقان بمحذوف خبره والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":145,"text":"(وَكَتَبْنا) فعل ماض متعلق به كل من الجار والمجرور (لَهُ) و(فِي الْأَلْواحِ مِنْ كُلِّ) ونا فاعله.\n(شَيْءٍ) مضاف إليه مجرور. والجملة مستأنفة.\n(مَوْعِظَةً) مفعول لأجله.\n(وَتَفْصِيلًا) عطف.\n(لِكُلِّ) متعلقان بتفصيلا.\n(شَيْءٍ) مضاف إليه.\n(فَخُذْها) فعل أمر ومفعوله والفاء واقعة في جواب شرط مقدر.\nوالفاعل مستتر (بِقُوَّةٍ) متعلقان بخذها والجملة لا محل لها، جواب شرط غير جازم مقدر.\n(وَأْمُرْ قَوْمَكَ) فعل أمر ومفعوله والفاعل ضمير مستتر والكاف في محل جر بالإضافة، والجملة معطوفة.\n(يَأْخُذُوا) مضارع مجزوم لأنه جواب الطلب، وعلامة جزمه حذف النون والواو فاعل.\n(بِأَحْسَنِها) متعلقان بيأخذوا، والجملة مفعول لفعل الأمر أأمر.\n(سَأُرِيكُمْ) فعل مضارع مرفوع والفاعل أنت والكاف مفعوله، والميم علامة جمع الذكور.\n(دارَ) مفعوله الثاني والأصل مصير دار الفاسقين..\n(الْفاسِقِينَ) مضاف إليه والجملة مستأنفة لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":146,"text":"(سَأَصْرِفُ عَنْ آياتِيَ) فعل مضارع تعلق به الجار والمجرور، (الَّذِينَ) اسم الموصول مفعوله والفاعل ضمير مستتر تقديره أنا والجملة مستأنفة.\n(يَتَكَبَّرُونَ) فعل مضارع وفاعل.\n(فِي الْأَرْضِ) متعلقان بيتكبرون والجملة صلة.\n(بِغَيْرِ) متعلقان بمحذوف حال.\n(الْحَقِّ) مضاف إليه (وَإِنْ) شرطية (يَرَوْا) فعل مضارع مجزوم وعلامة جزمه حذف النون لأنه فعل الشرط والواو فاعل و(كُلَّ) مفعول به.\n(آيَةٍ) مضاف إليه (لا يُؤْمِنُوا) مضارع مجزوم لأنه جواب الشرط، ولا نافية لا عمل لها.\n(بِها) متعلقان بالفعل قبلهما والجملة لا محل لها جواب شرط لم تقترن بالفاء أو إذا الفجائية.\n(وَإِنْ يَرَوْا سَبِيلَ الرُّشْدِ لا يَتَّخِذُوهُ سَبِيلًا) صدر الآية سبق إعرابها لا يتخذوه سبيلا فعل مضارع وفاعله ومفعولاه، والجملة لا محل لها كسابقتها.\n(ذلِكَ) اسم إشارة مبني على السكون في محل رفع مبتدأ. واللام للبعد والكاف حرف خطاب.\n(بِأَنَّهُمْ كَذَّبُوا) أن وما بعدها في تأويل مصدر في محل جر بالباء، والجار والمجرور متعلقان بمحذوف خبر المبتدأ.\n(وَكانُوا) كان واسمها.\n(عَنْها) متعلقان بالخبر (غافِلِينَ) والجملة معطوفة على جملة الخبر كذبوا.","surah_id":7,"source_id":7},{"ayah_number":147,"text":"(وَالَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(كَذَّبُوا بِآياتِنا) فعل ماض تعلق به الجار والمجرور والواو فاعله، والجملة صلة الموصول لا محل لها.\n(وَلِقاءِ) عطف.\n(الْآخِرَةِ) مضاف إليه.\n(حَبِطَتْ أَعْمالُهُمْ) فعل ماض وفاعل والجملة في محل رفع خبر المبتدأ الذين.\n(هَلْ) حرف استفهام يفيد النفي.\n(يُجْزَوْنَ) فعل مضارع مبني للمجهول والواو نائب فاعله، وهو المفعول الأول.\n(إِلَّا) أداة حصر (ما) اسم موصول في محل نصب مفعول به ثان.\n(كانُوا) كان والواو اسمها والجملة صلة الموصول لا محل له وجملة (يَعْمَلُونَ) في محل نصب خبرها.","surah_id":7,"source_id":7},{"ayah_number":148,"text":"(وَاتَّخَذَ قَوْمُ) فعل ماض وفاعل.\n(مُوسى) مضاف إليه.\n(مِنْ بَعْدِهِ) متعلقان باتخذ، والجملة مستأنفة.\n(مِنْ حُلِيِّهِمْ) متعلقان بالفعل.\n(عِجْلًا) مفعول به.\n(جَسَداً) بدل منصوب.\n(لَهُ) متعلقان بمحذوف خبر مقدم (خُوارٌ) مبتدأ، والجملة الاسمية في محل نصب صفة جسدا.\n(أَلَمْ يَرَوْا) الهمزة للاستفهام لم حرف جازم يروا مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل والجملة مستأنفة.\n(أَنَّهُ) أن والهاء اسمها.\n(لا يُكَلِّمُهُمْ) فعل مضارع فاعله هو والهاء مفعوله والميم لجمع الذكور، ولا نافية والجملة في محل رفع خبر أن، وأن وما بعدها سد مسد مفعولي يروا.\n(وَلا يَهْدِيهِمْ سَبِيلًا) فعل مضارع ومفعولاه، ولا نافية، والجملة معطوفة.\n(اتَّخَذُوهُ) فعل ماض مبني على الضم وفاعله ومفعوله والجملة مستأنفة، وجملة كانوا ظالمين معطوفة.","surah_id":7,"source_id":7},{"ayah_number":149,"text":"(وَلَمَّا) ظرفية شرطية.\n(سُقِطَ) فعل ماض مبني للمجهول.\n(فِي أَيْدِيهِمْ) اسم مجرور وعلامة جره الكسرة المقدرة على الياء منع من ظهورها الثقل، والهاء ضمير متصل في محل جر بالإضافة. والميم علامة جمع الذكور والجار والمجرور متعلقان بمحذوف نائب فاعل. والجملة في محل جر بالإضافة.\n(وَرَأَوْا) فعل ماض مبني على الضمة المقدرة على الألف المحذوفة لالتقاء الساكنين، والواو فاعل.\n(أَنَّهُمْ) أن واسمها وجملة (قَدْ ضَلُّوا) في محل رفع خبرها. وأن وما بعدها سدت مسد مفعولي رأوا.\n(قالُوا) ماض وفاعله والجملة لا محل لها لأنها جواب شرط غير جازم.\n(لَئِنْ) اللام موطئة للقسم وإن شرطية.\n(لَمْ) حرف جازم.\n(يَرْحَمْنا) مضارع مجزوم ومفعوله و(رَبُّنا) فاعله، والجملة ابتدائية لا محل لها.\n(وَيَغْفِرْ) عطف.\n(لَنا) متعلقان بيغفر.\n(لَنَكُونَنَّ) فعل مضارع ناقص مبني على الفتح لاتصاله بنون التوكيد الثقيلة، واللام واقعة في جواب القسم، واسمها ضمير مستتر تقديره نحن، والجملة لا محل لها جواب القسم. وحذف جواب الشرط لدلالة جواب القسم عليه.\n(مِنَ الْخاسِرِينَ) متعلقان بمحذوف خبر الفعل الناقص.","surah_id":7,"source_id":7},{"ayah_number":150,"text":"(وَلَمَّا) الواو عاطفة ولما الحينية الشرطية (رَجَعَ مُوسى إِلى قَوْمِهِ) فعل ماض تعلق به الجار والمجرور وموسى فاعله والجملة في محل جر بالإضافة.\n(غَضْبانَ) حال.\n(أَسِفاً) حال ثانية.\n(قالَ) الجملة جواب لما لا محل لها.\n(بِئْسَما) فعل ماض لإنشاء الذم والفاعل ضمير مستتر.\n(ما) نكرة موصوفة مبنية على السكون في محل نصب على التمييز.\n(خَلَفْتُمُونِي) فعل ماض مبني على السكون لاتصاله بتاء الفاعل المتحركة، والميم لجمع الذكور وقد أشبعت حركة الميم الضمة إلى الواو، والنون للوقاية، والياء مفعول به، والجملة في محل نصب صفة ما.\n(مِنْ بَعْدِي) اسم مجرور بالكسرة المقدرة على ما قبل ياء المتكلم، والياء في محل جر بالإضافة، والجار والمجرور متعلقان بالفعل قبلهما.\n(أَعَجِلْتُمْ) الهمزة للاستفهام وفعل ماض وفاعله.\n(أَمْرَ) مفعوله.\n(رَبِّكُمْ) مضاف إليه، والجملة مستأنفة.\n(وَأَلْقَى الْأَلْواحَ) ماض ومفعوله وفاعله هو والجملة معطوفة على قال.\n(وَأَخَذَ بِرَأْسِ) ماض فاعله مستتر والجار والمجرور متعلقان بالفعل قبلهما.\n(أَخِيهِ) مضاف إليه مجرور وعلامة جره الياء لأنه من الأسماء الخمسة، والهاء ضمير متصل في محل جر بالإضافة، والجملة معطوفة.\n(يَجُرُّهُ إِلَيْهِ) فعل مضارع تعلق به الجار والمجرور والهاء مفعوله والجملة في محل نصب حال.\n(قالَ) ماض فاعله مستتر (ابْنَ أُمَّ) جزءان مبنيان على الفتح في محل نصب على النداء، أو ابن منادى وأمّ: مضاف إليه مجرور بالكسرة المقدرة على الألف المحذوفة المنقلبة عن ياء. وقد دل على الألف المحذوفة الفتحة كما في المنادى المضاف إلى ياء المتكلم.\n(إِنَّ الْقَوْمَ) إن واسمها.\n(اسْتَضْعَفُونِي) فعل ماض وفاعله ومفعوله والجملة في محل رفع خبر إن وجملة إن القوم مفعول به.\n(كادُوا) كاد واسمها.\n(يَقْتُلُونَنِي) فعل مضارع وفاعل ومفعول به والجملة في محل نصب خبر كادوا وجملة كادوا معطوفة.\n(فَلا) الفاء هي الفصيحة، ولا ناهية جازمة.\n(تُشْمِتْ بِيَ الْأَعْداءَ) مضارع مجزوم تعلق به الجار والمجرور والأعداء مفعوله والفاعل ضمير مستتر، والجملة لا محل لها جواب شرط غير جازم.\n(وَلا) الواو عاطفة ولا ناهية.\n(تَجْعَلْنِي) مضارع مجزوم والنون للوقاية والياء مفعول به والفاعل أنت.\n(مَعَ الْقَوْمِ) ظرف مكان والقوم مضاف إليه.\n(الظَّالِمِينَ) صفة مجرورة وعلامة جرها الياء لأنها جمع مذكر سالم والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":151,"text":"(قالَ) ماض فاعله مستتر (رَبِّ) منادى بيا النداء المحذوفة.\n(اغْفِرْ لِي) فعل دعاء تعلق به الجار والمجرور وفاعله أنت.\n(وَلِأَخِي) اسم مجرور بالكسرة المقدرة على ما قبل ياء المتكلم، والياء في محل جر بالإضافة، والجار والمجرور معطوفان.\n(وَأَدْخِلْنا فِي رَحْمَتِكَ) فعل دعاء تعلق به الجار والمجرور ونا فاعله والجملة معطوفة.\n(وَأَنْتَ) أنت ضمير منفصل في محل رفع مبتدأ، والواو حالية.\n(أَرْحَمُ) خبر.\n(الرَّاحِمِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم والجملة في محل نصب حال.","surah_id":7,"source_id":7},{"ayah_number":152,"text":"(إِنَّ) حرف شبه بالفعل (الَّذِينَ) اسم موصول في محل نصب اسم إن.\n(اتَّخَذُوا الْعِجْلَ) فعل ماض وفاعل ومفعول به والمفعول الثاني محذوف أي اتخذوا العجل إلها، والجملة صلة الموصول لا محل لها.\n(سَيَنالُهُمْ غَضَبٌ) فعل مضارع ومفعوله وفاعله والسين للاستقبال والجملة في محل رفع خبر إن.\n(مِنْ رَبِّهِمْ) متعلقان غضب.\n(وَذِلَّةٌ) عطف (وَذِلَّةٌ فِي الْحَياةِ) متعلقان بذلة.\n(الدُّنْيا) صفة مجرورة بالفتحة المقدرة على الألف.\n(وَكَذلِكَ) الكاف حرف جر، ذا اسم إشارة في محل جر والجار والمجرور متعلقان بمحذوف صفة لمفعول مطلق: نجزي المفترين جزاء كائنا كذلك الجزاء.\n(نَجْزِي) مضارع مرفوع بالضمة المقدرة والفاعل مستتر تقديره نحن.\n(الْمُفْتَرِينَ) مفعول به منصوب وعلامة نصبه الياء، والجملة مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":153,"text":"(وَالَّذِينَ) اسم موصول مبني على الفتح في محل رفع مبتدأ، والواو استئنافية والجملة مستأنفة.\n(عَمِلُوا السَّيِّئاتِ) فعل ماض وفاعل ومفعول به منصوب بالكسرة نيابة عن الفتحة لأنه جمع مؤنث سالم والجملة صلة الموصول.\n(ثُمَّ تابُوا) ماض وفاعله وثم حرف عطف (مِنْ بَعْدِها) متعلقان بالفعل قبلهما والجملة معطوفة، وكذلك جملة آمنوا.\n(إِنَّ رَبَّكَ لَغَفُورٌ) إن اسمها وخبرها واللام المزحلقة.\nو(رَحِيمٌ) خبر ثان والجملة في محل رفع خبر المبتدأ الذين.","surah_id":7,"source_id":7},{"ayah_number":154,"text":"(وَلَمَّا) ظرفية شرطية والواو استئنافية.\n(سَكَتَ عَنْ مُوسَى الْغَضَبُ) فعل ماض تعلق به الجار والمجرور والغضب فاعله والجملة في محل جر بالإضافة، وجملة (أَخَذَ الْأَلْواحَ) لا محل لها جواب شرط غير جازم.\n(وَفِي نُسْخَتِها) متعلقان بمحذوف خبر مقدم (هُدىً) مبتدأ مؤخر.\n(وَرَحْمَةٌ) عطف.\n(لِلَّذِينَ) متعلقان بالمصدر رحمة.\n(هُمْ) ضمير رفع منفصل في محل رفع مبتدأ.\n(لِرَبِّهِمْ) اللام حرف جر زائد.\n(ربهم) اسم مجرور لفظا منصوب محلا على أنه مفعول به مقدم.\n(يَرْهَبُونَ) مضارع مرفوع بثبوت النون والواو فاعل. والجملة خبر هم. وجملة هم لربهم يرهبون: صلة الموصول لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":155,"text":"(وَاخْتارَ مُوسى) فعل ماض وفاعل.\n(قَوْمَهُ) مفعول به منصوب بنزع الخافض أصلها من قومه. والجار والمجرور متعلقان بالفعل قبلهما.\n(سَبْعِينَ) مفعول به منصوب بالياء.\n(رَجُلًا) تمييز.\n(لِمِيقاتِنا) متعلقان بالفعل اختار، والجملة مستأنفة.\n(فَلَمَّا) لما ظرفية شرطية. والفاء استئنافية.\n(أَخَذَتْهُمُ) فعل ماض وتاء التأنيث والهاء مفعوله.\n(الرَّجْفَةُ) فاعله والجملة في محل جر بالإضافة.\n(قالَ) الجملة لا محل لها لأنها جواب لما.\n(رَبِّ) منادى مضاف. وجملة النداء مقول القول.\n(لَوْ) حرف شرط غير جازم.\n(شِئْتَ) فعل ماض وفاعل والجملة لا محل لها جملة فعل الشرط.\n(أَهْلَكْتَهُمْ) فعل ماض وفاعل ومفعول به.\n(مِنْ قَبْلُ) ظرف زمان مبني على الضم في محل جر لانقطاعه عن الإضافة، والجار والمجرور متعلقان بالفعل قبلهما.\n(وَإِيَّايَ) ضمير منفصل مبني على الفتح في محل نصب معطوف على الهاء في أهلكتهم، والجملة لا محل لها جواب شرط غير جازم.\n(أَتُهْلِكُنا) فعل مضارع ومفعوله والفاعل أنت والهمزة للاستفهام.\n(بِما) ما اسم موصول مبني على السكون في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل.\n(فَعَلَ السُّفَهاءُ) فعل ماض وفاعل.\n(مِنَّا) متعلقان بمحذوف حال من السفهاء والجملة صلة الموصول.\n(إِنْ هِيَ إِلَّا فِتْنَتُكَ) مبتدأ وخبر وإن نافية بمعنى ما وإلا أداة حصر، والجملة مستأنفة مع القول.\n(تُضِلُّ بِها مَنْ تَشاءُ) فعل مضارع تعلق به الجار والمجرور واسم الموصول مفعوله والجملة في محل نصب حال، وجملة تشاء صلة الموصول.\n(وَتَهْدِي مَنْ تَشاءُ) عطف.\n(أَنْتَ وَلِيُّنا) مبتدأ وخبر.\n(فَاغْفِرْ لَنا) فعل دعاء تعلق به الجار والمجرور وفاعله أنت، والفاء هي الفصيحة. والجملة لا محل لها جواب شرط مقدر.\n(وَارْحَمْنا) عطف (وَأَنْتَ خَيْرُ) مبتدأ وخبر.\n(الْغافِرِينَ) مضاف إليه والجملة في محل نصب حال بعد واو الحال أو مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":156,"text":"(وَاكْتُبْ لَنا) فعل دعاء تعلق به الجار والمجرور وفاعله أنت.\n(فِي هذِهِ) اسم الإشارة في محل جر متعلقان بمحذوف حال.\n(الدُّنْيا) بدل.\n(حَسَنَةً) مفعول به.\n(وَفِي الْآخِرَةِ) عطف.\n(إِنَّا) إن ونا اسمها.\n(هُدْنا) فعل ماض تعلق به الجار والمجرور (إِلَيْكَ). ونا فاعله، والجملة في محل رفع خبر إنا، وجملة إنا هدنا إليك تعليلية لا محل لها. وجملة قال مستأنفة.\n(عَذابِي) مبتدأ مرفوع وعلامة رفعه الضمة المقدرة على ما قبل ياء المتكلم والياء في محل جر بالإضافة.\n(أُصِيبُ بِهِ) مضارع تعلق به الجار والمجرور واسم الموصول: (مَنْ) مفعوله وفاعله مستتر والجملة في محل رفع خبر، وجملة (أَشاءُ) صلة.\n(وَرَحْمَتِي) مبتدأ، (وَسِعَتْ كُلَّ شَيْءٍ) وسعت ماض وتاء التأنيث وكل مفعوله وشيء مضاف إليه والجملة خبر. وجملة ورحمتي.... معطوفة.\n(فَسَأَكْتُبُها لِلَّذِينَ) فعل مضارع تعلق به الجار والمجرور بعده فاعله أنا، والها مفعوله والفاء عاطفة والجملة معطوفة، وجملة (يَتَّقُونَ) صلة الموصول لا محل لها.\n(وَيُؤْتُونَ) فعل مضارع وفاعل (الزَّكاةَ) مفعول به. والجملة معطوفة (وَالَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(هُمْ) مبتدأ خبره جملة يؤمنون.\n(بِآياتِنا) متعلقان بالفعل بعدهما. والجملة الاسمية (هُمْ يُؤْمِنُونَ) في محل رفع خبر المبتدأ الذين.","surah_id":7,"source_id":7},{"ayah_number":157,"text":"(الَّذِينَ) اسم موصول بدل من الذين في الآية السابقة.\n(يَتَّبِعُونَ الرَّسُولَ) فعل مضارع وفاعل ومفعول به والجملة صلة الموصول.\n(النَّبِيَّ) بدل.\n(الْأُمِّيَّ) بدل ثان. واسم الموصول (الَّذِي) بدل ثالث.\n(يَجِدُونَهُ مَكْتُوباً) فعل مضارع وفاعله ومفعولاه.\n(عِنْدَهُمْ) ظرف مكان متعلق بمكتوبا.\n(فِي التَّوْراةِ) متعلقان بمحذوف حال (وَالْإِنْجِيلِ) معطوف.\n(يَأْمُرُهُمْ بِالْمَعْرُوفِ) الجملة الفعلية في محل نصب حال.\n(وَيَنْهاهُمْ عَنِ الْمُنْكَرِ) الجمل الفعلية بعدها معطوفة عليها.\n(وَيَضَعُ عَنْهُمْ إِصْرَهُمْ) مضارع ومفعوله والفاعل هو والجار والمجرور متعلقان بالفعل.\n(وَالْأَغْلالَ) عطف (الَّتِي) اسم موصول في محل نصب صفة للأغلال.\n(كانَتْ) فعل ماض وناقص واسمها ضمير مستتر.\n(عَلَيْهِمُ) متعلقان بمحذوف خبر كانت والجملة صلة.\n(فَالَّذِينَ) اسم موصول في محل رفع مبتدأ، والفاء استئنافية وجملة (آمَنُوا) صلة الموصول (بِهِ) متعلقان بآمنوا (وَعَزَّرُوهُ وَنَصَرُوهُ وَاتَّبَعُوا) الجمل معطوفة (النُّورَ) مفعول به.\n(الَّذِي) اسم موصول في محل نصب صفة النور.\n(أُنْزِلَ مَعَهُ) ماض مبني للمجهول تعلق به الظرف معه ونائب الفاعل محذوف والجملة صلة الموصول.\n(أُولئِكَ) اسم إشارة في محل رفع مبتدأ.\n(هُمُ) ضمير منفصل في محل رفع مبتدأ ثان أو ضمير فصل لا محل له.\n(الْمُفْلِحُونَ) خبر هم والجملة الاسمية هم المفلحون في محل رفع خبر أولئك. وجملة أولئك هم المفلحون خبر اسم الموصول فالذين.","surah_id":7,"source_id":7},{"ayah_number":158,"text":"(قُلْ) أمر فاعله مستتر (يا أَيُّهَا) أي منادى مبني على الضم نكرة مقصودة، في محل نصب بأداة النداء وها حرف تنبيه لا محل له.\n(النَّاسُ) بدل.\n(إِنِّي رَسُولُ) إن واسمها وخبرها.\n(اللَّهِ إِلَيْكُمْ) لفظ الجلالة مضاف إليه.\n(إِلَيْكُمْ) متعلقان بمحذوف حال: مبعوثا إليكم.\n(جَمِيعاً) حال. والجملة مقول القول.\n(الَّذِي) اسم موصول في محل جر بدل من اللّه، أو في محل رفع مبتدأ.\n(لَهُ) متعلقان بمحذوف خبر المبتدأ (مُلْكُ) (السَّماواتِ) مضاف إليه (وَالْأَرْضِ) عطف والجملة صلة الموصول.\n(لا إِلهَ) لا نافية للجنس وإله اسمها، وخبرها محذوف تقديره موجود.\n(إِلَّا) أداة حصر.\n(هُوَ) ضمير منفصل في محل رفع بدل من الضمير المستتر في الخبر المحذوف. والجملة بدل من جملة الصلة قبلها.\n(يُحيِي) الجملة كذلك بدل من الجملة قبلها.\n(وَيُمِيتُ) الجملة معطوفة.\n(فَآمِنُوا) فعل أمر مبني على حذف النون والواو فاعله.\n(بِاللَّهِ) لفظ الجلالة مجرور بالباء وهما متعلقان بآمنوا.\n(وَرَسُولِهِ) عطف والجملة مستأنفة.\n(النَّبِيِّ) بدل ثان.\n(الْأُمِّيِّ) بدل ثالث (الَّذِي) اسم موصول بدل رابع، وجملة (يُؤْمِنُ بِاللَّهِ وَكَلِماتِهِ) صلة الموصول.\n(بِاللَّهِ) لفظ الجلالة مجرور بالباء ومتعلقان بيؤمن و(كَلِماتِهِ) معطوف.\n(وَاتَّبِعُوهُ) فعل أمر مبني على حذف النون والواو فاعله والهاء مفعوله والجملة معطوفة على آمنوا.\n(لَعَلَّكُمْ) لعل والكاف اسمها والميم علامة جمع الذكور والجملة تعليلية لا محل لها وجملة (تَهْتَدُونَ) في محل رفع خبر لعل.","surah_id":7,"source_id":7},{"ayah_number":159,"text":"(وَمِنْ قَوْمِ) متعلقان بمحذوف خبر مقدم.\n(مُوسى) مضاف إليه.\n(أُمَّةٌ) مبتدأ مؤخر والجملة مستأنفة بعد الواو.\n(يَهْدُونَ) مضارع وفاعله.\n(بِالْحَقِّ) متعلقان بمحذوف حال أي متلبسين بالحق، والجملة في محل رفع صفة.\n(وَبِهِ) متعلقان بالفعل (يَعْدِلُونَ) بعدهما والجملة معطوفة على ما قبلها.","surah_id":7,"source_id":7},{"ayah_number":160,"text":"(وَقَطَّعْناهُمُ) فعل ماض وفاعل ومفعول به أول.\n(اثْنَتَيْ) مفعول به ثان منصوب وعلامة نصبه الياء لأنه ملحق بالمثنى.\n(عَشْرَةَ) جزء لا محل له من الإعراب.\n(أَسْباطاً) تمييز منصوب أو بدل.\n(أُمَماً) بدل منصوب من أسباطا والجملة معطوفة.\n(وَأَوْحَيْنا) فعل ماض تعلق به الجار والمجرور (إِلى مُوسى) ونا فاعله.\n(إِذِ) ظرف لما مضى من الزمن متعلق بأوحينا.\n(اسْتَسْقاهُ قَوْمُهُ) فعل ماض ومفعوله وفاعله والجملة في محل جر بالإضافة.\n(أَنِ) تفسيرية. وجملة (اضْرِبْ بِعَصاكَ الْحَجَرَ) لا محل لها مفسرة.\n(فَانْبَجَسَتْ مِنْهُ) الفاء عاطفة وفعل ماض تعلق به الجار والمجرور.\n(اثْنَتا) فاعل مرفوع وعلامة رفعه الألف.","surah_id":7,"source_id":7},{"ayah_number":161,"text":"لا يوجد إعراب لهذه الآية في كتاب \"مشكل إعراب القرآن\" للدعاس","surah_id":7,"source_id":7},{"ayah_number":162,"text":"(فَبَدَّلَ الَّذِينَ) الفاء عاطفة وماض، واسم الموصول فاعله (ظَلَمُوا) الجملة صلة.\n(قَوْلًا) مفعول به.\n(غَيْرَ) صفة.\n(الَّذِي) اسم موصول في محل جر بالإضافة (قِيلَ) ماض مبني للمجهول ونائب الفاعل مستتر (لَهُمْ) متعلقان به، (فَأَرْسَلْنا عَلَيْهِمْ رِجْزاً مِنَ السَّماءِ بِما كانُوا يَظْلِمُونَ).\n(بِما) ما مصدرية والمصدر الأول في محل جر بالباء والجار والمجرور متعلقان بأرسلنا. وقد تقدم إعراب هذه الآية في سورة البقرة برقم 59 مع اختلاف لا يكاد يذكر.","surah_id":7,"source_id":7},{"ayah_number":163,"text":"(وَسْئَلْهُمْ عَنِ الْقَرْيَةِ) فعل أمر تعلق به الجار والمجرور والهاء مفعوله وفاعله مستتر، والجملة مستأنفة.\n(الَّتِي) اسم موصول في محل جر صفة.\n(كانَتْ حاضِرَةَ) كان واسمها ضمير مستتر وحاضرة خبرها.\n(الْبَحْرِ) مضاف إليه.\n(إِذْ) ظرف لما مضى من الزمان متعلق بحاضرة.\n(يَعْدُونَ فِي السَّبْتِ) فعل مضارع تعلق به الجار والمجرور والواو فاعله والجملة في محل جر بالإضافة.\n(إِذْ) ظرف متعلق بيعدون أو بدل من إذ الأولى.\n(تَأْتِيهِمْ حِيتانُهُمْ) فعل مضارع ومفعوله وفاعله والجملة في محل جر بالإضافة.\n(يَوْمَ) ظرف زمان متعلق بالفعل.\n(سَبْتِهِمْ) مضاف إليه.\n(شُرَّعاً) حال.\n(وَيَوْمَ) عطف.\nوجملة (لا يَسْبِتُونَ) الجملة في محل جر بالإضافة وجملة (لا تَأْتِيهِمْ) في محل نصب حال.\n(كَذلِكَ) جار ومجرور متعلقان بمحذوف صفة لمفعول مطلق محذوف: التقدير (نَبْلُوهُمْ) بلاء كائنا كذلك البلاء.\n(نَبْلُوهُمْ) مضارع وفاعله ومفعوله (بِما) مصدرية والمصدر المؤول منها ومن الفعل الذي بعدها في محل جر بالباء والجار والمجرور متعلقان بالفعل نبلوهم.\n(كانُوا) الجملة صلة وجملة (يَفْسُقُونَ) في محل نصب خبر كانوا.","surah_id":7,"source_id":7},{"ayah_number":164,"text":"(وَإِذْ) عطف على إذ الأولى في الآية السابقة.\n(قالَتْ أُمَّةٌ) فعل ماض وفاعل.\n(مِنْهُمْ) متعلقان بمحذوف صفة لأمة والجملة في محل جر بالإضافة.\n(لِمَ) ما اسم استفهام في محل جر باللام، والجار والمجرور متعلقان بتعظون. والجملة الفعلية لم (تَعِظُونَ) الجملة مقول القول.\n(قَوْماً) مفعول به (اللَّهُ مُهْلِكُهُمْ) لفظ الجلالة مبتدأ ومهلكهم خبر والهاء مضاف إليه والجملة مقول القول (أَوْ مُعَذِّبُهُمْ) عطف.\n(عَذاباً) مفعول مطلق.\n(شَدِيداً) صفة.\n(قالُوا) الجملة مستأنفة.\n(مَعْذِرَةً) مفعول لأجله أي وعظناهم لأجل المعذرة أو مفعول مطلق: لنعتذر معذرة. وبالرفع خبر لمبتدأ محذوف تقديره موعظتنا معذرة..\n(إِلى رَبِّكُمْ) متعلقان بمعذرة. والجملة المقدرة مقول القول.\n(وَلَعَلَّهُمْ) لعل واسمها وجملة (يَتَّقُونَ) في محل رفع خبر وجملة (و لعلهم) معطوفة.","surah_id":7,"source_id":7},{"ayah_number":165,"text":"(فَلَمَّا) لما ظرفية شرطية والفاء استئنافية.\n(نَسُوا) فعل ماض وفاعله واسم الموصول (ما) مفعوله.\n(ذُكِّرُوا بِهِ) فعل ماض مبني للمجهول تعلق به الجار والمجرور والواو نائب فاعل.\n(أَنْجَيْنَا) فعل ماض وفاعله (الَّذِينَ) اسم الموصول مفعوله.\n(يَنْهَوْنَ عَنِ السُّوءِ) مضارع تعلق به الجار والمجرور بعده والواو فاعله والجملة صلة الموصول وجملة أنجينا لا محل لها جواب شرط غير جازم. والجملة الفعلية (وَأَخَذْنَا الَّذِينَ) معطوفة وجملة (ظَلَمُوا) صلة الموصول.\n(بِعَذابٍ) متعلقان بظلموا.\n(بَئِيسٍ) صفة.\n(بِما كانُوا) المصدر المؤول من ما والفعل بعدها في محل جر بالباء والجار والمجرور متعلقان بالفعل أخذنا، أي أخذنا الذين ظلموا بسبب فسقهم.\n(يَفْسُقُونَ) الجملة خبر كانوا.","surah_id":7,"source_id":7},{"ayah_number":166,"text":"(فَلَمَّا) ظرفية شرطية.\n(عَتَوْا) فعل ماض وفاعل الجملة مضاف إليه.\n(عَنْ ما) جار ومجرور متعلقان بالفعل.\n(نُهُوا) فعل ماض مبني للمجهول ونائب فاعله والجملة صلة.\n(عَنْهُ) متعلقان بالفعل.\n(قُلْنا لَهُمْ) الجملة لا محل لها جواب الشرط.\n(كُونُوا قِرَدَةً) كان واسمها وخبرها.\n(خاسِئِينَ) صفة والجملة مقول القول.","surah_id":7,"source_id":7},{"ayah_number":167,"text":"(وَإِذْ) ظرف زمان منصوب لفعل محذوف تقديره اذكر وقت، والجملة المقدرة مستأنفة.\n(تَأَذَّنَ رَبُّكَ) فعل ماض وفاعله والجملة في محل جر بالإضافة.\n(لَيَبْعَثَنَّ) فعل مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، واللام واقعة في جواب لقسم مفهوم من قوله تأذن. والجملة لا محل لها جواب القسم.\n(عَلَيْهِمْ) متعلقان بالفعل قبلهما.\n(إِلى يَوْمِ) متعلقان بالفعل يبعثن.\n(الْقِيامَةِ) مضاف إليه (مَنْ) اسم موصول في محل نصب مفعول به.\n(يَسُومُهُمْ) فعل مضارع والهاء مفعوله الأول.\n(سُوءَ) مفعوله الثاني.\n(الْعَذابِ) مضاف إليه والجملة صلة.\n(إِنَّ رَبَّكَ لَسَرِيعُ) إن واسمها وخبرها واللام المزحلقة. والجملة تعليلية.\n(الْعِقابِ) مضاف إليه (وَإِنَّهُ لَغَفُورٌ) إن واسمها وخبرها واللام المزحلقة.\n(رَحِيمٌ) خبر ثان.","surah_id":7,"source_id":7},{"ayah_number":168,"text":"(وَقَطَّعْناهُمْ) فعل ماض وفاعل ومفعول أول.\n(فِي الْأَرْضِ) متعلقان بالفعل (أُمَماً) مفعول به ثان.\n(مِنْهُمُ) متعلقان بمحذوف خبر.\n(الصَّالِحُونَ) مبتدأ مؤخر مرفوع وعلامة رفعه الواو لأنه جمع مذكر سالم.\n(وَمِنْهُمْ) متعلقان بمحذوف خبر مقدم.\n(دُونَ) الظرف متعلق بمحذوف صفة لمبتدأ محذوف: أي منهم أناس هابطون دون ذلك.\n(ذلِكَ) اسم الإشارة في محل جر بالإضافة.\nوجملة منهم الصالحون في محل نصب صفة أمما، وجملة ومنهم دون ذلك: معطوفة.\n(وَبَلَوْناهُمْ بِالْحَسَناتِ) فعل ماض تعلق به الجار والمجرور ونا فاعله والهاء مفعوله (وَالسَّيِّئاتِ) عطف والجملة مستأنفة.\n(لَعَلَّهُمْ يَرْجِعُونَ) لعل واسمها وجملة يرجعون خبر والجملة الاسمية تعليلية.","surah_id":7,"source_id":7},{"ayah_number":169,"text":"(فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ) فعل ماض تعلق به الجار والمجرور وخلف فاعله، والجملة معطوفة على جملة (و قطعناهم)، والجملة الفعلية (وَرِثُوا الْكِتابَ) في محل رفع صفة خلف.\n(يَأْخُذُونَ عَرَضَ) فعل مضارع وفاعل ومفعول به والجملة صفة ثانية.\n(هذَا) اسم إشارة في محل جر بالإضافة.\n(الْأَدْنى) بدل مجرور وعلامة جره الكسرة المقدرة.\n(وَيَقُولُونَ) فعل مضارع مرفوع بثبوت النون والواو فاعل والجملة معطوفة.\n(سَيُغْفَرُ لَنا) مضارع مبني للمجهول تعلق به الجار والمجرور (لَنا) ونائب فاعله يرجع إلى ما قبله، أي سيغفر لنا الأخذ.. والجملة مقول القول.\n(وَإِنْ) الواو عاطفة وإن شرطية (يَأْتِهِمْ) مضارع مجزوم بإن وعلامة جزمه حذف حرف العلة من آخره والهاء مفعوله و(عَرَضَ) فاعله.\n(مِثْلُهُ) صفة، والجملة مستأنفة.\n(يَأْخُذُوهُ) مضارع مجزوم جواب الشرط وعلامة جزمه حذف النون والواو فاعله والهاء مفعوله والجملة لا محل لها جواب شرط جازم لم تقترن بالفاء.\n(أَلَمْ يُؤْخَذْ عَلَيْهِمْ) الهمزة للاستفهام ومضارع مبني للمجهول مجزوم تعلق به الجار والمجرور (مِيثاقُ) نائب فاعله، (الْكِتابَ) مضاف إليه.\n(إِنْ) حرف مصدري ونصب.\n(لا) نافية.\n(يَقُولُوا) مضارع منصوب وعلامة نصبه حذف النون لأنه من الأفعال الخمسة والواو فاعل.\n(عَلَى اللَّهِ) لفظ الجلالة مجرور بعلى متعلقان بالفعل.\n(إِلَّا) أداة حصر.\n(الْحَقَّ) مفعول به، والمصدر المؤول من أن والفعل في محل جر بحرف الجر والتقدير: بعدم قولهم إلا الحق..\n(وَدَرَسُوا ما فِيهِ) فعل ماض وفاعله واسم الموصول ما مفعوله، و(فِيهِ) متعلقان بمحذوف صلة أي ما كتب فيه، وجملة درسوا معطوفة على جملة يؤخذ لأنها بمعنى أخذ..\n(وَالدَّارُ) مبتدأ.\n(الْآخِرَةُ) صفة.\n(خَيْرٌ) خبره والجملة الاسمية مستأنفة.\n(لِلَّذِينَ) متعلقان بخير قبلهما. وجملة (يَتَّقُونَ) صلة الموصول لا محل لها.\n(أَفَلا تَعْقِلُونَ) مضارع مرفوع بثبوت النون والواو فاعل، والجملة معطوفة على جملة مقدرة والهمزة للاستفهام.","surah_id":7,"source_id":7},{"ayah_number":170,"text":"(وَالَّذِينَ) اسم موصول مبني على الفتح في محل رفع مبتدأ.\n(يُمَسِّكُونَ بِالْكِتابِ) مضارع مرفوع بثبوت النون متعلق به الجار والمجرور والواو فاعله، والجملة صلة الموصول لا محل لها والجملة الفعلية (وَأَقامُوا الصَّلاةَ) معطوفة.\n(إِنَّا) إن ونا اسمها أصلها إننا حذفت نونها تخفيفا.\n(لا نُضِيعُ) لا نافية ومضارع مرفوع (أَجْرَ) مفعوله.\n(الْمُصْلِحِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم والجملة في محل رفع خبر إنا. والجملة الاسمية (إِنَّا لا نُضِيعُ).. في محل رفع خبر المبتدأ الذين.","surah_id":7,"source_id":7},{"ayah_number":171,"text":"(وَإِذْ) ظرفية حينية متعلقة بالفعل المقدر اذكر. والواو عاطفة والجملة المقدرة معطوفة على جملة وإذ تأذن ربك..\n(نَتَقْنَا الْجَبَلَ) فعل ماض وفاعل ومفعول به والجملة في محل جر بالإضافة.\n(فَوْقَهُمْ) ظرف مكان متعلق بالفعل.\n(كَأَنَّهُ ظُلَّةٌ) كأن واسمها وخبرها والجملة في محل نصب حال.\n(وَظَنُّوا) فعل ماض وفاعل والواو عاطفة.\n(أَنَّهُ واقِعٌ) أن واسمها وخبرها.\n(بِهِمْ) متعلقان بواقع. وأن وما بعدها سد مسد مفعولي ظنّ (خُذُوا) فعل أمر مبني على حذف النون والواو فاعل والجملة مستأنفة.\n(ما آتَيْناكُمْ) فعل ماض مبني على السكون ونا فاعله والكاف مفعوله واسم الموصول قبله مفعول خذوا والجملة صلة الموصول.\n(بِقُوَّةٍ) متعلقان بخذوا.\n(وَاذْكُرُوا) أمر وفاعله (ما) اسم موصول مفعول به (فِيهِ) متعلقان بمحذوف صلة الموصول.\n(لَعَلَّكُمْ تَتَّقُونَ) لعل واسمها وجملة تتقون خبر والجملة الاسمية تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":172,"text":"(وَإِذْ) سبق إعرابها (أَخَذَ رَبُّكَ) ماض وفاعله والجملة مضاف إليه.\n(مِنْ) حرف جر.\n(بَنِي) اسم مجرور وعلامة جره الياء لأنه ملحق بجمع المذكر السالم. وحذفت النون للإضافة.\n(آدَمَ) مضاف إليه مجرور بالفتحة للعلمية والعجمة.\n(مِنْ ظُهُورِهِمْ) بدل من الجار والمجرور قبلهما.\n(ذُرِّيَّتَهُمْ) مفعول به للفعل أخذ، والجملة في محل جر بالإضافة.\n(وَأَشْهَدَهُمْ) فعل ماض والهاء مفعوله.\n(عَلى أَنْفُسِهِمْ) متعلقان بالفعل والجملة معطوفة.\n(أَلَسْتُ) فعل ماض ناقص والتاء اسمها والهمزة للاستفهام.\n(بِرَبِّكُمْ) اسم مجرور لفظا منصوب محلا خبر لست، والكاف في محل جر بالإضافة والميم لجمع الذكور والباء حرف جر زائد. والجملة مقول القول المحذوف.\n(قالُوا) الجملة مستأنفة.\n(بَلى) حرف جواب.\n(شَهِدْنا) فعل ماض وفاعل والجملة مفعول به.\n(أَنْ تَقُولُوا) مضارع منصوب وعلامة نصبه حذف النون، والواو فاعل والمصدر المؤول في محل جر بحرف الجر، والتقدير: لئلا تقولوا والجار والمجرور متعلقان بالفعل شهدنا وقيل التقدير: شهدنا كراهية قولكم..\n(يَوْمَ) متعلق بتقولوا.\n(إِنَّا) إن واسمها.\n(كُنَّا) كان واسمها.\n(عَنْ هذا) متعلقان بالخبر (غافِلِينَ) والجملة في محل رفع خبر إنا وجملة إنا كنا.. مقول القول.","surah_id":7,"source_id":7},{"ayah_number":173,"text":"(أَوْ) عاطفة (تَقُولُوا) عطف على أن تقولوا والتقدير لئلا تقولوا.\n(إِنَّما) كافة ومكفوفة.\n(أَشْرَكَ آباؤُنا) فعل ماض وفاعل مرفوع ونا في محل جر بالإضافة.\n(مِنْ قَبْلُ) قبل ظرف زمان مبني على الضم في محل جر بحرف الجر والجار والمجرور متعلقان بأشرك والجملة مقول القول.\n(وَكُنَّا ذُرِّيَّةً) كان واسمها وخبرها.\n(مِنْ بَعْدِهِمْ) متعلقان بمحذوف صفة ذرية والجملة معطوفة.\n(أَفَتُهْلِكُنا) فعل مضارع ومفعول به والهمزة للاستفهام.\n(بِما) ما اسم موصول في محل جر بالباء والجار والمجرور متعلقان بالفعل، والجملة مستأنفة. والجملة الفعلية (فَعَلَ الْمُبْطِلُونَ) صلة.","surah_id":7,"source_id":7},{"ayah_number":174,"text":"(وَكَذلِكَ) اسم إشارة في محل جر بالكاف والجار والمجرور متعلقان بمحذوف صفة مفعول مطلق والتقدير نفصل الآيات تفصيلا كائنا. كذلك التفصيل.\n(نُفَصِّلُ) مضارع وفاعله نحن.\n(الْآياتِ) مفعول به منصوب وعلامة نصبه الكسرة نيابة عن الفتحة لأنه جمع مؤنث سالم.\n(وَلَعَلَّهُمْ يَرْجِعُونَ) الجملة مستأنفة. وجملة يرجعون خبر لعل.","surah_id":7,"source_id":7},{"ayah_number":175,"text":"(وَاتْلُ) فعل أمر مبني على حذف حرف العلة وفاعله ضمير مستتر تقديره أنت.\n(عَلَيْهِمْ) متعلقان بالفعل.\n(نَبَأَ) مفعول به، والجملة معطوفة على الجملة المقدرة (و اذكر إذ أخذ..).\n(الَّذِي) اسم موصول مبني على السكون في محل جر بالإضافة.\n(آتَيْناهُ) فعل ماض وفاعل ومفعول به أول.\n(آياتِنا) مفعول به ثان والجملة صلة الموصول.\n(فَانْسَلَخَ مِنْها) فعل ماض تعلق به الجار والمجرور فاعله مستتر، والفاء عاطفة.\n(فَأَتْبَعَهُ الشَّيْطانُ) فعل ماض ومفعوله وفاعله والجملة معطوفة.\n(فَكانَ مِنَ الْغاوِينَ) كان واسمها ضمير مستتر والجار والمجرور متعلقان بمحذوف خبرها والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":176,"text":"(وَلَوْ) لو شرطية غير جازمة.\n(شِئْنا) فعل ماض وفاعل والجملة مستأنفة.\n(لَرَفَعْناهُ) فعل ماض وفاعله ومفعوله، واللام واقعة في جواب الشرط والجملة لا محل لها جواب شرط غير جازم.\n(بِها) (وَلكِنَّهُ) لكن والهاء اسمها والجملة الفعلية (أَخْلَدَ إِلَى الْأَرْضِ) خبرها، والجملة الاسمية ولكنه معطوفة، وكذلك جملة (وَاتَّبَعَ هَواهُ) معطوفة.\n(فَمَثَلُهُ) مبتدأ والهاء في محل جر بالإضافة والفاء استئنافية.\n(كَمَثَلِ) متعلقان بمحذوف خبر المبتدأ.\n(الْكَلْبِ) مضاف إليه والجملة مستأنفة.\n(إِنْ) حرف جازم يجزم فعلين مضارعين.\n(تَحْمِلْ) مضارع مجزوم لأنه فعل الشرط تعلق به الجار والمجرور وفاعله أنت والجملة في محل نصب حال.\n(يَلْهَثْ) مضارع مجزوم جواب الشرط وفاعله ضمير مستتر والجملة لا محل لها لأنها جواب شرط غير جازم لم يقترن بالفاء أو إذا الفجائية.\n(أَوْ تَتْرُكْهُ يَلْهَثْ) عطف.\n(ذلِكَ) اسم إشارة في محل رفع مبتدأ واللام للبعد والكاف حرف خطاب.\n(مَثَلُ) خبره.\n(الْقَوْمِ) مضاف إليه.\n(الَّذِينَ) اسم موصول في محل جر صفة والجملة مستأنفة لا محل لها.\n(كَذَّبُوا) فعل ماض وفاعله.\n(بِآياتِنا) متعلقان بكذبوا والجملة صلة الموصول.\n(فَاقْصُصِ) فعل أمر وفاعله ضمير مستتر، والفاء هي الفصيحة.\n(الْقَصَصَ) مفعول به والجملة لا محل لها جواب شرط غير جازم مقدر: إذا عرفت ذلك فاقصص القصص.. وجملة (لَعَلَّهُمْ يَتَفَكَّرُونَ) تعليلية لا محل لها وجملة يتفكرون خبر لعل.","surah_id":7,"source_id":7},{"ayah_number":177,"text":"(ساءَ) فعل ماض لإنشاء الذم، وفاعله ضمير مستتر يفسره التمييز بعده أي ساء مثل القوم الذين كذبوا. والجملة خبر مقدم (مَثَلًا) تمييز منصوب.\n(الْقَوْمُ) مبتدأ مؤخر.\n(الَّذِينَ) اسم موصول في محل رفع صفة.\n(كَذَّبُوا بِآياتِنا) فعل ماض تعلق به الجار والمجرور والواو فاعله والجملة صلة الموصول.\n(وَأَنْفُسَهُمْ) مفعول به مقدم. والهاء في محل جر بالإضافة والميم علامة جمع الذكور.\n(كانُوا) كان واسمها، والجملة معطوفة، وجملة (يَظْلِمُونَ) خبرها.","surah_id":7,"source_id":7},{"ayah_number":178,"text":"(مَنْ) اسم شرط جازم في محل رفع مبتدأ.\n(يَهْدِ) مضارع مجزوم وعلامة جزمه حذف الياء لأنه معتل الآخر، وهو فعل الشرط ومفعوله محذوف أي يهده و(اللَّهُ) لفظ الجلالة فاعله (فَهُوَ) الفاء رابطة للجواب وهو ضمير رفع في محل رفع مبتدأ.\n(الْمُهْتَدِي) خبر مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل، والجملة في محل جزم جواب الشرط. وجملتا الشرط والجواب خبر من (وَمَنْ يُضْلِلْ) معطوف على ما سبق وإعرابه مثله.\n(فَأُولئِكَ) الفاء رابطة للجواب واسم إشارة مبني على الكسر في محل رفع مبتدأ.\n(هُمُ) ضمير فصل لا محل له أو ضمير منفصل في محل رفع مبتدأ.\n(الْخاسِرُونَ) خبره وجملة هم الخاسرون خبر أولئك، والجملة الاسمية في محل جزم جواب الشرط وجملتا الشرط والجواب خبر من.","surah_id":7,"source_id":7},{"ayah_number":179,"text":"(وَلَقَدْ) اللام واقعة في جواب القسم، قد حرف تحقيق، والواو للاستئناف.\n(ذَرَأْنا) فعل ماض وفاعل.\n(لِجَهَنَّمَ) متعلقان بالفعل.\n(كَثِيراً) مفعول به.\n(مِنَ الْجِنِّ) متعلقان بمحذوف صفة لكثيرا.\n(وَالْإِنْسِ) عطف (لَهُمْ) متعلقان بمحذوف خبر المبتدأ (قُلُوبٌ) مبتدأ مؤخر، والجملة الاسمية في محل نصب صفة لكثيرا.\n(لا يَفْقَهُونَ) مضارع مرفوع وعلامة رفعه ثبوت النون والواو فاعل ولا نافية لا عمل لها.\n(بِها) متعلقان بالفعل، والجملة في محل رفع صفة قلوب.\n(وَلَهُمْ أَعْيُنٌ لا يُبْصِرُونَ بِها وَلَهُمْ آذانٌ لا يَسْمَعُونَ بِها) إعرابهما كإعراب الآية السابقة.\n(أُولئِكَ) مبتدأ (كَالْأَنْعامِ) متعلقان بمحذوف خبر المبتدأ أولئك والجملة الاسمية مستأنفة.\n(بَلْ) حرف إضراب (هُمْ أَضَلُّ) مبتدأ وخبر. والجملة معطوفة.\n(أُولئِكَ هُمُ الْغافِلُونَ) إعرابها كإعراب (فَأُولئِكَ هُمُ الْخاسِرُونَ).","surah_id":7,"source_id":7},{"ayah_number":180,"text":"(وَلِلَّهِ) الواو استئنافية ولفظ الجلالة مجرور باللام ومتعلقان بمحذوف خبر المبتدأ (الْأَسْماءُ) مبتدأ.\n(الْحُسْنى) صفة مرفوعة بالضمة المقدرة على الألف منع من ظهورها التعذر. والجملة الاسمية مستأنفة.\n(فَادْعُوهُ) فعل أمر مبني على حذف النون، والواو فاعله والهاء مفعوله والفاء هي الفصيحة، والجملة لا محل لها جواب شرط غير جازم.\n(بِها) متعلقان بالفعل.\n(وَذَرُوا) فعل أمر وفاعله.\n(الَّذِينَ) اسم موصول مفعوله والجملة معطوفة.\n(يُلْحِدُونَ) مضارع وفاعله.\n(فِي أَسْمائِهِ) متعلقان بالفعل والجملة صلة الموصول (سَيُجْزَوْنَ ما كانُوا يَعْمَلُونَ) مضارع مرفوع مبني للمجهول والواو نائب فاعله واسم الموصول ما مفعوله والجملة مستأنفة، وجملة كانوا صلة الموصول لا محل لها وجملة يعملون في محل نصب خبر.","surah_id":7,"source_id":7},{"ayah_number":181,"text":"(وَمِمَّنْ) من اسم موصول مبني على السكون في محل جر بمن، والجار والمجرور متعلقان بمحذوف خبر مقدم (خَلَقْنا) ماض وفاعله (أُمَّةٌ) مبتدأ مؤخر، والجملة الاسمية مستأنفة، والجملة الفعلية (خَلَقْنا) صلة الموصول.\n(يَهْدُونَ) مضارع وفاعله.\n(بِالْحَقِّ) متعلقان بالفعل والجملة في محل رفع صفة.\n(وَبِهِ) متعلقان بالفعل بعدهما (يَعْدِلُونَ) والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":182,"text":"(وَالَّذِينَ) اسم موصول في محل رفع مبتدأ، والجملة الفعلية (كَذَّبُوا بِآياتِنا) صلة الموصول.\n(سَنَسْتَدْرِجُهُمْ) السين للاستقبال وفعل مضارع والهاء مفعوله، والفاعل ضمير مستتر تقديره نحن.\n(مِنْ) حرف جر (حَيْثُ) ظرف مبني على الضم في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل، والجملة في محل رفع خبر.\nوجملة (لا يَعْلَمُونَ) في محل جر بالإضافة.","surah_id":7,"source_id":7},{"ayah_number":183,"text":"(وَأُمْلِي) الواو عاطفة أو استئنافية وفعل مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل وفاعله أنا (لَهُمْ) (وَأُمْلِي) الواو عاطفة أو استئنافية وفعل مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل وفاعله أنا (لَهُمْ) متعلقان بالفعل. والجملة معطوفة أو مستأنفة.\n(إِنَّ كَيْدِي) إن حرف مشبه بالفعل كيدي اسم إن منصوب وعلامة نصبه الفتحة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة.\n(مَتِينٌ) خبر. والجملة الاسمية تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":184,"text":"(أَوَلَمْ) الهمزة للاستفهام، والواو عاطفة، ولم حرف نفي وجزم وقلب.\n(يَتَفَكَّرُوا) مضارع مجزوم وعلامة جزمه ح............\nنافية (بِصاحِبِهِمْ) جار ومجرور متعلقان بمحذوف خبر المبتدأ جنة، (مِنْ) حر جر زائد (جِنَّةٍ) اسم مجرور لفظا مرفوع محلا على أنه مبتدأ، والجملة الاسمية في محل نصب مفعول به للفعل يتفكروا الذي علق عن العمل بسبب ما النافية.\n(إِنْ) نافية لا عمل لها.\n(هُوَ) ضمير رفع منفصل في محل رفع مبتدأ.\n(إِلَّا) أداة حصر.\n(نَذِيرٌ) خبر.\n(مُبِينٌ) صفة، والجملة الاسمية مستأنفة.","surah_id":7,"source_id":7},{"ayah_number":185,"text":"(أَوَلَمْ يَنْظُرُوا).. إعرابها كإعراب الآية السابقة، (وَما) اسم موصول مبني على السكون في محل جر بفي المقدرة وهو معطوف على ملكوت (السَّماواتِ) مضاف إليه (وَالْأَرْضِ) عطف (وَما خَلَقَ) ماض (اللَّهُ) لفظ الجلالة فاعل. والجملة الفعلية صلة الموصول.\n(مِنْ شَيْءٍ) متعلقان بمحذوف حال و(أَنْ) المخففة واسمها ضمير الشأن أي وأنه.\n(عَسى) فعل ماض ناقص، واسمها ضمير مستتر، والمصدر المؤول من أن و(اقْتَرَبَ أَجَلُهُمْ) الفعل الناقص يكون وأن قبله في محل نصب خبرها. واسم يكون ضمير مستتر أيضا، والجملة الفعلية في محل نصب خبرها.\n(فَبِأَيِّ) جار ومجرور متعلقان بالفعل يؤمنون، والفاء هي الفصيحة.\n(حَدِيثٍ) مضاف إليه (بَعْدَهُ) متعلقان بمحذوف صفة لحديث، والجملة لا محل لها جواب شرط غير جازم.\n(يُؤْمِنُونَ) مضارع وفاعله.","surah_id":7,"source_id":7},{"ayah_number":186,"text":"(مَنْ) اسم شرط جازم مبتدأ، والجملة الفعلية (يُضْلِلِ اللَّهُ) في محل رفع خبر والجملة الاسمية من يضلل مستأنفة.\n(فَلا) الفاء رابطة للجواب ولا نافية للجنس.\n(هادِيَ) اسمها.\n(لَهُ) متعلقان بمحذوف خبرها أو باسم الفاعل هادي والخبر محذوف.\n(وَيَذَرُهُمْ) مضارع فاعله هو والهاء مفعوله والميم لجمع الذكور.\n(فِي طُغْيانِهِمْ) متعلقان بيعمهون، وجملة يذرهم استئنافية وجملة (يَعْمَهُونَ) حالية.","surah_id":7,"source_id":7},{"ayah_number":187,"text":"(يَسْئَلُونَكَ) مضارع مرفوع بثبوت النون تعلق به الجار والمجرور (عَنِ السَّاعَةِ) والواو فاعله والكاف مفعوله، والجملة مستأنفة.\n(أَيَّانَ) اسم استفهام في محل نصب على الظرفية الزمانية متعلق بمحذوف خبر (مُرْساها) مبتدأ والهاء مضاف إليه، والجملة الاسمية بدل من الساعة.\n(قُلْ) الجملة مستأنفة.\n(إِنَّما) كافة ومكفوفة.\n(عِلْمُها) مبتدأ والهاء في محل جر بالإضافة.\n(عِنْدَ) ظرف مكان متعلق بمحذوف خبر.\n(رَبِّي) مضاف إليه مجرور بالكسرة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة والجملة مقول القول.\n(لا) نافية (يُجَلِّيها) فعل مضارع تعلق به الجار والمجرور (لِوَقْتِها) والهاء مفعوله.\n(إِلَّا هُوَ) إلا أداة حصر هو فاعل. والجملة في محل نصب حال.\nوجملة (ثَقُلَتْ فِي السَّماواتِ وَالْأَرْضِ) مستأنفة.\n(لا تَأْتِيكُمْ) فعل مضارع فاعله مستتر والكاف مفعوله ولا نافية.\n(إِلَّا) أداة حصر.\n(بَغْتَةً) حال، والجملة مستأنفة (يَسْئَلُونَكَ) الجملة مستأنفة.\n(كَأَنَّكَ) كأن والكاف اسمها.\n(حَفِيٌّ عَنْها) خبرها تعلق به الجار والمجرور عنهابها (إِنَّما) والجملة في محل نصب حال.\n(قُلْ) أمر فاعله مستتر.\n(إِنَّما) كافة ومكفوفة (عِلْمُها) مبتدأ (عِنْدَ اللَّهِ) ظرف مكان ولفظ الجلالة مضاف إليه.\n(لكِنَّ أَكْثَرَ) لكن واسمها وجملة يعلمون خبرها (النَّاسِ) مضاف إليه (لا يَعْلَمُونَ) مضارع وفاعله ولا نافية.","surah_id":7,"source_id":7},{"ayah_number":188,"text":"(قُلْ) الجملة مستأنفة (لا) نافية (أَمْلِكُ لِنَفْسِي نَفْعاً) فعل مضارع تعلق به الجار والمجرور فاعله مستتر نفعا مفعوله والجملة مقول القول.\n(وَلا ضَرًّا) عطف.\n(إِلَّا) أداة استثناء.\n(ما) اسم موصول في محل نصب على الاستثناء والجملة الفعلية (شاءَ اللَّهُ) صلته.\n(وَلَوْ) حرف شرط غير جازم.\n(كُنْتُ) كان واسمها. وجملة (أَعْلَمُ الْغَيْبَ) خبرها. وجملة (لَاسْتَكْثَرْتُ مِنَ الْخَيْرِ) جواب شرط غير جازم لا محل لها (وَما) الواو عاطفة وما نافية.\n(مَسَّنِيَ) فعل ماض مبني على الفتحة المقدرة على ما قبل ياء المتكلم والياء ضمير متصل في محل نصب مفعول به، والنون للوقاية.\n(السُّوءُ) فاعل والجملة معطوفة.\n(إِنْ) نافية.\n(أَنَا) مبتدأ.\n(إِلَّا) أداة حصر.\n(نَذِيرٌ) خبر.\n(وَبَشِيرٌ) معطوف والجملة مستأنفة.\n(لِقَوْمٍ) متعلقان ببشير. وجملة (يُؤْمِنُونَ) في محل جر صفة.","surah_id":7,"source_id":7},{"ayah_number":189,"text":"(هُوَ) ضمير رفع منفصل مبتدأ.\n(الَّذِي) اسم موصول في محل رفع خبر والجملة مستأنفة.\n(خَلَقَكُمْ) فعل ماض تعلق به الجار والمجرور (مِنْ نَفْسٍ) وفاعله هو والكاف مفعوله (واحِدَةٍ) صفة والجملة صلة الموصول. وجملة (وَجَعَلَ مِنْها زَوْجَها) معطوفة.\n(لِيَسْكُنَ) مضارع منصوب بأن المضمرة بعد لام التعليل والمصدر المؤول في محل جر باللام، والجار والمجرور متعلقان بجعل.\n(فَلَمَّا) ظرفية شرطية، والفاء عاطفة.\n(تَغَشَّاها) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر. والهاء مفعوله والفاعل هو والجملة في محل جر بالإضافة.\n(حَمَلَتْ) فعل ماض وتاء التأنيث. وفاعله هي (حَمْلًا) مفعول مطلق باعتباره مصدرا ومفعول به إن كان غير مصدر.\n(خَفِيفاً) صفة والجملة لا محل لها جواب لما، وجملة (فَمَرَّتْ بِهِ) معطوفة.\n(فَلَمَّا) حينية شرطية (أَثْقَلَتْ) الجملة معطوفة.\n(دَعَوَا) فعل ماض مبني على الفتحة وألف الإثنين فاعل.\n(اللَّهَ) لفظ الجلالة مفعوله.\n(رَبَّهُما) بدل، والجملة جواب لما لا محل لها.\n(لَئِنْ) اللام موطئة للقسم وإن شرطية جازمة.\n(آتَيْتَنا) فعل ماض مبني على السكون والتاء فاعله. ونا مفعوله.\n(صالِحاً) صفة لمفعول به محذوف أي ولدا صالحا والجملة ابتدائية.\n(لَنَكُونَنَّ) اللام واقعة في جواب القسم ومضارع ناقص مبني على الفتح لاتصاله بنون التوكيد الثقيلة، (مِنَ الشَّاكِرِينَ) الجار والمجرور متعلقان بمحذوف خبر الفعل الناقص، والجملة لا محل لها جواب القسم. وقد أغنى عن جواب الشرط وجملة القسم والجواب مفسرة لجملة دعوا اللّه..","surah_id":7,"source_id":7},{"ayah_number":190,"text":"(فَلَمَّا) لما ظرفية شرطية.\n(آتاهُما) فعل ماض فاعله هو والهاء مفعوله الأول. وما للتثنية.\n(صالِحاً) صفة لمفعول ثان أي ولدا صالحا، والجملة في محل جر بالإضافة.\n(جَعَلا لَهُ شُرَكاءَ) فعل ماض تعلق به الجار والمجرور والألف فاعله و(شُرَكاءَ) مفعوله والجملة لا محل لها جواب شرط غير جازم.\n(فِيما) ما اسم موصول في محل جر بحرف الجر، والجار والمجرور متعلقان بمحذوف صفة شركاء، وجملة (آتاهُما) صلة.\n(فَتَعالَى اللَّهُ) فعل ماض ولفظ الجلالة فاعل والجملة مستأنفة.\n(عَمَّا يُشْرِكُونَ) ما مصدرية وهي مع الفعل بعدها في تأويل مصدر في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل أي: تعالى اللّه عن شركهم.","surah_id":7,"source_id":7},{"ayah_number":191,"text":"(أَيُشْرِكُونَ) مضارع والواو فاعله والهمزة للاستفهام.\n(ما) اسم موصول في محل نصب مفعول به.\n(لا يَخْلُقُ شَيْئاً) فعل مضارع ومفعوله والفاعل مستتر، ولا نافية والجملة صلة الموصول. وجملة (أَيُشْرِكُونَ) مستأنفة.\n(وَهُمْ) ضمير منفصل مبتدأ، والواو حالية.\n(يُخْلَقُونَ) مضارع مبني للمجهول والواو نائب فاعل والجملة في محل رفع خبر المبتدأ هم والجملة الاسمية وهم يخلقون حالية.","surah_id":7,"source_id":7},{"ayah_number":192,"text":"(وَلا يَسْتَطِيعُونَ) مضارع مرفوع بثبوت النون وفاعله ولا نافية لا عمل لها.\n(لَهُمْ) متعلقان بمحذوف حال من نصرا، (نَصْراً) مفعول به والجملة معطوفة.\n(وَلا أَنْفُسَهُمْ يَنْصُرُونَ) الجملة الفعلية معطوفة.","surah_id":7,"source_id":7},{"ayah_number":193,"text":"(وَإِنْ) شرطية (تَدْعُوهُمْ) مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعله والهاء مفعوله.\n(إِلَى الْهُدى) متعلقان بالفعل.\n(لا يَتَّبِعُوكُمْ) مضارع مجزوم جواب الشرط ولا نافية والجملة لا محل لها جواب شرط جازم لم يقترن بالفاء أو إذا الفجائية.\n(سَواءٌ) مبتدأ مرفوع أو خبر وما بعده مبتدأ.\n(عَلَيْكُمْ) متعلقان بسواء والجملة استئنافية.\n(أَدَعَوْتُمُوهُمْ) الهمزة للاستفهام وفعل ماض مبني على السكون لاتصاله بتاء الفاعل والتاء ضمير متصل مبني على السكون في محل رفع فاعل والهاء مفعول به والميم لجمع الذكور. وقد أشبعت الضمة فصارت واوا.\nوالهمزة للتسوية والاستفهام، وهي مؤولة مع الفعل بعدها بمصدر في محل رفع خبر المبتدأ، أو مبتدأ وسواء خبر.\n(أَمْ) حرف عطف.\n(أَنْتُمْ) مبتدأ.\n(صامِتُونَ) خبر والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":194,"text":"(إِنَّ) حرف مشبه بالفعل (الَّذِينَ) اسم موصول في محل نصب اسم إن.\n(تَدْعُونَ مِنْ دُونِ) مضارع تعلق به الجار والمجرور والجملة صلة الموصول.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(عِبادٌ) خبر.\n(أَمْثالُكُمْ) صفة.\n(فَادْعُوهُمْ) الفاء الفصيحة، وفعل أمر مبني على حذف النون والواو فاعله والهاء مفعوله، والجملة لا محل لها جواب شرط غير جازم. وجملة (فَلْيَسْتَجِيبُوا) معطوفة.\n(لَكُمْ) متعلقان بالفعل.\n(إِنَّ) شرطية (كُنْتُمْ) فعل ماض ناقص والتاء اسمها وهو في محل جزم فعل الشرط.\n(صادِقِينَ) خبرها، وجملة فعل الشرط لا محل لها ابتدائية، وجواب الشرط محذوف لدلالة ما قبله عليه.","surah_id":7,"source_id":7},{"ayah_number":195,"text":"(أَلَهُمْ) الهمزة للاستفهام وجار ومجرور متعلقان بمحذوف خبر (أَرْجُلٌ) مبتدأ. والجملة استئنافية.\nوجملة (يَمْشُونَ بِها) في محل رفع صفة. وكذلك إعراب الجمل الأخرى وهي (أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِها أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِها أَمْ لَهُمْ آذانٌ يَسْمَعُونَ بِها).\n(أَيْدٍ) مبتدأ مرفوع وعلامة رفعه الضمة المقدرة على الياء المحذوفة.\n(قُلِ) الجملة مستأنفة.\n(ادْعُوا) فعل أمر مبني على حذف النون والواو فاعله (شُرَكاءَكُمْ) مفعوله، والجملة مقول القول.\n(ثُمَّ) عاطفة (كِيدُونِ) فعل أمر مبني على حذف النون، والواو فاعله، والنون للوقاية والياء المحذوفة مفعوله والجملة معطوفة.\n(فَلا) لا ناهية (تُنْظِرُونِ) مضارع مجزوم بلا الناهية وعلامة جزمه حذف النون.","surah_id":7,"source_id":7},{"ayah_number":196,"text":"(إِنَّ) حرف مشبه بالفعل (وَلِيِّيَ) اسم إن منصوب وعلامة نصبه الفتحة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة.\n(اللَّهُ) لفظ الجلالة خبرها (الَّذِي) اسم الموصول في محل رفع صفة وجملة (نَزَّلَ الْكِتابَ) لا محل لها لأنها صلة الموصول.\n(وَهُوَ) هو: ضمير منفصل في محل رفع مبتدأ، والجملة معطوفة (يَتَوَلَّى الصَّالِحِينَ) الجملة في محل رفع خبر المبتدأ.","surah_id":7,"source_id":7},{"ayah_number":197,"text":"(وَالَّذِينَ) الواو عاطفة واسم موصول في محل رفع مبتدأ والجملة معطوفة (تَدْعُونَ) الجملة صلة، (مِنْ دُونِهِ) متعلقان بالفعل وجملة (لا يَسْتَطِيعُونَ نَصْرَكُمْ) خبر المبتدأ. وينظر إعراب الآية (10).","surah_id":7,"source_id":7},{"ayah_number":198,"text":"(وَإِنْ تَدْعُوهُمْ) ينظر الآية 193..\n(وَتَراهُمْ) فعل مضارع مرفوع وعلامة رفعه الضمة المقدرة على الألف للتعذر، وفاعله مستتر والهاء مفعوله، والجملة مستأنفة.\n(يَنْظُرُونَ) فعل مضارع والواو فاعله.\n(إِلَيْكَ) متعلقان بالفعل، والجملة في محل نصب حال وكذلك الجملة الاسمية بعدها (وَهُمْ لا يُبْصِرُونَ)، والجملة الفعلية لا يبصرون خبر المبتدأ هم.","surah_id":7,"source_id":7},{"ayah_number":199,"text":"(خُذِ الْعَفْوَ) فعل أمر ومفعوله والفاعل ضمير مستتر تقديره أنت.\n(وَأْمُرْ بِالْعُرْفِ) فعل أمر تعلق به الجار والمجرور بالعفو فاعله مستتر، والجملة معطوفة ومثلها (وَأَعْرِضْ عَنِ الْجاهِلِينَ).","surah_id":7,"source_id":7},{"ayah_number":200,"text":"(وَإِمَّا) إن الشرطية وما زائدة، والواو عاطفة.\n(يَنْزَغَنَّكَ) مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، والكاف مفعوله وجملة فعل الشرط ابتدائية لا محل لها.\n(مِنَ الشَّيْطانِ) متعلقان بمحذوف حال من نزع، كان صفة له فلما تقدم عليه صار حالا.\n(نَزْغٌ) فاعل.\n(فَاسْتَعِذْ بِاللَّهِ) الفاء رابطة للجواب وفعل أمر تعلق به الجار والمجرور وفاعله مستتر، والجملة في محل جزم جواب الشرط.\n(إِنَّهُ سَمِيعٌ عَلِيمٌ) إن واسمها وخبراها والجملة تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":201,"text":"(إِنَّ الَّذِينَ) إن واسم الموصول اسمها.\n(اتَّقَوْا) فعل ماض والواو فاعله والجملة صلة الموصول.\n(إِذا) ظرف لما يستقبل من الزمان خافض لشرطه منصوب بجوابه.\n(مَسَّهُمْ طائِفٌ) فعل ماض ومفعوله وفاعله والجملة في محل جر بالإضافة.\n(مِنَ الشَّيْطانِ) متعلقان بمحذوف صفة لطائف.\n(تَذَكَّرُوا) فعل ماض وفاعل والجملة لا محل لها جواب شرط غير جازم وفعل الشرط وجوابه خبر إن..\n(فَإِذا) الفاء عاطفة وإذا الفجائية.\n(هُمْ) مبتدأ.\n(مُبْصِرُونَ) خبره والجملة معطوفة.","surah_id":7,"source_id":7},{"ayah_number":202,"text":"(وَإِخْوانُهُمْ) الواو استئنافية ومبتدأ مرفوع والهاء في محل جر بالإضافة والجملة استئنافية، (يَمُدُّونَهُمْ) مضارع وفاعله ومفعوله والميم لجمع الذكور والجملة خبر.\n(فِي الغَيِّ) متعلقان بالفعل.\n(ثُمَّ) حرف عطف (لا يُقْصِرُونَ) لا نافية مضارع مرفوع وعلامة رفعه ثبوت النون والواو فاعله. ولا نافية والجملة معطوفة على الجملة الاستئنافية قبلها.","surah_id":7,"source_id":7},{"ayah_number":203,"text":"(إِذا) سبق أعربها في 201 (لَمْ تَأْتِهِمْ) مضارع مجزوم بلم والهاء مفعوله (بِآيَةٍ) متعلقان بالفعل والجملة في محل بالإضافة (قالُوا) ماض وفاعله والجملة جواب إذا لا محل لها (لَوْ لا) حرف تحضيض (اجْتَبَيْتَها) ماض وفاعله ومفعوله (قُلْ) فعل أمر (إِنَّما) كافة مكفوفة (أَتَّبِعُ) مضارع فاعله مستتر (ما) اسم موصول والجملة مقول القول (يُوحى) مضارع مبني للمجهول تعلق به الجار والمجرور (إِلَيَّ) ونائب الفاعل مستتر (مِنْ رَبِّي) متعلقان بمحذوف حال والجملة صلة (هذا بَصائِرُ) مبتدأ وخبر (مِنْ رَبِّكُمْ) متعلقان بمحذوف صفة بصائر (وَهُدىً) (وَرَحْمَةٌ) عطف (لِقَوْمٍ) متعلقان برحمة (يُؤْمِنُونَ) مضارع وفاعله والجملة صفة قوم.","surah_id":7,"source_id":7},{"ayah_number":204,"text":"(وَإِذا) ينظر الآية 201.\n(قُرِئَ الْقُرْآنُ) فعل ماض مبني للمجهول ونائب فاعله والجملة في محل جر بالإضافة.\n(فَاسْتَمِعُوا) أمر مبني على حذف النون وفاعله والجملة لا محل لها جواب شرط غير جازم.\n(لَهُ) متعلقان بالفعل.\n(وَأَنْصِتُوا) عطف.\n(لَعَلَّكُمْ تُرْحَمُونَ) لعل واسمها والجملة (تُرْحَمُونَ) خبرها وجملة لعلكم تعليلية لا محل لها.","surah_id":7,"source_id":7},{"ayah_number":205,"text":"(وَاذْكُرْ رَبَّكَ) فعل أمر ومفعوله والجملة معطوفة.\n(فِي نَفْسِكَ) متعلقان بالفعل.\n(تَضَرُّعاً) حال أو مفعول لأجله.\n(وَخِيفَةً) عطف.\n(وَدُونَ) ظرف مكان متعلق بمحذوف معطوف على خيفة والتقدير وداعيا دون الجهر.. من القول: متعلقان بالمصدر قبلهما.\n(بِالْغُدُوِّ) متعلقان باذكر..\n(وَالْآصالِ) معطوف.\n(وَلا تَكُنْ) مضارع ناقص مجزوم بالسكون لسبقه بلا الناهية. واسم تكن محذوف (مِنَ الْغافِلِينَ) متعلقان بمحذوف خبر الفعل الناقص، والجملة معطوفة على جملة واذكر..","surah_id":7,"source_id":7},{"ayah_number":206,"text":"(إِنَّ) حرف مشبه بالفعل (الَّذِينَ) اسم موصول في محل نصب اسم إن.\n(عِنْدَ) ظرف مكان متعلق بمحذوف صلة الموصول: الذين قرّبوا (عِنْدَ) ظرف مكان.\n(رَبِّكَ) مضاف إليه والكاف في محل جر بالإضافة، والجملة الاسمية استئنافية وجملة (لا يَسْتَكْبِرُونَ) الفعلية في محل رفع خبر إن.\n(عَنْ عِبادَتِهِ) متعلقان بالفعل، وجملة (يُسَبِّحُونَهُ) معطوفة.\n(وَلَهُ يَسْجُدُونَ) مضارع مرفوع بثبوت النون والواو فاعله وتعلق بالفعل الجار والمجرور قبله والجملة معطوفة.","surah_id":7,"source_id":7}]