[{"ayah_number":1,"text":"«وَالْفَجْرِ» جار ومجرور متعلقان بفعل محذوف تقديره أقسم","surah_id":89,"source_id":7},{"ayah_number":2,"text":"«وَلَيالٍ» معطوف على الفجر. «عَشْرٍ» صفة ليال","surah_id":89,"source_id":7},{"ayah_number":3,"text":"«وَالشَّفْعِ وَالْوَتْرِ» معطوفان على الفجر أيضا","surah_id":89,"source_id":7},{"ayah_number":4,"text":"«وَاللَّيْلِ» معطوف أيضا «إِذا» ظرف زمان «يَسْرِ» مضارع فاعله مستتر والجملة في محل جر بالإضافة.","surah_id":89,"source_id":7},{"ayah_number":5,"text":"(هَلْ) حرف تقرير (فِي ذلِكَ) خبر مقدم (قَسَمٌ) مبتدأ مؤخر (لِذِي) صفة قسم (حِجْرٍ) مضاف إليه والجملة الاسمية جواب القسم.","surah_id":89,"source_id":7},{"ayah_number":6,"text":"(أَلَمْ تَرَ) الهمزة حرف استفهام تقريري ومضارع مجزوم بلم والفاعل مستتر والجملة مستأنفة لا محل لها (كَيْفَ) اسم استفهام حال (فَعَلَ رَبُّكَ) ماض وفاعله (بِعادٍ) متعلقان بالفعل والجملة الفعلية سدت مسد مفعولي تر.","surah_id":89,"source_id":7},{"ayah_number":7,"text":"(إِرَمَ) بدل من عاد (ذاتِ) صفة مضافة إلى (الْعِمادِ).","surah_id":89,"source_id":7},{"ayah_number":8,"text":"(الَّتِي) صفة ثانية لإرم (لَمْ يُخْلَقْ) لم حرف جزم ومضارع مبني للمجهول مجزوم بلم (مِثْلُها) نائب فاعل (فِي الْبِلادِ) متعلقان بالفعل والجملة صلة.","surah_id":89,"source_id":7},{"ayah_number":9,"text":"(وَثَمُودَ) معطوف على عاد (الَّذِينَ) صفة ثمود (جابُوا) ماض وفاعله والجملة صلة الذي (الصَّخْرَ) مفعول به (بِالْوادِ) متعلقان بالفعل.","surah_id":89,"source_id":7},{"ayah_number":10,"text":"(وَفِرْعَوْنَ) معطوف على ما قبله (ذِي الْأَوْتادِ) صفة فرعون المضافة إلى الأوتاد.","surah_id":89,"source_id":7},{"ayah_number":11,"text":"(الَّذِينَ) بدل من عاد وثمود وفرعون (طَغَوْا) ماض وفاعله والجملة صلة (فِي الْبِلادِ) متعلقان بالفعل.","surah_id":89,"source_id":7},{"ayah_number":12,"text":"(فَأَكْثَرُوا) ماض وفاعله والجملة معطوفة على ما قبلها (فِيهَا) متعلقان بالفعل (الْفَسادَ) مفعول به.","surah_id":89,"source_id":7},{"ayah_number":13,"text":"(فَصَبَّ) ماض مبني على الفتح (عَلَيْهِمْ) متعلقان بالفعل (رَبُّكَ) لفظ الجلالة فاعل (سَوْطَ عَذابٍ) مفعول به مضاف إلى عذاب والجملة معطوفة على ما قبلها.","surah_id":89,"source_id":7},{"ayah_number":14,"text":"(إِنَّ رَبَّكَ لَبِالْمِرْصادِ) إن واسمها واللام المزحلقة (بالمرصاد) متعلقان بمحذوف خبر إن والجملة تعليل.","surah_id":89,"source_id":7},{"ayah_number":15,"text":"(فَأَمَّا) الفاء حرف استئناف وأما حرف شرط وتفصيل (الْإِنْسانُ) مبتدأ (إِذا) ظرفية شرطية غير جازمة (مَا) زائدة (ابْتَلاهُ) ماض ومفعول به (رَبُّهُ) فاعله والجملة في محل جر بالإضافة (فَأَكْرَمَهُ وَنَعَّمَهُ) معطوف على ما قبله.\n(فَيَقُولُ) الفاء رابطة ومضارع فاعله مستتر والجملة خبر المبتدأ (رَبِّي) مبتدأ (أَكْرَمَنِ) ماض مبني على الفتح والنون للوقاية وياء المتكلم المحذوفة مفعول به والجملة الفعلية خبر المبتدأ والجملة الاسمية مقول القول.","surah_id":89,"source_id":7},{"ayah_number":16,"text":"(وَأَمَّا) الواو حرف عطف وأما حرف شرط وتفصيل (إِذا) ظرفية شرطية غير جازمة (مَا) زائدة (ابْتَلاهُ) ماض ومفعوله والفاعل مستتر والجملة في محل جر بالإضافة (فَقَدَرَ عَلَيْهِ) معطوف على ما قبله (رِزْقَهُ) مفعول به (فَيَقُولُ) الفاء رابطة ويقول مضارع فاعله مستتر والجملة جواب الشرط لا محل لها (رَبِّي) مبتدأ (أَهانَنِ) ماض والنون للوقاية وياء المتكلم المحذوفة مفعول به والجملة الفعلية خبر المبتدأ والجملة الاسمية مقول القول.","surah_id":89,"source_id":7},{"ayah_number":17,"text":"(كَلَّا) حرف ردع وزجر (بَلْ) حرف إضراب (لا) نافية (تُكْرِمُونَ) مضارع مرفوع والواو فاعله (الْيَتِيمَ) مفعول به والجملة مستأنفة لا محل لها.","surah_id":89,"source_id":7},{"ayah_number":18,"text":"الآية معطوفة على ما قبلها.","surah_id":89,"source_id":7},{"ayah_number":19,"text":"(وَتَأْكُلُونَ) مضارع وفاعله (التُّراثَ) مفعول به (أَكْلًا) مفعول مطلق (لَمًّا) صفة والجملة معطوفة على ما قبلها.","surah_id":89,"source_id":7},{"ayah_number":20,"text":"معطوفة على ما قبلها وإعرابها واضح.","surah_id":89,"source_id":7},{"ayah_number":21,"text":"(كَلَّا) حرف ردع وزجر (إِذا) ظرفية شرطية غير جازمة (دُكَّتِ) ماض مبني للمجهول (الْأَرْضُ) نائب فاعل والجملة في محل جر بالإضافة (دَكًّا) مفعول مطلق (دَكًّا) مفعول مطلق توكيد لما قبله.","surah_id":89,"source_id":7},{"ayah_number":22,"text":"(وَجاءَ رَبُّكَ) ماض وفاعله والجملة معطوفة على قبلها (وَالْمَلَكُ) معطوف على ربك (صَفًّا صَفًّا) حالان.","surah_id":89,"source_id":7},{"ayah_number":23,"text":"(وَجِي ءَ) ماض مبني للمجهول (يَوْمَئِذٍ) ظرف زمان مضاف إلى مثله (بِجَهَنَّمَ) متعلقان بالفعل وهما في موضع نائب الفاعل والجملة معطوفة على ما قبلها.\n(يَوْمَئِذٍ) ظرف زمان مضاف إلى مثله (يَتَذَكَّرُ الْإِنْسانُ) مضارع وفاعله والجملة الفعلية جواب الشرط لا محل لها، (وَ) الواو حرف استئناف (أَنَّى) اسم استفهام في محل رفع خبر مقدم (لَهُ) متعلقان بالخبر المحذوف (الذِّكْرى) مبتدأ مؤخر، والجملة الاسمية مستأنفة لا محل لها.","surah_id":89,"source_id":7},{"ayah_number":24,"text":"(يَقُولُ) مضارع فاعله مستتر والجملة مستأنفة لا محل لها (يا) حرف تنبيه (لَيْتَنِي) حرف مشبه بالفعل والنون للوقاية والياء اسمها (قَدَّمْتُ) ماض وفاعله والجملة الفعلية خبر ليت والجملة الاسمية مقول القول (لِحَياتِي) متعلقان بالفعل.","surah_id":89,"source_id":7},{"ayah_number":25,"text":"(فَيَوْمَئِذٍ) الفاء حرف استئناف ويومئذ ظرف مضاف إلى مثله (لا) نافية (يُعَذِّبُ) مضارع (عَذابَهُ) مفعول به (أَحَدٌ) فاعل والجملة مستأنفة لا محل لها.","surah_id":89,"source_id":7},{"ayah_number":26,"text":"الجملة معطوفة على ما قبلها والإعراب واضح.","surah_id":89,"source_id":7},{"ayah_number":27,"text":"(يا أَيَّتُهَا) يا حرف نداء ومنادى نكرة مقصودة وها للتنبيه (النَّفْسُ) بدل (الْمُطْمَئِنَّةُ) صفة وجملة النداء مقول قول محذوف.","surah_id":89,"source_id":7},{"ayah_number":28,"text":"(ارْجِعِي) أمر مبني على حذف النون والياء فاعل (إِلى رَبِّكِ) متعلقان بالفعل (راضِيَةً مَرْضِيَّةً) حالان والجملة مقول قول محذوف أيضا.","surah_id":89,"source_id":7},{"ayah_number":29,"text":"(فَادْخُلِي) أمر مبني على حذف النون والياء فاعل (فِي عِبادِي) متعلقان بالفعل والجملة معطوفة على ما قبلها.","surah_id":89,"source_id":7},{"ayah_number":30,"text":"(وَادْخُلِي) أمر وفاعله (جَنَّتِي) مفعول به والجملة معطوفة على ما قبلها.","surah_id":89,"source_id":7}]