[{"ayah_number":1,"text":"(اسْمَ) ذهب أهل البصرة في اشتقاقه إلى أنه مشتق من السمو وهو العلو بينما ذهب أهل الكوفة إلى أنه مشتق من السمة وهي العلامة- وحذفت الألف في البسملة لكثرة استعمالها.\n(الرَّحْمنِ) وزنه فعلان وفيه معنى المبالغة، ولا يوصف به إلا اللّه تعالى.\n(الرَّحِيمِ) وزنه فعيل وفيه كذلك معنى المبالغة.\n(بِسْمِ) جار ومجرور متعلقان بفعل محذوف تقديره ابتدئ أو بخبر محذوف تقديره ابتدائي (اللَّهِ) لفظ الجلالة مضاف إليه.\n(الرَّحْمنِ) صفة للّه.\n(الرَّحِيمِ) صفة ثانية.\nوجملة البسملة ابتدائية لا محل لها من الإعراب.","surah_id":1,"source_id":7},{"ayah_number":2,"text":"(الْحَمْدُ) الثناء على الجميل بالقول.\n(الرب) المالك والسيد وقد يراد به المصلح والمربي.\n(الْعالَمِينَ) جمع عالم بفتح اللام ويراد به جميع الكائنات.\n(الْحَمْدُ) مبتدأ مرفوع.\n(لِلَّهِ) لفظ الجلالة مجرور باللام ومتعلقان بخبر محذوف تقديره الحمد واجب.\n(رَبِّ) صفة للّه، أو بدل منه.\n(الْعالَمِينَ) مضاف إليه مجرور بالياء لأنه ملحق بجمع المذكر السالم.","surah_id":1,"source_id":7},{"ayah_number":3,"text":"«الرَّحْمنِ ، الرَّحِيمِ» صفتان للّه.","surah_id":1,"source_id":7},{"ayah_number":4,"text":"«مالِكِ» صفة ثالثة. «يَوْمِ» مضاف إليه. «الدِّينِ» مضاف إليه ثان.","surah_id":1,"source_id":7},{"ayah_number":5,"text":"(إِيَّاكَ) ضمير نصب منفصل مبني على الفتح في محل نصب مفعول به مقدم.\n(نَعْبُدُ) فعل مضارع (وَإِيَّاكَ) سبق إعرابها.\n(نَسْتَعِينُ) فعل مضارع أصله نستعون استثقلوا الكسرة على الواو ونقلوها إلى العين فانقلبت الواو ياء لانكسار ما قبلها.","surah_id":1,"source_id":7},{"ayah_number":6,"text":"(اهْدِنَا) فعل أمر يراد به الدعاء مبني على حذف حرف العلة.\nوالفاعل ضمير مستتر تقديره أنت ونا ضمير متصل في محل نصب مفعول به.\n(الصِّراطَ) اسم منصوب بنزع الخافض- أو مفعول به ثان.\n(الْمُسْتَقِيمَ) صفة للصراط، والأصل مستقوم مثل نستعين.","surah_id":1,"source_id":7},{"ayah_number":7,"text":"(صِراطَ) بدل من الصراط- بدل كل من كل.\n(الَّذِينَ) اسم موصول مبني على الفتح في محل جر بالإضافة.\n(أَنْعَمْتَ) فعل ماض مبني على السكون، والتاء تاء الفاعل، وجملة أنعمت صلة الموصول لا محل لها.\n(عَلَيْهِمْ) جار ومجرور متعلقان بأنعمت.\n(غَيْرِ) صفة الذين.\n(الْمَغْضُوبِ) مضاف إليه.\n(عَلَيْهِمْ) متعلقان بالمغضوب.\n(وَلَا) الواو عاطفة، لا زائدة لتأكيد معنى النفي في غير.\n(الضَّالِّينَ) معطوف على المغضوب عليهم مجرور بالياء لأنه جمع مذكر سالم.\n(آمين) اسم فعل أمر للدعاء ليست من الفاتحة وهي بمعنى استجب، مبني على السكون وحرك بالفتح لمناسبة الياء المكسور ما قبلها.","surah_id":1,"source_id":7}]