[{"ayah_number":1,"text":"(بَراءَةٌ) خبر لمبتدأ محذوف تقديره هذه براءة.\n(مِنَ اللَّهِ) متعلقان بمحذوف صفة لبراءة.\n(وَرَسُولِهِ) عطف.\n(إِلَى الَّذِينَ) اسم موصول في محل جر، والجار والمجرور متعلقان بمحذوف صفة.\n(عاهَدْتُمْ) فعل ماض، والتاء ضمير متصل في محل رفع فاعل، والجملة صلة الموصول.\n(مِنَ الْمُشْرِكِينَ) متعلقان بالفعل. وجملة هذه براءة ابتدائية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":2,"text":"(فَسِيحُوا) فعل أمر مبني على حذف النون، والواو فاعل، والفاء استئنافية والجملة مستأنفة.\n(فِي الْأَرْضِ) متعلقان بالفعل، وكذلك ظرف الزمان، (أَرْبَعَةَ) متعلق بالفعل.\n(أَشْهُرٍ) مضاف إليه.\n(وَاعْلَمُوا) الجملة معطوفة.\n(أَنَّكُمْ) أن والكاف اسمها والميم لجمع الذكور، و(غَيْرُ) خبر، (مُعْجِزِي) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم، وحذفت النون للإضافة، والياء ضمير متصل في محل جر بالإضافة، (اللَّهِ) لفظ الجلالة مضاف إليه.\n(وَأَنَّ اللَّهَ) أن ولفظ الجلالة اسمها، (مُخْزِي) خبرها مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل.\n(الْكافِرِينَ) مضاف إليه.\nوالمصدر المؤول من أن واسمها وخبرها معطوف وسد مسد مفعولي علم.","surah_id":9,"source_id":7},{"ayah_number":3,"text":"(وَأَذانٌ) خبر لمبتدأ محذوف تقديره هذا أذان. والجملة معطوفة، (مِنَ اللَّهِ) متعلقان بالخبر.\n(وَرَسُولِهِ) عطف.\n(إِلَى النَّاسِ) متعلقان بالخبر، وكذلك الظرف (يَوْمَ) متعلق به.\n(الْحَجِّ) مضاف إليه.\n(الْأَكْبَرِ) صفة.\n(أَنَّ اللَّهَ بَرِي ءٌ) أن ولفظ الجلالة اسمها وبريء خبرها.\n(مِنَ الْمُشْرِكِينَ) متعلقان ببري ء، والمصدر المؤول من أن واسمها وخبرها في محل جر بالباء، والجار والمجرور متعلقان بأذان.\n(وَرَسُولِهِ) مبتدأ وخبره محذوف أي ورسوله بريء.. والجملة معطوفة (فَإِنْ) حرف شرط جازم، والفاء استئنافية.\n(تُبْتُمْ) فعل ماض مبني على السكون لاتصاله بتاء الفاعل. وهو في محل جزم فعل الشرط، والتاء فاعل، والجملة مستأنفة لا محل لها.\n(فَهُوَ) الفاء رابطة وهم ضمير رفع منفصل مبتدأ.\n(خَيْرٌ) خبره.\n(لَكُمْ) متعلقان بالخبر، والجملة في محل جزم جواب الشرط.\n(وَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا) تعرب كسابقتها.\n(أَنَّكُمْ) أن والكاف اسمها.\n(غَيْرُ) خبر.. وأن واسمها وخبرها سد مسد مفعولي (اعلموا).\n(مُعْجِزِي) مضاف إليه (اللَّهِ) لفظ الجلالة مضاف إليه.\n(وَبَشِّرِ) فعل أمر والفاعل أنت (الَّذِينَ) اسم الموصول مفعوله، (كَفَرُوا بِعَذابٍ) متعلقان بالفعل كفروا والجملة صلة الموصول.\n(أَلِيمٍ) صفة والجملة معطوفة.","surah_id":9,"source_id":7},{"ayah_number":4,"text":"(إِلَّا) أداة استثناء.\n(الَّذِينَ) اسم موصول مبني على الفتح في محل نصب على الاستثناء.\n(عاهَدْتُمْ) فعل ماض وفاعله والجملة صلة الموصول.\n(مِنَ الْمُشْرِكِينَ) متعلقان بمحذوف حال.\n(ثُمَّ) حرف عطف.\n(لَمْ) حرف نفي وجزم وقلب.\n(يَنْقُصُوكُمْ) مضارع مجزوم والواو فاعله والكاف مفعوله.\n(شَيْئاً) مفعوله الثاني والجملة معطوفة ومثلها جملة (وَلَمْ يُظاهِرُوا عَلَيْكُمْ أَحَداً).\n(فَأَتِمُّوا إِلَيْهِمْ عَهْدَهُمْ) الجملة معطوفة.\n(إِلى مُدَّتِهِمْ) متعلقان بمحذوف حال.\n(إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها والجملة الفعلية (يُحِبُّ الْمُتَّقِينَ) خبرها، والجملة الاسمية تعليلية أو مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":5,"text":"(فَإِذَا) ظرف لما يستقبل من الزمان، خافض لشرطه منصوب بجوابه والفاء استئنافية.\n(انْسَلَخَ الْأَشْهُرُ) فعل ماض وفاعل.\n(الْحُرُمُ) صفة.\n(فَاقْتُلُوا) فعل أمر مبني على حذف النون، والواو فاعل والجملة لا محل لها جواب شرط غير جازم.\n(الْمُشْرِكِينَ) مفعول به منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم.\n(حَيْثُ) ظرف مكان مبني على الضم في محل نصب متعلق باقتلوا.\n(وَجَدْتُمُوهُمْ) فعل ماض مبني على السكون لاتصاله بتاء الفاعل والتاء ضمير في محل رفع فاعل. وقد أشبعت ضمة الميم.\n(وَخُذُوهُمْ) أمر وفاعله ومفعوله والجملة معطوفة.\n(وَاحْصُرُوهُمْ) الجملة معطوفة.\n(وَاقْعُدُوا) الجملة معطوفة (لَهُمْ) متعلقان بالفعل.\n(كُلَّ) مفعول مطلق (مَرْصَدٍ) مضاف إليه (فَإِنْ) إن شرطية (تابُوا) ماض وفاعله (وَأَقامُوا الصَّلاةَ وَآتَوُا الزَّكاةَ) الجملة معطوفة.\n(فَخَلُّوا) الفاء رابطة والجملة في محل جزم جواب الشرط (سَبِيلَهُمْ) مفعول به (إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ) إن ولفظ الجلالة اسمها وغفور رحيم خبراها.","surah_id":9,"source_id":7},{"ayah_number":6,"text":"(وَإِنْ) حرف شرط جازم، والواو للاستئناف.\n(أَحَدٌ) فاعل لفعل محذوف يفسره الفعل المذكور بعده.\n(مِنَ الْمُشْرِكِينَ) متعلقان بمحذوف صفة أحد.\n(اسْتَجارَكَ) فعل ماض ومفعوله والفاعل هو، والجملة تفسيرية لا محل لها.\n(فَأَجِرْهُ) فعل أمر مبني على السكون فاعله أنت، والهاء مفعوله والفاء رابطة لجواب الشرط والجملة في محل جزم جواب الشرط.\n(حَتَّى) حرف غاية وجر.\n(يَسْمَعَ) مضارع منصوب بأن المضمرة بعد حتى، والمصدر المؤول من حتى والفعل في محل جر بحتى، والجار والمجرور متعلقان بالفعل أجره.\n(كَلامَ) مفعول به.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(ثُمَّ) حرف عطف.\n(أَبْلِغْهُ) فعل أمر فاعله مستتر والهاء مفعوله الأول، و(مَأْمَنَهُ) مفعوله الثاني والجملة معطوفة.\n(ذلِكَ) اسم إشارة في محل رفع مبتدأ، واللام للبعد والكاف للخطاب.\n(بِأَنَّهُمْ) أن والهاء اسمها و(قَوْمٌ) خبرها. وجملة (لا يَعْلَمُونَ) في محل رفع صفة لقوم. والمصدر المؤول من أن واسمها وخبرها في محل جر بالباء، والجار والمجرور متعلقان بمحذوف خبر.","surah_id":9,"source_id":7},{"ayah_number":7,"text":"(كَيْفَ) اسم استفهام مبني على الفتح في محل نصب حال.\n(يَكُونُ) مضارع تام مرفوع.\n(لِلْمُشْرِكِينَ) متعلقان بالفعل.\n(عَهْدٌ) فاعل.\n(عِنْدَ) ظرف مكان متعلق بالفعل.\n(اللَّهِ) لفظ الجلالة مضاف إليه (وَعِنْدَ) عطف.\n(رَسُولِهِ) مضاف إليه. ويمكن إعراب يكون فعل مضارع ناقص واسم الاستفهام كيف خبرها المقدم.\n(لِلْمُشْرِكِينَ) متعلقان بمحذوف حال من عهد كان صفة له فلما تقدم عليه صار حالا.\n(عِنْدَ) ظرف مكان متعلق بمحذوف صفة لعهد.\n(إِلَّا) أداة استثناء.\n(الَّذِينَ) اسم موصول في محل نصب على الاستثناء.\n(عاهَدْتُمْ) فعل ماض والتاء فاعل.\n(عِنْدَ) متعلق بالفعل.\n(الْمَسْجِدِ) مضاف إليه.\n(الْحَرامِ) صفة والجملة صلة الموصول.\n(فَمَا) الفاء استئنافية.\n(ما) شرطية مبتدأ خبره جملتا الشرط (اسْتَقامُوا) ماض وفاعله والفعل في محل جزم فعل الشرط (لَكُمْ) متعلقان بالفعل (فَاسْتَقِيمُوا) الفاء رابطة وفعل أمر وفاعله والجملة في محل جزم جواب الشرط (إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها. وجملة (يُحِبُّ الْمُتَّقِينَ) خبرها.","surah_id":9,"source_id":7},{"ayah_number":8,"text":"(كَيْفَ) اسم استفهام في محل نصب حال لفعل محذوف أي كيف تعاهدونهم..؟ وإن الواو حالية وإن شرطية.\n(يَظْهَرُوا) مضارع مجزوم وعلامة جزمه حذف النون والواو فاعل.\n(عَلَيْكُمْ) متعلقان بالفعل، والجملة استئنافية.\n(لا يَرْقُبُوا) مضارع مجزوم جواب الشرط، ولا نافية.\n(فِيكُمْ) متعلقان بالفعل، والجملة لا محل لها جواب شرط لم يقترن بإذا أو الفاء.\n(إِلًّا) مفعول به.\n(وَلا) الواو عاطفة.\n(ذِمَّةً) اسم معطوف.\n(يُرْضُونَكُمْ) مضارع مرفوع بثبوت النون والواو فاعل والكاف مفعوله والميم لجمع الذكور.\nوالجملة مستأنفة.\n(بِأَفْواهِهِمْ) متعلقان بالفعل (وَتَأْبى قُلُوبُهُمْ) الجملة معطوفة.\n(وَأَكْثَرُهُمْ فاسِقُونَ) مبتدأ وخبر والجملة في محل نصب حال.","surah_id":9,"source_id":7},{"ayah_number":9,"text":"(اشْتَرَوْا بِآياتِ) فعل ماض تعلق به الجار والمجرور والواو فاعل (اللَّهِ) لفظ الجلالة مضاف إليه (ثَمَناً) مفعول به.\n(قَلِيلًا) صفة. والجملة مستأنفة.\n(فَصَدُّوا عَنْ سَبِيلِهِ) الجملة معطوفة.\n(إِنَّهُمْ) إن والهاء اسمها.\n(ساءَ) فعل ماض واسم الموصول (ما) فاعله ومفعوله محذوف أي ساءهم.. وجملة ساء في محل رفع خبر إن. ويمكن إعراب ساء فعل ماض جامد مثل بئس وفاعله محذوف يفسره الفعل المذكور بعده. و(ما) نكرة موصوفة مبنية على السكون.\n(كانُوا) كان واسمها وجملة (يَعْمَلُونَ) خبرها. وجملة كانوا صلة الموصول على إعراب ما اسم موصول. وجملة إنهم ساء.. مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":10,"text":"تقدم إعرابها قبل آيتين.\n(هُمُ) ضمير فصل أو ضمير رفع مبتدأ ثان و(الْمُعْتَدُونَ) خبره والجملة الاسمية (هُمُ الْمُعْتَدُونَ) خبر اسم الإشارة.","surah_id":9,"source_id":7},{"ayah_number":11,"text":"(فَإِنْ تابُوا) إن شرطية وجملة فعل الشرط ابتدائية لا محل لها، والجمل الفعلية بعدها (وَأَقامُوا الصَّلاةَ وَآتَوُا الزَّكاةَ) معطوفة.\n(فَإِخْوانُكُمْ) خبر لمبتدأ محذوف تقديره فهم إخوانكم.\n(فِي الدِّينِ) متعلقان بمحذوف حال من إخوانكم، والجملة الاسمية في محل جزم جواب الشرط.\n(وَنُفَصِّلُ) مضارع.\n(الْآياتِ) مفعول به منصوب وعلامة نصبه الكسرة لأنه جمع مؤنث سالم والفاعل ضمير مستتر تقديره نحن والجملة مستأنفة.\n(لِقَوْمٍ) متعلقان بالفعل.\n(يَعْلَمُونَ) الجملة في محل جر صفة لقوم.","surah_id":9,"source_id":7},{"ayah_number":12,"text":"(وَإِنْ نَكَثُوا) إن شرطية وفعل ماض وفاعله وهو في محل جزم فعل الشرط.\n(أَيْمانَهُمْ) مفعوله.\n(مِنْ بَعْدِ) متعلقان بمحذوف حال من أيمانهم.\n(عَهْدِهِمْ) مضاف إليه.\n(وَطَعَنُوا) فعل ماض وفاعل.\n(فِي دِينِكُمْ) متعلقان بالفعل والجملة معطوفة.\n(فَقاتِلُوا أَئِمَّةَ الْكُفْرِ) الفاء رابطة والجملة في محل جزم جواب الشرط.\n(إِنَّهُمْ) إن والهاء اسمها.\n(لا أَيْمانَ) لا نافية للجنس.\n(أَيْمانَ) اسمها مبني على الفتح.\n(لَهُمْ) متعلقان بمحذوف خبر. والجملة في محل رفع خبر إن.\n(لَعَلَّهُمْ) لعل واسمها وجملة (يَنْتَهُونَ) خبرها والجملة الاسمية لعلهم.. تعليلية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":13,"text":"(أَلا) أداة حض.\n(تُقاتِلُونَ) فعل مضارع وفاعل و(قَوْماً) مفعول به والجملة مستأنفة. وجملة (نَكَثُوا أَيْمانَهُمْ) في محل نصب صفة.\n(وَهَمُّوا) الجملة الفعلية معطوفة.\n(بِإِخْراجِ) متعلقان بالفعل.\n(الرَّسُولِ) مضاف إليه.\n(وَهُمْ) ضمير منفصل في محل رفع مبتدأ، والواو عاطفة.\n(بَدَؤُكُمْ) فعل ماض وفاعل ومفعول به والجملة في محل رفع خبر المبتدأ.\n(أَوَّلَ) ظرف زمان متعلق بالفعل.\n(مَرَّةٍ) مضاف إليه.\n(أَتَخْشَوْنَهُمْ) فعل مضارع مرفوع بثبوت النون، والواو فاعل والهاء مفعول به، والهمزة للاستفهام، والجملة مستأنفة.\n(فَاللَّهُ) لفظ الجلالة مبتدأ والفاء استئنافية.\n(أَحَقُّ) خبر.\n(أَنْ) حرف ناصب (تَخْشَوْهُ) مضارع منصوب بأن والواو فاعله والهاء مفعوله والمصدر المؤول من أن والفعل في محل جر بالباء المحذوفة ومتعلقان بأحق أي اللّه أحق بالخشية.\n(أَنْ) شرطية.\n(كُنْتُمْ) كان واسمها.\n(مُؤْمِنِينَ) خبرها منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم، والجملة ابتدائية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":14,"text":"(قاتِلُوهُمْ) فعل أمر مبني على حذف النون، والواو فاعله، والهاء مفعوله.\n(يُعَذِّبْهُمُ) مضارع مجزوم لأنه جواب الأمر، والهاء مفعوله (اللَّهُ) لفظ الجلالة فاعله.\n(بِأَيْدِيكُمْ) أيديكم اسم مجرور بالباء وعلامة جره الكسرة المقدرة على الياء والكاف في محل جر بالإضافة. والميم علامة جمع الذكور. والجار والمجرور متعلقان بالفعل، والجملة لا محل لها جواب شرط لم يقترن بالفاء أو بإذا الفجائية.\n(وَيُخْزِهِمْ) مضارع معطوف على يعذبهم مجزوم وعلامة جزمه حذف حرف العلة وهو الياء، والهاء مفعول به، والجملة معطوفة. وكذلك جملة (يَنْصُرْكُمْ عَلَيْهِمْ) وجملة (يَشْفِ صُدُورَ).\n(وَيَشْفِ) مضارع مجزوم بحذف حرف العلة (صُدُورَ) مفعول به (قَوْمٍ) مضاف إليه.\n(مُؤْمِنِينَ) صفة للقوم مجرور بالياء لأنه جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":15,"text":"(وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ) الجملة معطوفة.\n(وَيَتُوبُ اللَّهُ) مضارع ولفظ الجلالة فاعل والواو للاستئناف والجملة مستأنفة.\n(عَلى مَنْ) من اسم موصول مبني على السكون في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل يتوب.\n(يَشاءُ) مضارع والفاعل ضمير مستتر تقديره هو والجملة صلة الموصول لا محل لها. و(اللَّهُ) لفظ الجلالة مبتدأ، والواو للاستئناف.\n(عَلِيمٌ) خبر أول.\n(حَكِيمٌ) خبر ثان والجملة الاسمية مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":16,"text":"(أَمْ) حرف عطف يفيد الإضراب.\n(حَسِبْتُمْ) فعل ماض مبني على السكون والتاء فاعل.\n(أَنْ) حرف ناصب.\n(تُتْرَكُوا) مضارع مبني للمجهول منصوب وعلامة نصبه حذف النون، والواو نائب فاعل، والمصدر المؤول من أن والفعل سد مسد مفعولي حسب.\n(وَلَمَّا) الواو حالية.\n(لَمَّا) حرف جازم.\n(يَعْلَمِ) مضارع مجزوم وعلامة جزمه السكون، وحرك بالكسر منعا لالتقاء الساكنين.\n(اللَّهُ) لفظ الجلالة فاعله.\n(الَّذِينَ) اسم موصول مفعوله، والجملة في محل نصب حال، وجملة (جاهَدُوا مِنْكُمْ) صلة الموصول.\n(وَلَمْ يَتَّخِذُوا) مضارع مجزوم والواو فاعل.\n(مِنْ دُونِ) متعلقان بالفعل.\n(اللَّهُ) لفظ الجلالة مضاف إليه.\n(وَلا رَسُولِهِ) اسم معطوف.\n(وَلَا الْمُؤْمِنِينَ) عطف.\n(وَلِيجَةً) مفعول به، والجملة معطوفة.\n(وَاللَّهُ خَبِيرٌ) الجملة مستأنفة.\n(بِما تَعْمَلُونَ) المصدر المؤول بخبير أو ما موصولة والجملة صلة.","surah_id":9,"source_id":7},{"ayah_number":17,"text":"(ما كانَ) ما نافية وكان فعل ماض ناقص.\n(لِلْمُشْرِكِينَ) متعلقان بمحذوف خبر كان.\n(أَنْ يَعْمُرُوا) المصدر المؤول من أن والفعل في محل رفع اسم كان.\n(مَساجِدَ) مفعول به.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(شاهِدِينَ) حال منصوبة وعلامة نصبه الياء لأنه جمع مذكر سالم.\n(عَلى أَنْفُسِهِمْ) متعلقان باسم الفاعل شاهدين، وكذلك (بِالْكُفْرِ) متعلقان باسم الفاعل.\n(أُولئِكَ) اسم إشارة في محل رفع مبتدأ.\n(حَبِطَتْ أَعْمالُهُمْ) فعل ماض وفاعله والجملة في محل رفع خبر.\n(وَفِي النَّارِ) متعلقان بالخبر خالدون.\n(هُمْ خالِدُونَ) مبتدأ وخبر والجملة الاسمية معطوفة، وجملة أولئك.. استئنافية.","surah_id":9,"source_id":7},{"ayah_number":18,"text":"(إِنَّما) كافة ومكفوفة.\n(يَعْمُرُ) فعل مضارع و(مَساجِدَ) مفعوله (اللَّهِ) لفظ الجلالة مضاف إليه (مَنْ) اسم الموصول فاعله، والجملة مستأنفة. وجملة (آمَنَ بِاللَّهِ) صلة الموصول لا محل لها.\n(وَالْيَوْمِ الْآخِرِ) عطف (وَأَقامَ الصَّلاةَ وَآتَى الزَّكاةَ وَلَمْ يَخْشَ إِلَّا اللَّهَ) جمل معطوفة. ويخش مضارع مجزوم بحذف حرف العلة فاعله هو.\n(إِلَّا) أداة حصر.\n(اللَّهِ) مفعول به.\n(فَعَسى) الفاء هي الفصيحة.\n(عسى) فعل ماض جامد، يرفع الاسم وينصب الخبر.\n(أُولئِكَ) اسم إشارة مبني على الكسر في محل رفع اسمها.\n(أَنْ يَكُونُوا) مضارع ناقص منصوب بأن وعلامة نصبه حذف النون والواو اسمها.\n(مِنَ الْمُهْتَدِينَ) متعلقان بمحذوف خبر الفعل الناقص يكونوا. والمصدر المؤول من أن والفعل في محل نصب خبر الفعل عسى، وجملة فعسى.. لا محل لها جواب شرط غير جازم مقدر.","surah_id":9,"source_id":7},{"ayah_number":19,"text":"(أَجَعَلْتُمْ) فعل ماض، والتاء فاعل، والهمزة للاستفهام.\n(سِقايَةَ) مفعول به للفعل جعل.\n(الْحاجِّ) مضاف إليه.\n(وَعِمارَةَ) عطف على سقاية.\n(الْمَسْجِدِ) مضاف إليه.\n(الْحَرامِ) صفة.\n(كَمَنْ) الكاف اسم بمعنى مثل في محل نصب مفعول به ثان وهو مضاف.\n(من) اسم موصول مبني على السكون في محل جر بالإضافة أي: أجعلتم سقاية الحاج.. مثل الإيمان بالله..؟ وجملة (آمَنَ) صلة الموصول، (بِاللَّهِ) لفظ الجلالة في محل جر متعلقان بآمن (وَالْيَوْمِ الْآخِرِ) عطف. وجملة (وَجاهَدَ فِي سَبِيلِ اللَّهِ) معطوفة عليها.\n(لا يَسْتَوُونَ) مضارع مرفوع بثبوت النون تعلق به الظرف (عِنْدَ) والواو فاعله، ولا نافية، (اللَّهِ) لفظ الجلالة مضاف إليه والجملة مستأنفة.\n(وَاللَّهُ) لفظ الجلالة مبتدأ وجملة (لا يَهْدِي الْقَوْمَ الظَّالِمِينَ) خبره والجملة الاسمية (وَاللَّهُ لا يَهْدِي) مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":20,"text":"(الَّذِينَ) اسم موصول مبتدأ.\n(آمَنُوا) فعل ماض وفاعل والجملة صلة الموصول وما بعدها معطوف.\n(أَعْظَمُ) خبر المبتدأ والجملة الاسمية مستأنفة.\n(دَرَجَةً) تمييز.\n(عِنْدَ) ظرف مكان متعلق بأعظم.\n(اللَّهِ) لفظ الجلالة مضاف إليه وجملة (وَأُولئِكَ هُمُ الْفائِزُونَ) مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":21,"text":"(يُبَشِّرُهُمْ) مضارع والهاء مفعوله و(رَبُّهُمْ) فاعله، (بِرَحْمَةٍ) متعلقان بالفعل.\n(مِنْهُ) متعلقان بمحذوف صفة رحمة، والجملة الفعلية في محل نصب حال.\n(وَرِضْوانٍ وَجَنَّاتٍ) عطف.\n(لَهُمْ فِيها) متعلقان بمحذوف خبر.\n(نَعِيمٌ) مبتدأ مؤخر.\n(مُقِيمٌ) صفة. والجملة الاسمية في محل جر صفة لجنات.","surah_id":9,"source_id":7},{"ayah_number":22,"text":"(خالِدِينَ) حال منصوبة بالياء لأنه جمع مذكر سالم.\n(فِيها)جملة (عِنْدَهُ أَجْرٌ عَظِيمٌ) في محل رفع خبر أن.\nوجملة إن الله عنده.. مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":23,"text":"(يا أَيُّهَا) منادى نكرة مقصودة مبنية على الضم. وها للتنبيه.\n(الَّذِينَ) اسم موصول في محل رفع بدل.\n(آمَنُوا) فعل ماض وفاعل والجملة صلة الموصول.\n(لا تَتَّخِذُوا) مضارع مجزوم بلا الناهية وعلامة جزمه حذف النون، والواو فاعل.\n(آباءَكُمْ) مفعول به والكاف في محل جر بالإضافة، والميم علامة جمع الذكور.\n(وَإِخْوانَكُمْ) عطف.\n(أَوْلِياءَ) مفعول به ثان، والجملة الفعلية ابتدائية لا محل لها.\n(إِنِ) حرف شرط جازم.\n(اسْتَحَبُّوا) فعل ماض وفاعله وهو في محل جزم فعل الشرط.\n(الْكُفْرَ) مفعوله.\n(عَلَى الْإِيمانِ) متعلقان بالفعل وجملة الشرط لا محل لها ابتدائية، وجواب الشرط محذوف أي إن استحبوا الكفر على الإيمان فلا تتخذوهم أولياء.\n(وَمَنْ) اسم شرط جازم في محل رفع مبتدأ، والواو للاستئناف.\n(يَتَوَلَّهُمْ) مضارع فعل الشرط مجزوم بحذف حرف العلة وهو الألف والهاء ضمير متصل في محل نصب مفعول به والميم لجمع الذكور.\n(مِنْكُمْ) متعلقان بالفعل، والجملة الاسمية من يتولهم مستأنفة.\n(فَأُولئِكَ) اسم إشارة مبتدأ.\n(هُمُ) ضمير فصل.\n(الظَّالِمُونَ) خبر. والجملة الاسمية في محل جزم جواب الشرط، وجملة فعل الشرط وجوابه في محل رفع خبر المبتدأ (من).","surah_id":9,"source_id":7},{"ayah_number":24,"text":"(قُلْ) فعل أمر والفاعل ضمير مستتر تقديره أنت.\n(إِنْ) حرف شرط جازم.\n(كانَ) فعل ماض ناقص.\n(آباؤُكُمْ) اسمها مرفوع وعلامة رفعه الضمة.\n(وَأَبْناؤُكُمْ وَإِخْوانُكُمْ وَأَزْواجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوالٌ) عطف.\n(اقْتَرَفْتُمُوها) فعل ماض مبني على السكون، والتاء فاعل والهاء مفعول به والواو بسبب إشباع ضمة الميم، والجملة في محل رفع صفة.\n(وَتِجارَةٌ) عطف على أموال.\n(تَخْشَوْنَ) مضارع مرفوع بثبوت النون والواو فاعل.\n(كَسادَها) مفعول به، والهاء في محل جر بالإضافة والجملة في محل رفع صفة ومثل ذلك (وَمَساكِنُ تَرْضَوْنَها).\n(أَحَبَّ) خبر كان.\n(إِلَيْكُمْ) متعلقان باسم التفضيل أحب وكذلك (مِنَ اللَّهِ) متعلقان به.\n(وَرَسُولِهِ وَجِهادٍ) عطف.\n(فِي سَبِيلِهِ) متعلقان بالمصدر جهاد.\n(فَتَرَبَّصُوا) فعل أمر مبني على حذف النون، والواو فاعل، والفاء رابطة لجواب الشرط والجملة في محل جزم جواب الشرط.\n(حَتَّى) حرف غاية وجر (يَأْتِيَ) مضارع منصوب بأن المضمرة بعد حتى، والمصدر المؤول من حتى والفعل في محل جر بحتى، والجار والمجرور متعلقان بالفعل.\n(اللَّهِ) لفظ الجلالة فاعل.\n(بِأَمْرِهِ) متعلقان بيأتي.\n(وَاللَّهُ لا يَهْدِي الْقَوْمَ الْفاسِقِينَ) سبق إعراب مثلها.","surah_id":9,"source_id":7},{"ayah_number":25,"text":"(لَقَدْ) اللام واقعة في جواب القسم المحذوف. قد حرف تحقيق.\n(نَصَرَكُمُ) فعل ماض ومفعوله.\n(اللَّهُ) لفظ الجلالة فاعل.\n(فِي مَواطِنَ) اسم مجرور بالفتحة نيابة عن الكسرة ممنوع من الصرف على وزن مفاعل صيغة منتهى الجموع. والجار والمجرور متعلقان بالفعل.\n(كَثِيرَةٍ) صفة مجرورة بالكسرة.\n(وَيَوْمَ) ظرف زمان متعلق بفعل محذوف تقديره ونصركم يوم حنين والجملة المقدرة معطوفة.\n(حُنَيْنٍ) مضاف إليه مجرور بالكسرة على أنه غير ممنوع من الصرف.\n(إِذْ) ظرف زمان مبني على السكون في محل نصب على البدلية من يوم.\n(أَعْجَبَتْكُمْ) فعل ماض والتاء للتأنيث والكاف في محل نصب مفعول به. والميم لجمع الذكور.\n(كَثْرَتُكُمْ) فاعل.\n(فَلَمْ) لم حرف نفي وجزم وقلب، والفاء عاطفة.\n(تُغْنِ) مضارع مجزوم وعلامة جزمه حذف حرف العلة الياء. والفاعل ضمير مستتر تقديره هي.\n(عَنْكُمْ) متعلقان بالفعل.\n(شَيْئاً) مفعول به أو نائب مفعول مطلق. والجملة معطوفة.\n(وَضاقَتْ) فعل ماض تعلق به الجار والمجرور (عَلَيْكُمُ) والتاء للتأنيث، و(الْأَرْضُ) فاعل والجملة معطوفة.\n(بِما) ما مصدرية مؤولة مع الفعل بعدها بمصدر في محل جر بالباء (رَحُبَتْ) الجملة صلة، والجار والمجرور متعلقان بضاقت.\n(ثُمَّ) عاطفة.\n(وَلَّيْتُمْ) فعل ماض والتاء فاعل.\n(مُدْبِرِينَ) حال منصوبة وعلامة نصبه الياء لأنه جمع مذكر سالم، والجملة معطوفة على ما قبلها.","surah_id":9,"source_id":7},{"ayah_number":26,"text":"(ثُمَّ) عاطفة (أَنْزَلَ اللَّهُ سَكِينَتَهُ) فعل ماض وفاعله ومفعوله والجار والمجرور (عَلى رَسُولِهِ) والجار والمجرور (وَعَلَى الْمُؤْمِنِينَ) عطف، و(اللَّهُ) لفظ الجلالة فاعله، (سَكِينَتَهُ) مفعوله والجملة معطوفة ومثلها جملة (وَأَنْزَلَ جُنُوداً) معطوفة.\n(لَمْ) جازمة.\n(تَرَوْها) مضارع مجزوم بحذف النون، والواو فاعل والهاء مفعول به والجملة في محل نصب صفة. و(عَذَّبَ الَّذِينَ) فعل ماض ومفعول به والفاعل ضمير مستتر تقديره هو والجملة معطوفة وجملة (كَفَرُوا) صلة الموصول لا محل لها.\n(وَذلِكَ) اسم إشارة مبني على السكون في محل رفع مبتدأ، واللام للبعد والكاف للخطاب.\n(جَزاءُ) خبر.\n(الْكافِرِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم، والجملة الاسمية مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":27,"text":"(ثُمَّ يَتُوبُ اللَّهُ) الجملة معطوفة (مِنْ بَعْدِ) متعلقان بالفعل.\n(ذلِكَ) اسم الإشارة في محل جر بالإضافة (عَلى) حرف جر (مِنْ) اسم موصول في محل جر بحرف الجر والجار والمجرور متعلقان بيتوب وجملة (يَشاءُ) صلة الموصول، (وَاللَّهُ غَفُورٌ رَحِيمٌ) مبتدأ وخبراه والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":28,"text":"(يا أَيُّهَا الَّذِينَ آمَنُوا) تكرر إعرابها فيما سبق.\n(إِنَّمَا) كافة ومكفوفة.\n(الْمُشْرِكُونَ نَجَسٌ) مبتدأ وخبر والجملة ابتدائية.\n(فَلا يَقْرَبُوا) مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل. ولا ناهية جازمة، والفاء قبلها هي الفصيحة.\n(الْمَسْجِدَ) مفعول به.\n(الْحَرامَ) صفة.\n(بَعْدَ) ظرف زمان متعلق بالفعل.\n(عامِهِمْ) مضاف إليه والهاء في محل جر بالإضافة.\n(هذا) اسم إشارة مبني على السكون في محل جر صفة، والجملة الفعلية لا محل لها لأنها جواب شرط مقدر.\n(وَإِنْ) الواو استئنافية.\n(إِنْ) شرطية جازمة.\n(خِفْتُمْ عَيْلَةً) فعل ماض مبني على السكون لاتصاله بتاء الفاعل المتحركة، والتاء ضمير متصل مبني على الضم في محل رفع فاعل والميم لجمع الذكور وعيلة مفعوله، والفعل في محل جزم فعل الشرط، وجملة فعل الشرط ابتدائية.\n(فَسَوْفَ) حرف استقبال والفاء رابطة لجواب الشرط.\n(يُغْنِيكُمُ) مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل. والكاف ضمير متصل في محل نصب مفعول به. والميم لجمع الذكور.\n(اللَّهُ) لفظ الجلالة فاعل.\n(مِنْ فَضْلِهِ) متعلقان بالفعل، والجملة في محل جزم جواب الشرط.\n(إِنْ) حرف شرط جازم.\n(شاءَ) فعل ماض في محل جزم فعل الشرط، وجواب الشرط محذوف دلّ عليه ما قبله.\n(إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ) إن ولفظ الجلالة اسمها وعليم حكيم خبراها والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":29,"text":"(قاتِلُوا) فعل أمر مبني على حذف النون، والواو فاعل (الَّذِينَ) اسم الموصول مفعول به.\n(لا يُؤْمِنُونَ) مضارع مرفوع بثبوت النون، والواو فاعله (بِاللَّهِ) متعلقان بالفعل.\n(وَلا بِالْيَوْمِ الْآخِرِ) عطف.\n(وَلا يُحَرِّمُونَ ما) فعل وفاعل واسم الموصول ما مفعوله والجملة الفعلية معطوفة. وجملة (حَرَّمَ اللَّهُ وَرَسُولُهُ) صلة الموصول.\n(وَلا يَدِينُونَ) مضارع والواو فاعله (دِينَ) اسم منصوب بنزع الخافض أو مفعول به على تضمين معنى يدينون يعتنقون.\n(الْحَقِّ) مضاف إليه.\n(مِنَ الَّذِينَ) متعلقان بالفعل.\n(أُوتُوا) فعل ماض مبني للمجهول، والواو نائب فاعل وهو المفعول الأول (الْكِتابَ) هو المفعول الثاني، والجملة صلة الموصول.\n(حَتَّى) حرف غاية وجر.\n(يُعْطُوا) مضارع منصوب والمصدر من حتى والفعل في محل جر بحرف الجر، والجار والمجرور متعلقان بقاتلوا.\n(الْجِزْيَةَ) مفعول به (عَنْ يَدٍ) متعلقان بمحذوف حال.\n(وَهُمْ صاغِرُونَ) مبتدأ وخبر والجملة في محل نصب حال.","surah_id":9,"source_id":7},{"ayah_number":30,"text":"(وَقالَتِ الْيَهُودُ) فعل ماض وفاعل والتاء للتأنيث، وحركت بالكسر منعا لالتقاء الساكنين، والجملة مستأنفة.\n(عُزَيْرٌ) مبتدأ.\n(ابْنُ) خبره.\n(اللَّهِ) لفظ الجلالة مضاف إليه، والجملة مقول القول.\n(وَقالَتِ النَّصارى الْمَسِيحُ ابْنُ اللَّهِ).. معطوفة. واعرابها كسابقتها.\n(ذلِكَ) اسم إشارة مبني على السكون في محل رفع مبتدأ، واللام للبعد والكاف للخطاب.\n(قَوْلُهُمْ) خبره.\n(بِأَفْواهِهِمْ) متعلقان بالخبر لأنه مصدر، والجملة الاسمية مستأنفة.\n(يُضاهِؤُنَ قَوْلَ) فعل مضارع وفاعل ومفعول به.\n(الَّذِينَ) اسم موصول في محل جر بالإضافة.\n(كَفَرُوا) الجملة صلة، وجملة يضاهئون مستأنفة.\n(مِنْ قَبْلُ) متعلقان بمحذوف حال.\n(قاتَلَهُمُ اللَّهُ) فعل ماض ومفعوله ولفظ الجلالة فاعله والجملة مستأنفة.\n(أَنَّى) اسم استفهام مبني على السكون في محل نصب حال.\n(يُؤْفَكُونَ) مضارع مبني للمجهول مرفوع وعلامة رفعه ثبوت النون، والواو نائب فاعل، والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":31,"text":"(اتَّخَذُوا أَحْبارَهُمْ وَرُهْبانَهُمْ أَرْباباً) فعل ماض وفاعله ومفعولاه والجملة مستأنفة.\n(مِنْ دُونِ) متعلقان بمحذوف صفة أربابا.\n(اللَّهِ) لفظ الجلالة مضاف إليه (وَالْمَسِيحَ) عطف على رهبانهم.\n(ابْنَ) صفة منصوبة.\n(مَرْيَمَ) مضاف إليه مجرور وعلامة جره الفتحة نيابة عن الكسرة، ممنوع من الصرف للعلمية والتأنيث.\n(وَما) الواو حالية. وما نافية.\n(أُمِرُوا) فعل ماض مبني للمجهول والواو نائب فاعل، والجملة في محل نصب حال.\n(إِلَّا) أداة حصر.\n(لِيَعْبُدُوا) مضارع منصوب والواو فاعله. والمصدر المؤول من أن المضمرة بعد لام التعليل والفعل في محل جر باللام، والجار والمجرور متعلقان بالفعل.\n(إِلهاً) مفعول به.\n(واحِداً) صفة.\n(لا إِلهَ) لا نافية للجنس.\n(إِلهَ) اسمها المبني على الفتح وخبرها محذوف أي موجود.\n(إِلَّا) أداة حصر.\n(هُوَ) بدل من إله على المحل والجملة في محل نصب صفة ثانية لإله.\n(سُبْحانَهُ) مفعول مطلق منصوب والهاء ضمير متصل في محل جر بالإضافة.\n(عَمَّا) ما مصدرية مؤولة مع الفعل المضارع (يُشْرِكُونَ) بعدها بمصدر مؤول في محل جر بحرف الجر، والجار والمجرور متعلقان بالمصدر سبحانه. أو ما اسم موصول والجملة صلة الموصول بعده.","surah_id":9,"source_id":7},{"ayah_number":32,"text":"(يُرِيدُونَ) مضارع مرفوع بثبوت النون، والواو فاعله، والمصدر المؤول من (أَنْ) الناصبة والفعل (يُطْفِؤُا) في محل نصب مفعول به، والجملة الفعلية في محل نصب حال.\n(نُورَ) مفعول به.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(بِأَفْواهِهِمْ) متعلقان بالفعل.\n(وَيَأْبَى اللَّهُ) مضارع وفاعله والجملة معطوفة.\n(إِلَّا) أداة حصر. والمصدر المؤول من (أَنْ) والفعل (يُتِمَّ) في محل نصب مفعول به.\n(نُورَهُ) مفعول به.\n(وَلَوْ) الواو حالية. لو شرطية.\n(كَرِهَ الْكافِرُونَ) فعل ماض وفاعله والجملة ابتدائية، وجواب الشرط محذوف أي ولو كره الكافرون سيتم الله نوره.","surah_id":9,"source_id":7},{"ayah_number":33,"text":"(هُوَ الَّذِي) ضمير منفصل في محل رفع مبتدأ واسم الموصول بعده خبره.\n(أَرْسَلَ رَسُولَهُ بِالْهُدى) فعل ماض تعلق به الجار والمجرور ورسول مفعوله والهاء مضاف إليه وفاعله ضميره مستتر والجملة صلة الموصول.\n(وَدِينِ) عطف على الهدى.\n(الْحَقِّ) مضاف إليه.\n(لِيُظْهِرَهُ) المصدر المؤول من أن المضمرة بعد لام التعليل والفعل المضارع في محل جر باللام والجار والمجرور متعلقان بأرسل.\n(عَلَى الدِّينِ) متعلقان بالفعل يظهر.\n(كُلِّهِ) توكيد.\n(وَلَوْ كَرِهَ الْمُشْرِكُونَ) مثل ولو كره الكافرون.","surah_id":9,"source_id":7},{"ayah_number":34,"text":"(يا أَيُّهَا الَّذِينَ آمَنُوا) سبق اعرابها (إِنَّ) حرف مشبه بالفعل (كَثِيراً) اسم إن.\n(مِنَ الْأَحْبارِ) متعلقان بكثيرا.\n(وَالرُّهْبانِ) عطف.\n(لَيَأْكُلُونَ) مضارع مرفوع بثبوت النون، والواو فاعل، واللام هي المزحلقة.\n(أَمْوالَ) مفعول به.\n(النَّاسِ) مضاف إليه (بِالْباطِلِ) متعلقان بمحذوف حال والجملة في محل رفع خبر إن.\n(وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ) الجار والمجرور متعلقان بالفعل ولفظ الجلالة مضاف إليه والجملة معطوفة.\n(وَالَّذِينَ) اسم موصول مبني على الفتح في محل رفع مبتدأ والواو للاستئناف. وجملة (يَكْنِزُونَ) الذهب (وَالْفِضَّةَ) صلة الموصول لا محل لها. وجملة (وَلا يُنْفِقُونَها).. معطوفة.\n(فِي سَبِيلِ اللَّهِ) متعلقان بالفعل ولفظ الجلالة مضاف إليه (فَبَشِّرْهُمْ) فعل أمر والهاء مفعوله والفاء واقعة في جواب اسم الموصول لشبهه بالشرط (بِعَذابٍ) متعلقان بالفعل.\n(أَلِيمٍ) صفة. والجملة الفعلية خبر المبتدأ الذين.","surah_id":9,"source_id":7},{"ayah_number":35,"text":"(يَوْمَ) ظرف مكان متعلق ب (عذاب أليم) أو بفعل اذكر المحذوف.\n(يُحْمى) مضارع مبني للمجهول مرفوع وعلامة رفعه الضمة المقدرة على الألف منع من ظهورها التعذر.\n(عَلَيْها) متعلقان بنائب الفاعل أي يوم تحمى النار عليهم، والجملة في محل جر بالإضافة.\n(فِي نارِ) متعلقان بالفعل.\n(جَهَنَّمَ) مضاف إليه مجرور بالفتحة لأنه ممنوع من الصرف للعلمية والعجمة.\n(فَتُكْوى) مضارع مبني للمجهول تعلق به الجار والمجرور، والفاء عاطفة.\n(جِباهُهُمْ) نائب فاعل.\n(وَجُنُوبُهُمْ وَظُهُورُهُمْ) أسماء معطوفة.\n(هذا ما) اسم إشارة في محل رفع مبتدأ واسم الموصول في محل رفع خبره والجملة الاسمية مقول القول المقدر.\n(كَنَزْتُمْ) فعل ماض والتاء فاعل والميم لجمع الذكور والجملة صلة الموصول لا محل لها.\n(لِأَنْفُسِكُمْ) متعلقان بالفعل.\n(فَذُوقُوا) فعل أمر مبني على حذف النون وفاعله، والفاء هي الفصيحة.\n(ما) اسم موصول في محل نصب مفعول به.\n(كُنْتُمْ) فعل ماض ناقص والتاء اسمها والجملة صلة الموصول وجملة (تَكْنِزُونَ) خبرها.","surah_id":9,"source_id":7},{"ayah_number":36,"text":"(إِنَّ) حرف مشبه بالفعل (عِدَّةَ) اسم إن.\n(الشُّهُورِ) مضاف إليه.\n(عِنْدَ) ظرف مكان متعلق بمحذوف حال من عدة.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(اثْنا) خبر إن مرفوع وعلامة رفعه الألف لأنه مثنى.\n(عَشَرَ) جزء مبني على الفتح لا محل له من الإعراب.\n(شَهْراً) تمييز.\n(فِي كِتابِ) متعلقان بمحذوف صفة اثنا عشر.\n(اللَّهِ) لفظ الجلالة مضاف إليه.\n(يَوْمَ) ظرف زمان متعلق بمحذوف صفة اثنا عشر أو بكتاب على أنه مصدر.\n(خَلَقَ) فعل ماض.\n(السَّماواتِ) مفعوله المنصوب بالكسرة جمع مؤنث سالم.\n(وَالْأَرْضَ) عطف.\n(مِنْها) متعلقان بمحذوف خبر.\n(أَرْبَعَةٌ) مبتدأ.\n(حُرُمٌ) صفة. والجملة الاسمية في محل رفع صفة لاثنا عشر، وجملة خلق في محل جر بالإضافة.\n(ذلِكَ) اسم إشارة مبني على السكون في محل رفع مبتدأ.\n(الدِّينُ) خبر.\n(الْقَيِّمُ) صفة والجملة الاسمية مستأنفة.\n(فَلا) الفاء هي الفصيحة. و(لا) ناهية جازمة.\n(تَظْلِمُوا) مضارع مجزوم والواو فاعل.\n(فِيهِنَّ) متعلقان بالفعل.\n(أَنْفُسَكُمْ) مفعول به والجملة لا محل لها جواب شرط غير جازم.\n(وَقاتِلُوا الْمُشْرِكِينَ) فعل أمر وفاعل ومفعول به.\n(كَافَّةً) حال والجملة معطوفة.\n(كَما يُقاتِلُونَكُمْ) الكاف حرف جر. ما مصدرية، وهي مؤولة مع الفعل المضارع يقاتلونكم بعدها بمصدر في محل جر بالكاف، والجار والمجرور متعلقان بمحذوف صفة لمصدر محذوف. أي قتالا كائنا مثل قتالهم..\n(كَافَّةً) حال (وَاعْلَمُوا) الجملة معطوفة.\n(أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ) مع ظرف تعلق بمحذوف خبر إن. وإن واسمها وخبرها سدت مسد مفعولي اعلموا المتقين مضاف إليه.","surah_id":9,"source_id":7},{"ayah_number":37,"text":"(إِنَّمَا) كافة ومكفوفة.\n(النَّسِي ءُ) مبتدأ.\n(زِيادَةٌ) خبر.\n(فِي الْكُفْرِ) متعلقان بالخبر.\n(يُضَلُّ) مضارع مبني للمجهول تعلق به الجار والمجرور (بِهِ) (الَّذِينَ) اسم موصول نائب فاعل. والجملة في محل نصب حال وجملة كفروا صلة الموصول لا محل لها.\n(يُحِلُّونَهُ) مضارع وفاعله ومفعوله والجملة في محل نصب حال.\n(عاماً) ظرف زمان متعلق بالفعل.\n(وَيُحَرِّمُونَهُ عاماً) عطف (لِيُواطِؤُا) مضارع منصوب بأن المضمرة بعد لام التعليل. والمصدر المؤول من أن المضمرة والفعل في محل جر باللام. والجار والمجرور متعلقان بالفعل قبلهما.\n(عِدَّةَ) مفعول به.\n(ما) اسم موصول مبني على السكون في محل جر بالإضافة، والجملة الفعلية حرم الله صلة الموصول لا محل لها. وجملة (فَيُحِلُّوا ما حَرَّمَ اللَّهُ) معطوفة على جملة ليواطئوا..\n(زُيِّنَ) فعل ماض مبني للمجهول، وسوء نائب فاعل.\n(أَعْمالِهِمْ) مضاف إليه، (لَهُمْ) متعلقان بالفعل والجملة مستأنفة.\n(وَاللَّهُ لا يَهْدِي الْقَوْمَ الْكافِرِينَ) الجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":38,"text":"(يا أَيُّهَا الَّذِينَ آمَنُوا) سبق اعرابها (ما لَكُمْ) ما اسم استفهام مبني على السكون في محل رفع مبتدأ.\n(لَكُمْ) متعلقان بمحذوف خبر المبتدأ. والجملة الاسمية ابتدائية.\n(إِذا) ظرف لما يستقبل من الزمان، خافض لشرطه، منصوب بجوابه.\n(قِيلَ) فعل ماض مبني للمجهول، ونائب الفاعل ضمير مستتر أي القول (لَكُمْ) متعلقان بالفعل، والجملة في محل جر بالإضافة.\n(انْفِرُوا) فعل أمر مبني على حذف النون، والواو فاعل.\n(فِي سَبِيلِ) متعلقان بالفعل.\n(اللَّهِ) لفظ الجلالة مضاف إليه والجملة في محل نصب مفعول به وأجاز بعضهم إعرابها نائب فاعل.\n(اثَّاقَلْتُمْ) أصلها تثاقلتم فعل ماض مبني على السكون والتاء فاعل، والجملة لا محل لها جواب شرط وقيل حالية أي عذركم حالة كونكم متثاقلين.\n(إِلَى الْأَرْضِ) متعلقان بالفعل اثاقلتم.\n(أَرَضِيتُمْ) فعل ماض والتاء فاعله، والهمزة للاستفهام، (بِالْحَياةِ) متعلقان بالفعل.\n(الدُّنْيا) صفة مجرورة وعلامة جرها الكسرة المقدرة على الألف للتعذر.\n(مِنَ الْآخِرَةِ) متعلقان بمحذوف حال أي بديلا من الآخرة، والجملة مستأنفة.\n(فَما) الفاء استئنافية. ما نافية.\n(مَتاعُ) مبتدأ.\n(الْحَياةِ) مضاف إليه.\n(الدُّنْيا) صفة.\n(فِي الْآخِرَةِ) متعلقان بمحذوف حال من متاع أي محسوبا في الآخرة.\n(إِلَّا) أداة حصر.\n(قَلِيلٌ) خبر المبتدأ والجملة الاسمية مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":39,"text":"(إِلَّا) إن شرطية.\n(لا) نافية.\n(تَنْفِرُوا) مضارع مجزوم فعل الشرط وعلامة جزمه حذف النون، والواو فاعل. والجملة ابتدائية.\n(يُعَذِّبْكُمْ) مضارع مجزوم والكاف مفعوله، والميم لجمع الذكور، والجملة لا محل لها جواب الشرط لم يقترن بالفاء أو إذا.\n(عَذاباً) مفعول مطلق.\n(أَلِيماً) صفة.\n(وَيَسْتَبْدِلْ) مضارع مجزوم معطوف على يعذب.\n(قَوْماً) مفعوله.\n(غَيْرَكُمْ) صفة والجملة معطوفة.\n(وَلا تَضُرُّوهُ) مضارع مجزوم معطوف على يستبدل وعلامة جزمه حذف النون، والواو فاعل والهاء مفعول به. ولا نافية لا عمل لها.\n(شَيْئاً) نائب مفعول مطلق، والجملة معطوفة.\n(وَاللَّهُ) لفظ الجلالة مبتدأ.\n(عَلى كُلِّ) متعلقان بالخبر (شَيْءٍ) مضاف إليه (قَدِيرٌ) خبر.","surah_id":9,"source_id":7},{"ayah_number":40,"text":"جر بالإضافة.\n(لا تَحْزَنْ) لا ناهية ومضارع مجزوم والجملة مقول القول.\n(إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها والظرف (مَعَنا) متعلق بمحذوف خبرها والجملة تعليلية.\n(فَأَنْزَلَ اللَّهُ سَكِينَتَهُ) فعل ماض ولفظ الجلالة فاعل وسكينته مفعول به.\n(عَلَيْهِ) متعلقان بالفعل. والجملة مستأنفة.\n(وَأَيَّدَهُ بِجُنُودٍ) الجملة معطوفة.\n(لَمْ) جازمة (تَرَوْها) مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل والهاء مفعول به والجملة في محل جر صفة.\n(وَجَعَلَ كَلِمَةَ) فعل ماض ومفعول به أول.\n(الَّذِينَ كَفَرُوا) اسم الموصول مضاف إليه والجملة صلة (السُّفْلى) مفعول به ثان. والجملة معطوفة.\n(وَكَلِمَةُ) مبتدأ والواو حالية.\n(اللَّهُ) لفظ الجلالة مضاف إليه.\n(هِيَ) ضمير منفصل في محل رفع مبتدأ.\n(الْعُلْيا) خبر والجملة خبر كلمة (وَاللَّهُ عَزِيزٌ حَكِيمٌ) مبتدأ وخبراه والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":41,"text":"(انْفِرُوا) فعل أمر مبني على حذف النون، والواو فاعل.\n(خِفافاً) حال، وثقالا، عطف والجملة مستأنفة (وَجاهِدُوا) فعل أمر تعلق به الجار والمجرور (بِأَمْوالِكُمْ) وكذلك (فِي سَبِيلِ اللَّهِ) لفظ الجلالة مضاف إليه والجملة معطوفة.\n(ذلِكُمْ) اسم إشارة مبني على السكون في محل رفع مبتدأ. واللام للبعد والكاف للخطاب.\n(خَيْرٌ) خبر.\n(لَكُمْ) متعلقان بخير والجملة الاسمية مستأنفة.\n(إِنْ) حرف شرط جازم والفعل الناقص (كُنْتُمْ) فعل الشرط، وجوابه محذوف دل عليه ما قبله أي إن كنتم تعلمون فانفروا وجاهدوا والجملة ابتدائية. وجملة (تَعْلَمُونَ) في محل نصب خبر كنتم.","surah_id":9,"source_id":7},{"ayah_number":42,"text":"(لَوْ) حرف شرط غير جازم.\n(كانَ) فعل ماض ناقص.\n(عَرَضاً) خبرها واسمها ضمير مستتر أي لو كان الأمر..\n(قَرِيباً) صفة. والجملة ابتدائية (وَسَفَراً قاصِداً) عطف.\n(لَاتَّبَعُوكَ) فعل ماض، والواو فاعل والكاف مفعول به، والجملة لا محل لها جواب شرط غير جازم.\n(وَلكِنْ) الواو حرف عطف.\n(لكِنْ) حرف استدراك.\n(بَعُدَتْ) فعل ماض تعلق به الجار والمجرور (عَلَيْهِمُ)، و(الشُّقَّةُ) فاعل، والجملة معطوفة، (وَسَيَحْلِفُونَ) مضارع مرفوع بثبوت النون، والواو فاعل، والسين للاستقبال.\n(بِاللَّهِ) متعلقان بالفعل والجملة الفعلية مستأنفة.\n(لَوْ) شرطية غير جازمة.\n(اسْتَطَعْنا) فعل ماض مبني على السكون ونا فاعله. والجملة جواب القسم لا محل لها.\n(لَخَرَجْنا) فعل ماض وفاعل واللام واقعة في جواب الشرط.\n(مَعَكُمْ) ظرف مكان متعلق بالفعل، والجملة لا محل لها جواب شرط غير جازم.\n(يُهْلِكُونَ) مضارع والواو فاعل و(أَنْفُسَهُمْ) مفعول به والجملة في محل نصب حال.\n(وَاللَّهُ) لفظ الجلالة مبتدأ والواو حالية. وجملة (يَعْلَمُ) في محل رفع خبره.\n(إِنَّهُمْ) إن والهاء اسمها.\n(لَكاذِبُونَ) اللام هي المزحلقة.\n(كاذبون) خبر مرفوع والمصدر المؤول من أن واسمها وخبرها سد مسد مفعولي يعلم.","surah_id":9,"source_id":7},{"ayah_number":43,"text":"(عَفَا) فعل ماض.\n(اللَّهُ) لفظ الجلالة فاعله.\n(عَنْكَ) متعلقان بالفعل، والجملة ابتدائية.\n(لِمَ) اللام حرف جر.\n(ما) اسم استفهام في محل جر باللام، والجار والمجرور متعلقان (أَذِنْتَ). وحذفت ألف ما لتمييزها عن ما الموصولة.\n(حَتَّى) حرف غاية وجر (يَتَبَيَّنَ) مضارع منصوب بأن المضمرة بعد حتى، والمصدر المؤول من أن المضمرة والفعل في محل جر بحتى. والجار والمجرور متعلقان بفعل محذوف (لَكَ) متعلقان بالفعل.\n(الَّذِينَ) اسم موصول في محل رفع فاعل.\n(صَدَقُوا) فعل ماض وفاعل والجملة صلة الموصول.\n(وَتَعْلَمَ الْكاذِبِينَ) مضارع ومفعوله وفاعله ضمير مستتر تقديره أنت، والجملة معطوفة.","surah_id":9,"source_id":7},{"ayah_number":44,"text":"(لا يَسْتَأْذِنُكَ) مضارع مرفوع وعلامة رفعه الضمة، والكاف مفعول به ولا نافية لا عمل لها.\n(الَّذِينَ) فاعل، (يُؤْمِنُونَ) مضارع وفاعله.\n(بِاللَّهِ) متعلقان بالفعل والجملة صلة الموصول.\n(وَالْيَوْمِ) عطف.\n(الْآخِرِ) صفة.\n(أَنْ) ناصبة (يُجاهِدُوا) مضارع منصوب والواو فاعل. والمصدر المؤول من أن والفعل في محل جر بحرف الجر، والجار والمجرور متعلقان بالفعل لا يستأذنك أي لا يستأذنك الذين يؤمنون.. بالجهاد.\n(بِأَمْوالِهِمْ) متعلقان بالفعل قبلهما (وَأَنْفُسِهِمْ) عطف.\n(وَاللَّهُ) لفظ الجلالة مبتدأ.\n(عَلِيمٌ) خبره.\n(بِالْمُتَّقِينَ) متعلقان بعليم، والجملة الاسمية مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":45,"text":"(إِنَّما) كافة ومكفوفة.\n(يَسْتَأْذِنُكَ الَّذِينَ).. تقدم إعرابها. والجملة مستأنفة.\n(وَارْتابَتْ) فعل ماض والتاء للتأنيث.\n(قُلُوبُهُمْ) فاعل والجملة معطوفة.\n(فَهُمْ) ضمير منفصل في محل رفع مبتدأ.\n(فِي رَيْبِهِمْ) متعلقان بالفعل بعدهما، والجملة الفعلية في محل رفع خبر المبتدأ. وجملة (فهم يترددون) معطوفة.","surah_id":9,"source_id":7},{"ayah_number":46,"text":"(وَلَوْ) الواو استئنافية.\n(لَوْ) شرطية.\n(أَرادُوا الْخُرُوجَ) فعل ماض وفاعل ومفعول به والجملة مستأنفة لا محل لها.\n(لَأَعَدُّوا) فعل ماض وفاعله، واللام واقعة في جواب الشرط.\n(لَهُ) متعلقان بالفعل.\n(عُدَّةً) مفعول به.\n(وَلكِنْ) الواو عاطفة.\n(لكِنْ) حرف استدراك.\n(كَرِهَ اللَّهُ انْبِعاثَهُمْ) فعل ماض ولفظ الجلالة فاعل ومفعول به والجملة معطوفة على جملة مقدرة أي قصّروا في إعداد العدة فكره الله انبعاثهم.\n(فَثَبَّطَهُمْ) الفاء عاطفة وفعل ماض ومفعول به والجملة معطوفة.\n(وَقِيلَ) ماض. ونائب فاعله مستتر أي قيل القول.\n(اقْعُدُوا) فعل أمر وفاعله.\n(مَعَ) ظرف مكان متعلق بالفعل.\n(الْقاعِدِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم، والجملة مقول القول وجملة قيل معطوفة.","surah_id":9,"source_id":7},{"ayah_number":47,"text":"(لَوْ) حرف شرط غير جازم.\n(خَرَجُوا) فعل ماض وفاعل.\n(فِيكُمْ) متعلقان بالفعل وجملة الشرط ابتدائية.\n(ما زادُوكُمْ) فعل ماض، والواو فاعله والكاف مفعوله الأول. وما نافية لا عمل لها، والجملة لا محل لها جواب شرط غير جازم.\n(إِلَّا) أداة حصر.\n(خَبالًا) مفعول به ثان.\n(وَلَأَوْضَعُوا) مثل خرجوا.\n(خِلالَكُمْ) ظرف مكان متعلق بالفعل والكاف في محل جر بالإضافة. والميم لجمع الذكور، والجملة معطوفة.\n(يَبْغُونَكُمُ) مضارع وفاعله. والكاف مفعول به أول.\n(الْفِتْنَةَ) مفعول به ثان والجملة في محل نصب حال.\n(وَفِيكُمْ) متعلقان بمحذوف خبر.\n(سَمَّاعُونَ) مبتدأ مؤخر مرفوع وعلامة رفعه الواو، والجملة الاسمية في محل نصب حال.\n(لَهُمْ) متعلقان بسماعون (وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ) تقدم إعرابها..","surah_id":9,"source_id":7},{"ayah_number":48,"text":"(لَقَدِ) اللام رابطة لجواب لقسم المحذوف. قد حرف تحقيق.\n(ابْتَغَوُا) فعل ماض وفاعله (الْفِتْنَةَ) مفعوله.\n(مِنْ قَبْلُ) متعلقان بحال محذوفة، والجملة لا محل لها جواب القسم المقدر.\n(وَقَلَّبُوا لَكَ الْأُمُورَ) لك متعلقان بالفعل والجملة الفعلية معطوفة.\n(حَتَّى) حرف غاية وجر. والمصدر المؤول من أن المضمرة والفعل (جاءَ الْحَقُّ) بعدها في تأويل مصدر في محل جر بحتى والجار والمجرور متعلقان بفعل محذوف أي واستمروا حتى مجيء الحق.\n(وَظَهَرَ أَمْرُ اللَّهِ) ماض وفاعله ولفظ الجلالة مضاف إليه.\n(وَهُمْ كارِهُونَ) مبتدأ وخبر والجملة الاسمية في محل نصب حال، والواو حالية.","surah_id":9,"source_id":7},{"ayah_number":49,"text":"(وَمِنْهُمْ) متعلقان بمحذوف خبر مقدم، والواو للاستئناف.\n(مَنْ) اسم موصول في محل رفع مبتدأ مؤخر. والجملة مستأنفة وجملة (يَقُولُ) صلة الموصول.\n(ائْذَنْ) فعل أمر تعلق به الجار والمجرور.\n(لِي) والفاعل ضمير مستتر تقديره أنت والجملة مقول القول.\n(وَلا) الواو عاطفة ولا ناهية جازمة.\n(تَفْتِنِّي) مضارع مجزوم وعلامة جزمه حذف النون، والنون للوقاية والياء مفعول به، والفاعل ضمير مستتر تقديره أنت، والجملة معطوفة.\n(أَلا) أداة استفتاح.\n(فِي الْفِتْنَةِ) متعلقان بالفعل بعدهما، والجملة الفعلية مستأنفة.\n(سَقَطُوا) ماض وفاعله (إِنَّ) الواو حالية.\n(وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ) إن واسمها وخبرها واللام هي المزحلقة والجملة في محل نصب حال و(بِالْكافِرِينَ) متعلقان بالخبر.","surah_id":9,"source_id":7},{"ayah_number":50,"text":"(إِنْ) شرطية (تُصِبْكَ) مضارع مجزوم فعل الشرط و(حَسَنَةٌ) فاعله.\n(تَسُؤْهُمْ) جواب الشرط مجزوم والهاء مفعوله، والجملة لا محل لها لم تقترن بالفاء أو إذا.\n(وَإِنْ تُصِبْكَ مُصِيبَةٌ) الجملة معطوفة.\n(يَقُولُوا) جواب الشرط مجزوم والواو فاعل.\n(أَخَذْنا أَمْرَنا) فعل ماض وفاعل ومفعول به والجملة مقول القول.\n(مِنْ قَبْلُ) قبل ظرف زمان مبني على الضم لانقطاعه عن الإضافة، والجار والمجرور متعلقان بالفعل.\n(وَيَتَوَلَّوْا) الجملة معطوفة على يقولوا.\n(وَهُمْ فَرِحُونَ) مبتدأ وخبر والواو حالية والجملة في محل نصب حال.","surah_id":9,"source_id":7},{"ayah_number":51,"text":"(قُلْ) فعل أمر والفاعل ضمير مستتر والجملة مستأنفة (لَنْ يُصِيبَنا) مضارع منصوب بلن، ونا ضمير متصل في محل نصب مفعول به.\n(إِلَّا) أداة حصر.\n(ما) اسم موصول في محل رفع فاعل، والجملة مقول القول.\n(كَتَبَ اللَّهُ لَنا) فعل ماض تعلق به الجار والمجرور ولفظ الجلالة فاعله، والجملة صلة الموصول لا محل لها.\n(هُوَ) ضمير منفصل مبتدأ.\n(مَوْلانا) خبر مرفوع وعلامة رفعه الضمة المقدرة على الألف للتعذر، والجملة الاسمية تعليلية لا محل لها.\n(وَعَلَى اللَّهِ) الواو زائدة وجار ومجرور متعلقان بالفعل يتوكل.\n(فَلْيَتَوَكَّلِ) اللام لام الأمر ومضارع مجزوم، والفاء استئنافية.\n(الْمُؤْمِنُونَ) فاعل والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":52,"text":"(قُلْ) الجملة مستأنفة (هَلْ) حرف استفهام يفيد الإنكار والنفي.\n(تَرَبَّصُونَ) أصلها تتربصون مضارع مرفوع بثبوت النون، والواو فاعل.\n(بِنا) متعلقان بالفعل.\n(إِلَّا) أداة حصر.\n(إِحْدَى) مفعول به منصوب وعلامة نصبه الفتحة المقدرة على الألف للتعذر.\n(الْحُسْنَيَيْنِ) مضاف إليه مجرور وعلامة جره الياء لأنه مثنى. والجملة مقول القول.\n(وَنَحْنُ) ضمير منفصل في محل رفع مبتدأ، والواو عاطفة.\n(نَتَرَبَّصُ) مضارع والفاعل نحن والجملة معطوفة.\n(بِكُمْ) متعلقان بالفعل.\n(أَنْ يُصِيبَكُمُ) المصدر المؤول من أن الناصبة والفعل المضارع بعدها في محل نصب مفعول به أي ونحن نتربص إصابتكم بعذاب..\n(اللَّهُ) لفظ الجلالة فاعل.\n(بِعَذابٍ) متعلقان بالفعل قبلهما (مِنْ عِنْدِهِ) متعلقان بمحذوف صفة لعذاب.\n(أَوْ) حرف عطف.\n(بِأَيْدِينا) الباء حرف جر.\n(أيدي) اسم مجرور وعلامة جره الكسرة المقدرة على الياء، ونا ضمير متصل في محل جر بالإضافة، وهو اسم معطوف على من عنده.\n(فَتَرَبَّصُوا) فعل أمر مبني على حذف النون، والواو فاعل، والفاء هي الفصيحة والجملة لا محل لها جواب شرط غير جازم مقدر.\n(إِنَّا) إن واسمها (مَعَكُمْ) ظرف متعلق بالخبر و(مُتَرَبِّصُونَ) خبرها. والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":53,"text":"(قُلْ) فعل أمر وفاعله ضمير مستتر تقديره أنت والجملة مستأنفة.\n(أَنْفِقُوا) فعل أمر وفاعل.\n(طَوْعاً) حال.\n(أَوْ) حرف عطف.\n(كَرْهاً) اسم معطوف.\n(لَنْ يُتَقَبَّلَ) مضارع مبني للمجهول منصوب، ونائب الفاعل محذوف أي الإنفاق.\n(مِنْكُمْ) متعلقان بالفعل. والجملة في محل نصب حال أي أنفقوا غير متقبل منكم.\n(إِنَّكُمْ) إن واسمها.\n(كُنْتُمْ قَوْماً) كان واسمها وخبرها، والجملة في محل رفع خبر إن.\nوجملة إنكم كنتم.. مستأنفة.\n(فاسِقِينَ) صفة منصوبة وعلامة نصبها الياء لأنها جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":54,"text":"(وَما) الواو استئنافية. ما نافية.\n(مَنَعَهُمْ) فعل ماض ومفعوله.\n(أَنْ تُقْبَلَ) مضارع مبني للمجهول منصوب، والمصدر المؤول من أن والفعل في محل جر بحرف الجر المقدر أي وما منعهم من قبول.. أو في محل نصب مفعول به ثان للفعل منع.\n(نَفَقاتُهُمْ) نائب فاعل.\n(إِلَّا) أداة حصر.\n(أَنَّهُمْ) أن واسمها وجملة (كَفَرُوا) خبرها. والمصدر المؤول من أن واسمها وخبرها في محل رفع فاعل للفعل منع أي وما منعهم من قبول نفقاتهم إلا كفرهم.\n(بِاللَّهِ) لفظ الجلالة جار ومجرور متعلقان بالفعل.\n(وَبِرَسُولِهِ) عطف (وَلا) الواو عاطفة. لا نافية لا عمل لها.\n(يَأْتُونَ الصَّلاةَ) فعل مضارع وفاعل ومفعول به والجملة معطوفة.\n(إِلَّا) أداة حصر.\n(وَهُمْ كُسالى) مبتدأ وخبر والواو حالية، والجملة الاسمية في محل نصب حال. ومثلها (وَلا يُنْفِقُونَ إِلَّا وَهُمْ كارِهُونَ).","surah_id":9,"source_id":7},{"ayah_number":55,"text":"(فَلا تُعْجِبْكَ) الفاء استئنافية. لا ناهية جازمة.\n(تُعْجِبْكَ) مضارع مجزوم والكاف مفعوله (أَمْوالُهُمْ) فاعله.\n(وَلا) الواو عاطفة.\n(لا) معطوفة على لا الأولى.\n(أَوْلادُهُمْ) اسم معطوف على أموالهم.\n(إِنَّما) كافة ومكفوفة.\n(يُرِيدُ اللَّهُ) فعل مضارع ولفظ الجلالة فاعله والمصدر المؤول من (أن) والفعل (يعذبهم) في محل نصب مفعول به (بِها) متعلقان بيعذب وكذلك الجار والمجرور (فِي الْحَياةِ).\nوالجملة تعليلية لا محل لها.\n(الدُّنْيا) صفة وجملة (وَتَزْهَقَ أَنْفُسُهُمْ) معطوفة.\n(وَهُمْ كافِرُونَ) مبتدأ وخبر والجملة في محل نصب حال بعد واو الحال.","surah_id":9,"source_id":7},{"ayah_number":56,"text":"(وَيَحْلِفُونَ بِاللَّهِ) فعل مضارع تعلق به الجار والمجرور والواو فاعله، والجملة مستأنفة.\n(إِنَّهُمْ) إن واسمها.\n(لَمِنْكُمْ) اللام هي المزحلقة.\n(مِنْكُمْ) متعلقان بمحذوف خبر إن، والجملة لا محل لها من الإعراب جواب القسم.\n(وَما هُمْ) الواو حالية. ما نافية.\n(هُمْ) ضمير منفصل في محل رفع مبتدأ، (مِنْكُمْ) متعلقان بمحذوف خبر المبتدأ، والجملة الاسمية في محل نصب حال.\n(وَلكِنَّهُمْ) لكن والهاء اسمها (قَوْمٌ) خبرها والجملة الاسمية معطوفة، وجملة (يَفْرَقُونَ) في محل رفع صفة لقوم.","surah_id":9,"source_id":7},{"ayah_number":57,"text":"(لَوْ) حرف شرط غير جازم.\n(يَجِدُونَ) فعل مضارع وفاعل (مَلْجَأً) مفعول به والجملة لا محل لها ابتدائية.\n(أَوْ مَغاراتٍ) اسم معطوف منصوب وعلامة نصبه الكسرة لأنه جمع مؤنث سالم.\n(أَوْ) عاطفة (مُدَّخَلًا) اسم معطوف.\n(لَوَلَّوْا) فعل ماض وفاعله واللام واقعة في جواب الشرط، والجملة لا محل لها جواب شرط غير جازم.\n(إِلَيْهِ) متعلقان بالفعل (وَهُمْ) مبتدأ والواو حالية. وجملة (يَجْمَحُونَ) خبر المبتدأ والجملة الاسمية (وَهُمْ يَجْمَحُونَ) في محل نصب حال.","surah_id":9,"source_id":7},{"ayah_number":58,"text":"(وَمِنْهُمْ مَنْ يَلْمِزُكَ) إعرابه كقوله تعالى ومنهم من يقول ائذن لي في الآية 50.\n(فَإِنْ) شرطية والفاء استئنافية.\n(أُعْطُوا) فعل ماض مبني للمجهول، والواو نائب فاعل، وهو في محل جزم فعل الشرط والجملة لا محل لها ابتدائية.\n(مِنْها) متعلقان بمحذوف هو مفعول به ثان أي أعطوا بعضا منها. ونائب الفاعل الواو هو المفعول الأول.\n(رَضُوا) فعل ماض وفاعله والجملة لا محل لها جواب شرط جازم لم يقترن بالفاء أو إذا.\n(وَإِنْ لَمْ يُعْطَوْا) منها مثل إن أعطوا..\n(إِذا) الفجائية.\n(هُمْ) مبتدأ وجملة (يَسْخَطُونَ) خبر. والجملة الاسمية (إِذا هُمْ يَسْخَطُونَ) في محل جزم جواب الشرط. وجملة وإن لم يعطوا معطوفة.","surah_id":9,"source_id":7},{"ayah_number":59,"text":"(وَلَوْ) والواو استئنافية. لو حرف شرط غير جازم (أَنَّهُمْ) أن واسمها.\n(رَضُوا) فعل ماض والواو فاعل (ما) اسم الموصول مفعول به، والجملة الفعلية في محل رفع خبر أن. وأن وما بعدها في تأويل مصدر في محل رفع فاعل لفعل الشرط المحذوف أي ولو ثبت رضاهم.. وجواب الشرط محذوف تقديره لكان خيرا لهم.\n(آتاهُمُ اللَّهُ) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر، والهاء مفعول به.\n(اللَّهُ) لفظ الجلالة فاعل والجملة صلة الموصول.\n(وَرَسُولُهُ) عطف.\n(وَقالُوا) الجملة معطوفة على رضوا.\n(حَسْبُنَا) مبتدأ مرفوع وعلامة رفعه الضمة. ونا ضمير متصل في محل جر بالإضافة.\n(اللَّهُ) لفظ الجلالة خبر والجملة الاسمية في محل نصب مفعول به.\n(سَيُؤْتِينَا) مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء للثقل. ونا مفعول به.\n(اللَّهُ) لفظ الجلالة فاعل، والجملة مقول القول.\n(مِنْ فَضْلِهِ) متعلقان بحال محذوفة.\n(وَرَسُولُهُ) عطف (إِنَّا) إن واسمها و(راغِبُونَ) خبرها.\n(إِلَى اللَّهِ) متعلقان بالخبر و(راغِبُونَ) والجملة مقول القول.","surah_id":9,"source_id":7},{"ayah_number":60,"text":"(إِنَّمَا) كافة ومكفوفة.\n(الصَّدَقاتُ) مبتدأ مرفوع.\n(لِلْفُقَراءِ) متعلقان بمحذوف خبر.\n(وَالْمَساكِينِ وَالْعامِلِينَ) معطوفة على الفقراء.\n(عَلَيْها) متعلقان باسم الفاعل قبلهما.\n(وَالْمُؤَلَّفَةِ) اسم معطوف.\n(قُلُوبُهُمْ) نائب فاعل للمؤلفة.\n(وَفِي الرِّقابِ وَالْغارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ).. أسماء معطوفة.\n(فَرِيضَةً) مفعول مطلق لفعل محذوف. أي فرض اللّه ذلك فريضة.\n(مِنَ اللَّهِ) متعلقان بفريضة.\n(وَاللَّهُ عَلِيمٌ حَكِيمٌ) لفظ الجلالة مبتدأ وعليم حكيم خبراه والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":61,"text":"(وَمِنْهُمُ) جار ومجرور متعلقان بمحذوف خبر، والواو استئنافية.\n(الَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(يُؤْذُونَ) فعل مضارع مرفوع بثبوت النون، والواو فاعل.\n(النَّبِيَّ) مفعول به. والجملة صلة الموصول.\n(وَيَقُولُونَ) الجملة معطوفة.\n(هُوَ) ضمير منفصل في محل رفع مبتدأ.\n(أُذُنٌ) خبر، والجملة مقول القول.\n(قُلْ) فعل أمر والفاعل ضمير مستتر تقديره أنت.\n(أُذُنٌ) خبر لمبتدأ محذوف تقديره هو أذن خير، وخير مضاف إليه، والجملة مقول القول كذلك. وجملة قل هو أذن.. مستأنفة.\n(لَكُمْ) متعلقان بخير قبلهما.\n(يُؤْمِنُ بِاللَّهِ) مضارع تعلق به الجار والمجرور بعده، والفاعل ضمير مستتر تقديره هو، والجملة في محل رفع صفة أذن. وجملة (يُؤْمِنُ لِلْمُؤْمِنِينَ) معطوفة.\n(وَرَحْمَةٌ) عطف على أذن.\n(لِلَّذِينَ) متعلقان برحمة.\n(آمَنُوا) الجملة صلة (مِنْكُمْ) متعلقان بمحذوف حال.\n(وَالَّذِينَ) اسم موصول في محل رفع مبتدأ، والواو للاستئناف.\n(يُؤْذُونَ) مضارع مرفوع بثبوت النون، والواو فاعل.\n(رَسُولَ) مفعول به.\n(اللَّهِ) لفظ الجلالة مضاف إليه والجملة صلة الموصول.\n(لَهُمْ) متعلقان بمحذوف خبر مقدم.\n(عَذابٌ) مبتدأ.\n(أَلِيمٌ) صفة. والجملة الاسمية في محل رفع خبر المبتدأ.","surah_id":9,"source_id":7},{"ayah_number":62,"text":"(يَحْلِفُونَ) فعل مضارع وفاعل.\n(بِاللَّهِ) و(لَكُمْ) متعلقان بالفعل.\n(لِيُرْضُوكُمْ) المصدر المؤول من أن المضمرة بعد لام التعليل والفعل في محل جر باللام، والجار والمجرور متعلقان بيحلفون.\n(وَاللَّهُ) لفظ الجلالة مبتدأ، والواو حالية.\n(وَرَسُولُهُ) عطف (أَحَقُّ) خبر.\n(أَنْ يُرْضُوهُ) المصدر المؤول في محل جر بحرف الجر أي اللّه أحق بالإرضاء.\n(أَنْ) حرف شرط جازم.\n(كانُوا) كان واسمها.\n(مُؤْمِنِينَ) خبر، وجواب الشرط محذوف دل عليه ما قبله، وجملة كانوا ابتدائية جملة فعل الشرط.","surah_id":9,"source_id":7},{"ayah_number":63,"text":"(أَلَمْ) الهمزة حرف استفهام. ولم حرف نفي وجزم وقلب، (يَعْلَمُوا) مضارع مجزوم بحذف النون والواو فاعل والجملة مستأنفة.\n(أَنَّهُ) أن والهاء اسمها.\n(مَنْ) اسم شرط جازم في محل رفع مبتدأ.\n(يُحادِدِ) مضارع مجزوم فعل الشرط، والفاعل ضمير مستتر تقديره هو.\n(اللَّهَ) لفظ الجلالة.\n(وَرَسُولَهُ)رة.............. للعلمية والعجمة.\n(خالِداً) حال.\n(فِيها) متعلقان باسم الفاعل (خالِداً) والجملة الاسمية في محل رفع خبر أنه. وجملة فعل الشرط وجوابه في محل رفع خبر المبتدأ من. وأنه وخبرها سدت مسد مفعولي يعلموا.\n(ذلِكَ) اسم إشارة في محل رفع مبتدأ، واللام للبعد والكاف للخطاب.\n(الْخِزْيُ) خبر.\n(الْعَظِيمُ) صفة. والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":64,"text":"(يَحْذَرُ الْمُنافِقُونَ) فعل مضارع وفاعل (أَنْ تُنَزَّلَ) المصدر المؤول من أن الناصبة والفعل بعدها في تأويل مصدر في محل نصب مفعول به أي نزول سورة.\n(عَلَيْهِمْ) متعلقان بالفعل.\n(سُورَةٌ) نائب فاعل.\n(تُنَبِّئُهُمْ) فعل مضارع والهاء مفعوله، والفاعل ضمير مستتر تقديره هي.\n(بِما) الباء حرف جر. وما اسم موصول في محل جر بحرف الجر والجار والمجرور متعلقان بالفعل.\n(فِي قُلُوبِهِمْ) متعلقان بمحذوف صلة ما أي بما ثبت في قلوبهم. والجملة الفعلية في محل جر صفة السورة.\n(قُلِ) فعل أمر والفاعل أنت والجملة مستأنفة.\n(اسْتَهْزِؤُا) فعل أمر مبني على حذف النون، والواو فاعل والجملة مقول القول.\n(إِنَّ اللَّهَ مُخْرِجٌ) إن واسمها وخبرها.\n(ما) اسم موصول مبني على السكون في محل نصب مفعول به لاسم الفاعل مخرج، وجملة (تَحْذَرُونَ) صلة الموصول لا محل لها. وجملة إن اللّه مخرج استئنافية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":65,"text":"(وَلَئِنْ) الواو للاستئناف. واللام موطئة للقسم وإن شرطية.\n(سَأَلْتَهُمْ) فعل ماض، والتاء ضمير متصل في محل رفع فاعل، والهاء ضمير متصل في محل نصب مفعول به، والميم لجمع الذكور، والجملة استئنافية.\n(لَيَقُولُنَّ) اللام رابطة لجواب القسم.\n(يقولن) مضارع مرفوع وعلامة رفعه ثبوت النون المحذوفة لكراهة توالي الأمثال، والواو المحذوفة في محل رفع فاعل، والنون هي نون التوكيد الثقيلة. والجملة لا محل لها جواب القسم، وجواب الشرط محذوف لدلالة جواب القسم عليه.\n(إِنَّما) كافة ومكفوفة.\n(كُنَّا) كان واسمها وجملة (نَخُوضُ) في محل نصب خبر كان وجملة إنما كنا.. مقول القول.\n(وَنَلْعَبُ) عطف.\n(قُلْ) الجملة مستأنفة (أَبِاللَّهِ) متعلقان بالفعل تستهزئون، والهمزة للاستفهام.\n(وَآياتِهِ) اسم معطوف (وَرَسُولِهِ) اسم معطوف.\n(كُنْتُمْ) كان والتاء اسمها والميم علامة جمع الذكور.\n(تَسْتَهْزِؤُنَ) مضارع وفاعله والجملة في محل نصب خبر كنتم وجملة كنتم تستهزئون.. مقول القول.","surah_id":9,"source_id":7},{"ayah_number":66,"text":"(لا تَعْتَذِرُوا) لا ناهية ومضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل. والجملة مستأنفة.\n(قَدْ) حرف تحقيق.\n(كَفَرْتُمْ) فعل ماض، والتاء فاعل، والميم لجمع الذكور، والجملة تعليلية لا محل لها.\n(بَعْدَ) ظرف زمان متعلق بالفعل.\n(إِيمانِكُمْ) مضاف إليه.\n(إِنْ) شرطية (نَعْفُ) فعل الشرط مجزوم وعلامة جزمه حذف حرف العلة، وهو الواو، والفاعل ضمير مستتر تقديره نحن.\n(عَنْ طائِفَةٍ) متعلقان بالفعل.\n(مِنْكُمْ) متعلقان بمحذوف صفة طائفة. وجملة فعل الشرط ابتدائية لا محل لها.\n(نُعَذِّبْ) جواب الشرط مجزوم، (طائِفَةٍ) مفعول به والجملة لا محل لها جواب شرط جازم ولم تقترن بالفاء أو إذا الفجائية.\n(بِأَنَّهُمْ) أن والهاء اسمها.\n(كانُوا) كان والواو اسمها و(مُجْرِمِينَ) خبرها. وجملة كانوا مجرمين في محل رفع خبر أنهم. وأن واسمها وخبرها في تأويل مصدر في محل جر بالباء، والجار والمجرور متعلقان بالفعل نعذب.","surah_id":9,"source_id":7},{"ayah_number":67,"text":"(الْمُنافِقُونَ) مبتدأ مرفوع وعلامة رفعه الواو لأنه جمع مذكر سالم.\n(وَالْمُنافِقاتُ) اسم معطوف.\n(بَعْضُهُمْ) مبتدأ ثان.\n(مِنْ بَعْضٍ) متعلقان بمحذوف خبره. والجملة الاسمية بعضهم من بعض في محل رفع خبر المبتدأ المنافقون. وجملة المنافقون بعضهم من بعض استئنافية لا محل لها.\n(يَأْمُرُونَ) مضارع وفاعل.\n(بِالْمُنْكَرِ) متعلقان بالفعل والجملة في محل نصب حال، وكذلك ما بعدها من الجمل.. وجملة (فَنَسِيَهُمْ) معطوفة.\n(إِنَّ الْمُنافِقِينَ) إن واسمها.\n(هُمُ) ضمير رفع مبتدأ.\n(الْفاسِقُونَ) خبره والجملة الاسمية هم الفاسقون في محل رفع خبر إن. وجملة إن المنافقين تعليلية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":68,"text":"(وَعَدَ اللَّهُ) فعل ماض ولفظ الجلالة فاعل.\n(الْمُنافِقِينَ) مفعول به منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم.\n(وَالْمُنافِقاتِ) اسم معطوف منصوب وعلامة نصبه الكسرة لأنه جمع مؤنث سالم.\n(وَالْكُفَّارَ) اسم معطوف.\n(نارَ) مفعول به ثان.\n(جَهَنَّمَ) مضاف إليه اسم علم أعجمي.\n(خالِدِينَ) حال منصوبة وعلامة نصبه الياء.\n(فِيها) متعلقان بخالدين.\n(هِيَ) ضمير منفصل مبتدأ.\n(حَسْبُهُمْ) خبر والجملة الاسمية في محل نصب حال.\n(وَلَعَنَهُمُ اللَّهُ) فعل ماض ومفعول ولفظ الجلالة فاعل والجملة معطوفة.\n(وَلَهُمْ) متعلقان بمحذوف خبر.\n(عَذابٌ) مبتدأ.\n(مُقِيمٌ) صفة والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":69,"text":"(كَالَّذِينَ) جار ومجرور متعلقان بمحذوف خبر مقدم أي أنتم كالذين أو الكاف اسم بمعنى مثل خبر أنتم مثل الذين.. و(مِنْ قَبْلِكُمْ) متعلقان بمحذوف صلة الموصول أي كالذين مضوا من قبلكم.\n(كانُوا أَشَدَّ) كان واسمها وخبرها، والجملة في محل نصب حال.\n(مِنْكُمْ) متعلقان باسم التفضيل أشد.\n(قُوَّةً) تمييز.\n(وَأَكْثَرَ) عطف على أشد.\n(أَمْوالًا) تمييز.\n(وَأَوْلاداً) عطف (فَاسْتَمْتَعُوا) فعل ماض وفاعله.\n(بِخَلاقِهِمْ) متعلقان بالفعل والجملة معطوفة ومثلها جملة (فَاسْتَمْتَعْتُمْ بِخَلاقِكُمْ).\n(كَمَا اسْتَمْتَعَ) المصدر المؤول من ما المصدرية والفعل الماضي في محل جر بالكاف والجار والمجرور متعلقان بمحذوف صفة مفعول مطلق أي استمتاعا كائنا كاستمتاع الذين من قبلكم.\n(الَّذِينَ) فاعل (مِنْ قَبْلِكُمْ) متعلقان بمحذوف صلة.\n(بِخَلاقِهِمْ) متعلقان باستمتع.\n(وَخُضْتُمْ كَالَّذِي) أي كالذين الجار والمجرور متعلقان بمحذوف مفعول مطلق الجملة معطوفة وجملة.\n(خاضُوا) صلة الموصول.\n(أُولئِكَ) اسم إشارة مبتدأ وجملة (حَبِطَتْ أَعْمالُهُمْ) خبر، والجملة الاسمية أولئك حبطت أعمالهم مستأنفة.\n(فِي الدُّنْيا) متعلقان بالفعل (وَالْآخِرَةِ) عطف (وَأُولئِكَ) مبتدأ (هُمُ) ضمير فصل (الْخاسِرُونَ) خبر.","surah_id":9,"source_id":7},{"ayah_number":70,"text":"(أَلَمْ) الهمزة للاستفهام.\n(لَمْ) حرف نفي وجزم وقلب.\n(يَأْتِهِمْ) مضارع مجزوم وعلامة جزمه حذف حرف العلة وهو الياء. والهاء مفعول به والميم لجمع الذكور.\n(نَبَأُ) فاعل.\n(الَّذِينَ) اسم موصول في محل جر بالإضافة.\n(مِنْ قَبْلِهِمْ) متعلقان بمحذوف صلة الموصول.\n(قَوْمِ) بدل من الذين مجرور بالكسرة.\n(نُوحٍ) مضاف إليه.\n(وَعادٍ) عطف (وَثَمُودَ) اسم معطوف مجرور بالفتحة ممنوع من الصرف للعلمية والعجمة.\n(وَقَوْمِ) اسم معطوف.\n(إِبْراهِيمَ) مضاف إليه مجرور بالفتحة للعلمية والعجمة أيضا.\n(وَأَصْحابِ) عطف (مَدْيَنَ) مضاف إليه مجرور رسلهم: فاعل بالفتحة لأنه ممنوع من الصرف.\n(وَالْمُؤْتَفِكاتِ) عطف. وجملة (أَتَتْهُمْ رُسُلُهُمْ) مستأنفة (رُسُلُهُمْ) فاعل و(بِالْبَيِّناتِ) متعلقان بالفعل.\n(فَما) الفاء عاطفة.\n(ما) نافية.\n(كانَ اللَّهُ) كان ولفظ الجلالة اسمها.\n(لِيَظْلِمَهُمْ) مضارع منصوب بأن المضمرة بعد لام الجحود، والهاء مفعول به أو المصدر المؤول من أن والفعل بعدها في محل جر بحرف الجر والجار والمجرور متعلقان بمحذوف خبر أي ما كان اللّه مريدا لظلمهم وجملة فما كان..\nمعطوفة.\n(وَلكِنْ) حرف استدراك والواو عاطفة.\n(كانُوا) كان واسمها.\n(أَنْفُسَهُمْ) مفعول به مقدم للفعل (يَظْلِمُونَ) وجملة يظلمون في محل نصب خبر وجملة كانوا معطوفة.","surah_id":9,"source_id":7},{"ayah_number":71,"text":"تشبه هذه الآية في إعرابها الآية 68 تقريبا.\n(أُولئِكَ) اسم إشارة مبتدأ والجملة الفعلية (سَيَرْحَمُهُمُ اللَّهُ) في محل رفع خبر.\n(إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ) إن واسمها وخبراها والجملة تعليلية لا محل لها.\nوالجملة الاسمية أولئك مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":72,"text":"(وَعَدَ اللَّهُ الْمُؤْمِنِينَ وَالْمُؤْمِناتِ جَنَّاتٍ) فعل ماض وفاعله ومفعولاه والجملة مستأنفة.\n(تَجْرِي) فعل مضارع.\n(الْأَنْهارُ) فاعل.\n(مِنْ تَحْتِهَا) متعلقان بالفعل والجملة الفعلية في محل نصب صفة جنات.\n(خالِدِينَ) حال منصوبة وعلامة نصبه الياء جمع مذكر سالم.\n(فِيها) متعلقان بخالدين.\n(وَمَساكِنَ) عطف على جنات.\n(طَيِّبَةً) صفة.\n(فِي جَنَّاتِ) متعلقان بمحذوف صفة ثانية لجنات.\n(عَدْنٍ) مضاف إليه.\n(وَرِضْوانٌ) مبتدأ مرفوع ساغ الابتداء بالنكرة لأنها وصف وتعلق الجار والمجرور.\n(مِنَ اللَّهِ) بهذه الصفة المحذوفة والواو استئنافية.\n(أَكْبَرُ) خبر والجملة الاسمية (رِضْوانٌ مِنَ اللَّهِ) مستأنفة لا محل لها.\n(ذلِكَ) اسم إشارة مبتدأ.\n(هُوَ) ضمير منفصل مبتدأ ثان، (الْفَوْزُ) خبره.\n(الْعَظِيمُ) صفة وجملة هو الفوز.. خبر اسم الإشارة، والجملة الاسمية ذلك هو.. مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":73,"text":"(يا أَيُّهَا) يا أداة نداء أي نكرة مقصودة مبنية على الضم في محل نصب على النداء.\n(النَّبِيُّ) بدل.\n(جاهِدِ الْكُفَّارَ) فعل أمر ومفعول به والجملة ابتدائية.\n(وَالْمُنافِقِينَ) عطف على الكفار. وجملة (اغْلُظْ عَلَيْهِمْ) معطوفة على جملة جاهد الكفار.\n(وَمَأْواهُمْ) مبتدأ مرفوع وعلامة رفعه الضمة المقدرة على الألف للتعذر، والهاء ضمير متصل في محل جر بالإضافة والميم لجمع الذكور والواو حالية.\n(جَهَنَّمُ) خبر والجملة الاسمية في محل نصب حال.\n(وَبِئْسَ) فعل ماض جامد لإنشاء الذم.\n(الْمَصِيرُ) فاعل والمخصوص بالذم محذوف تقديره بئس المصير مصيرهم، والجملة معطوفة.","surah_id":9,"source_id":7},{"ayah_number":74,"text":"(يَحْلِفُونَ) مضارع تعلق به الجار والمجرور (بِاللَّهِ) بعده والواو فاعله والجملة مستأنفة.\n(ما) نافية.\n(قالُوا) فعل ماض وفاعل والجملة جواب القسم.\n(وَلَقَدْ) الواو حرف جر وقسم. اللام واقعة في جواب القسم المقدر أقسم واللّه.\n(لَقَدْ) قد حرف تحقيق وجملة (قالُوا) لا محل لها جواب القسم.\n(كَلِمَةَ) مفعول به.\n(الْكُفْرِ) مضاف إليه.\n(وَكَفَرُوا) عطف (بَعْدَ) ظرف زمان متعلق بالفعل كفروا.\n(إِسْلامِهِمْ) مضاف إليه، والجملة الفعلية معطوفة.\n(وَهَمُّوا) فعل ماض وفاعل.\n(بِما) ما اسم موصول في محل جر بالباء، والجار والمجرور متعلقان بالفعل.\n(لَمْ) جازمة (يَنالُوا) مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل، والجملة صلة الموصول.\n(وَما) الواو حالية. ما نافية وجملة (نَقَمُوا) في محل نصب حال.\n(إِلَّا) أداة حصر.\n(أَنْ) حرف مصدري.\n(أَغْناهُمُ) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر، والهاء مفعوله.\n(اللَّهُ) لفظ الجلالة فاعله.\n(وَرَسُولُهُ) عطف والمصدر المؤول من أن وما بعدها في محل جر بحرف الجر والجار والمجرور متعلقان بالفعل نقموا.\n(وَرَسُولُهُ) عطف (مِنْ فَضْلِهِ) متعلقان بأغناهم.\n(فَإِنْ) إن شرطية جازمة. والفاء استئنافية.\n(يَتُوبُوا) فعل الشرط المجزوم وفاعله.\n(يَكُ) فعل مضارع ناقص جواب الشرط مجزوم وعلامة جزمه السكون المقدرة على النون المحذوفة تخفيفا واسمها محذوف أي يك الأمر (خَيْراً) لهم.\n(لَهُمْ) متعلقان بخير. وجملة فعل الشرط لا محل لها ابتدائية، وجملة جواب الشرط لا محل لها كذلك لأنها لم ترتبط بالفاء أو إذا الفجائية. و(فَإِنْ يَتُوبُوا يُعَذِّبْهُمُ) إعرابها كسابقتها.\n(عَذاباً) مفعول مطلق.\n(أَلِيماً) صفة.\n(فِي الدُّنْيا) متعلقان بيعذبهم.\n(وَالْآخِرَةِ) عطف.\n(وَما) الواو حرف استئناف. ما نافية.\n(لَهُمْ) متعلقان بمحذوف خبر.\n(مِنْ) حرف جر زائد.\n(وَلِيٍّ) اسم مجرور لفظا مرفوع محلا على أنه مبتدأ.\n(وَلا نَصِيرٍ) اسم معطوف. وفي الأرض متعلقان بمحذوف خبر أيضا.","surah_id":9,"source_id":7},{"ayah_number":75,"text":"(وَمِنْهُمْ) متعلقان بمحذوف خبر، والواو للاستئناف. من اسم الموصول مبتدأ. والجملة الاسمية مستأنفة وجملة (عاهَدَ اللَّهَ) صلة الموصول.\n(لَئِنْ) اللام موطئة للقسم.\n(إن) شرطية.\n(آتانا) فعل ماض مبني على الفتحة المقدرة على الألف للتعذر. و(نا) مفعوله، وفاعله ضمير مستتر تقديره هو. والجار والمجرور (مِنْ فَضْلِهِ) متعلقان بالفعل، وجملة فعل الشرط ابتدائية.\n(لَنَصَّدَّقَنَّ) مضارع مبني على الفتح لاتصاله بنون التوكيد الثقيلة، واللام واقعة في جواب القسم، والجملة لا محل لها جواب القسم.\n(وَلَنَكُونَنَّ) مضارع ناقص مبني على الفتح، واسمه ضمير مستتر تقديره نحن.\n(مِنَ الصَّالِحِينَ) متعلقان بمحذوف خبر، والجملة معطوفة.","surah_id":9,"source_id":7},{"ayah_number":76,"text":"(فَلَمَّا) الفاء عاطفة.\n(لما) ظرفية شرطية متعلقة بالفعل بخلوا.\n(آتاهُمْ) فعل ماض ومفعول (مِنْ فَضْلِهِ) متعلقان بالفعل والجملة في محل جر بالإضافة (بَخِلُوا) الجملة لا محل لها جواب شرط غير جازم، وجملة (تَوَلَّوْا) معطوفة.\n(وَهُمْ مُعْرِضُونَ) مبتدأ وخبر والجملة في محل نصب حال بعد واو الحال.","surah_id":9,"source_id":7},{"ayah_number":77,"text":"(فَأَعْقَبَهُمْ) فعل ماض، والهاء مفعول به أول، والفاء حرف عطف.\n(نِفاقاً) مفعول به ثان.\n(فِي قُلُوبِهِمْ) متعلقان بمحذوف صفة ل (نفاقا).\n(إِلى يَوْمِ) متعلقان بمحذوف صفة أخرى أي نفاقا ثابتا في قلوبهم ممتدا إلى يوم يلقونه.\n(يَلْقَوْنَهُ) فعل مضارع وفاعل ومفعول به والجملة في محل جر بالإضافة.\n(بِما) الباء حرف جر.\n(ما) مصدرية وهي مؤولة مع الفعل (أَخْلَفُوا) بعدها بمصدر في محل جر بالباء، والجار والمجرور متعلقان بالفعل أعقبهم أي أعقبهم ذلك بسبب إخلافهم الوعد وكذبهم (بما وعدوه) ما والفعل وعدوه بعدها في تأويل مصدر في محل نصب مفعول به ثان لأخلف. ويمكن أن تعرب ما اسم موصول في محل نصب مفعول به ثان... والجملة صلة الموصول.\n(وَبِما كانُوا يَكْذِبُونَ) المصدر المؤول معطوف، وجملة يكذبون في محل نصب خبر الفعل الناقص كانوا.","surah_id":9,"source_id":7},{"ayah_number":78,"text":"(أَلَمْ) الهمزة حرف استفهام وإنكار.\n(لَمْ) حرف نفي وجزم وقلب.\n(يَعْلَمُوا) مضارع مجزوم.\n(أَنَّ اللَّهَ) أن ولفظ الجلالة اسمها وجملة (يَعْلَمُ سِرَّهُمْ) في محل رفع خبرها.\n(وَنَجْواهُمْ) معطوف على سرهم منصوب وعلامة نصبه الفتحة المقدرة على الألف للتعذر. والهاء في محل جر بالإضافة وأن واسمها وخبرها سدت مسد مفعولي يعلموا.\n(وَأَنَّ اللَّهَ عَلَّامُ) أن واسمها وخبرها.\n(الْغُيُوبِ) مضاف إليه والجملة الاسمية معطوفة.","surah_id":9,"source_id":7},{"ayah_number":79,"text":"(الَّذِينَ) اسم موصول في محل رفع مبتدأ.\n(يَلْمِزُونَ) مضارع وفاعله.\n(الْمُطَّوِّعِينَ) مفعول به منصوب وعلامة نصبه الياء لأنه جمع مذكر سالم والجملة صلة الموصول. و(مِنَ الْمُؤْمِنِينَ) متعلقان بمحذوف حال من المؤمنين.\n(فِي الصَّدَقاتِ) متعلقان بيلمزون.\n(وَالَّذِينَ) اسم معطوف على المطوعين في محل نصب.\n(لا يَجِدُونَ) مضارع ولا نافية.\n(إِلَّا) أداة حصر.\n(جُهْدَهُمْ) مفعول به والهاء ضمير متصل في محل جر بالإضافة. والجملة صلة الموصول.\n(فَيَسْخَرُونَ مِنْهُمْ) الجار والمجرور متعلقان بالفعل والجملة معطوفة.\n(سَخِرَ اللَّهُ مِنْهُمْ) ماض ولفظ الجلالة فاعل ومنهم متعلقان بحال محذوفة والجملة خبر الذين في أول الآية (وَلَهُمْ) متعلقان بمحذوف خبر.\n(عَذابٌ) مبتدأ.\n(أَلِيمٌ) صفة والجملة معطوفة على ما قبلها.","surah_id":9,"source_id":7},{"ayah_number":80,"text":"(اسْتَغْفِرْ) فعل أمر مبني على السكون، تعلق به الجار والمجرور، والفاعل ضمير مستتر تقديره أنت، والجملة مستأنفة.\n(أَوْ) حرف عطف.\n(لا) ناهية جازمة.\n(تَسْتَغْفِرْ) مضارع مجزوم.\n(لَهُمْ) متعلقان بالفعل قبلهما، والجملة معطوفة.\n(إِنْ) حرف شرط جازم يجزم فعلين مضارعين، (تَسْتَغْفِرْ) مضارع مجزوم فعل الشرط.\n(سَبْعِينَ) ظرف زمان منصوب، وعلامة نصبه الياء لأنه ملحق بجمع المذكر السالم، والنون عوض عن التنوين في الاسم المفرد.\n(مَرَّةً) تمييز.\n(فَلَنْ) الفاء رابطة لجواب الشرط.\n(لن) حرف ناصب.\n(يَغْفِرَ) مضارع منصوب.\n(اللَّهُ) لفظ الجلالة فاعل.\n(لَهُمْ) متعلقان بيغفر، والجملة في محل جزم جواب الشرط، وجملة فعل الشرط (إِنْ تَسْتَغْفِرْ) ابتدائية.\n(ذلِكَ) اسم إشارة مبني على السكون في محل رفع مبتدأ. واللام للبعد والكاف حرف خطاب.\n(بِأَنَّهُمْ) أن والهاء اسمها، والباء حرف جر.\n(كَفَرُوا) فعل ماض وفاعل والجملة في محل رفع خبر أنهم. وأن واسمها وخبرها في تأويل مصدر في محل جر بالباء، والجار والمجرور متعلقان بمحذوف خبر المبتدأ.\n(وَرَسُولِهِ) عطف.\n(بِاللَّهِ) متعلقان بالفعل.\n(وَاللَّهُ) لفظ الجلالة مبتدأ وجملة (لا يَهْدِي الْقَوْمَ الْفاسِقِينَ) خبره والجملة الاسمية واللّه لا يهدي... مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":81,"text":"(فَرِحَ) فعل ماض.\n(الْمُخَلَّفُونَ) فاعل مرفوع وعلامة رفعه الواو جمع مذكر سالم.\n(بِمَقْعَدِهِمْ) متعلقان بالفعل.\n(خِلافَ) ظرف مكان متعلق بمقعد.\n(رَسُولِ) مضاف إليه.\n(اللَّهِ) لفظ الجلالة مضاف إليه والجملة الفعلية مستأنفة.\n(وَكَرِهُوا) فعل ماض وفاعل والمصدر المؤول من (أَنْ) الناصبة والفعل (يُجاهِدُوا) بعدها في محل نصب مفعول به أي وكرهوا المجاهدة.\n(بِأَمْوالِهِمْ) متعلقان بالفعل (وَأَنْفُسِهِمْ) عطف في سبيل اللّه متعلقان بالفعل والجملة الفعلية معطوفة، ومثلها جملة قالوا.\n(لا تَنْفِرُوا) مضارع مجزوم بلا وعلامة جزمه حذف النون، والواو فاعل.\n(فِي الْحَرِّ) متعلقان بالفعل، والجملة مقول القول.\n(قُلْ) فعل أمر والفاعل ضمير مستتر تقديره أنت، والجملة مستأنفة.\n(نارُ) مبتدأ.\n(جَهَنَّمَ) مضاف إليه مجرور وعلامة جره الفتحة نيابة عن الكسرة للعلمية والعجمة.\n(أَشَدُّ) خبر.\n(حَرًّا) تمييز. الجملة الاسمية مفعول به مقول القول.\n(لَوْ) حرف شرط غير جازم.\n(كانُوا) كان واسمها وجملة (يَفْقَهُونَ) خبرها. وجملة فعل الشرط ابتدائية لا محل لها. وجواب الشرط محذوف دل عليه ما قبله أي لو كانوا يفقهون.. لما فرحوا.","surah_id":9,"source_id":7},{"ayah_number":82,"text":"(فَلْيَضْحَكُوا) اللام لام الأمر وفعل مضارع مجزوم وعلامة جزمه حذف النون، والواو فاعل والفاء حرف استئناف.\n(قَلِيلًا) نائب مفعول مطلق، والجملة مستأنفة.\n(وَلْيَبْكُوا كَثِيراً) الجملة معطوفة (جَزاءً) مفعول لأجله.\n(بِما) الباء حرف جر.\n(ما) اسم موصول في محل جر بالباء، والجار والمجرور متعلقان بالمصدر جزاء. أو ما مصدرية والمصدر المؤول في محل جر بالباء.\n(كانُوا) كان واسمها وجملة (يَكْسِبُونَ) خبرها، والجملة صلة الموصول.","surah_id":9,"source_id":7},{"ayah_number":83,"text":"(فَإِنْ) الفاء استئنافية وإن شرطية.\n(رَجَعَكَ اللَّهُ) فعل ماض ومفعوله ولفظ الجلالة فاعله وهو في محل جزم فعل الشرط.\n(إِلى طائِفَةٍ) متعلقان بالفعل.\n(مِنْهُمْ) متعلقان بمحذوف صفة طائفة، والجملة ابتدائية.\n(فَاسْتَأْذَنُوكَ) فعل ماض وفاعل ومفعوله والجملة معطوفة.\n(لِلْخُرُوجِ) متعلقان بالفعل.\n(فَقُلْ) الفاء واقعة في جواب الشرط، والجملة في محل جزم جواب الشرط.\n(لَنْ) حرف ناصب (تَخْرُجُوا) مضارع منصوب والواو فاعله.\n(مَعِيَ) ظرف مكان منصوب وعلامة نصبه الفتحة المقدرة على ما قبل ياء المتكلم، والياء ضمير متصل في محل جر بالإضافة.\n(أَبَداً) ظرف زمان متعلق بالفعل تخرجوا أيضا. والجملة الفعلية في محل نصب مفعول به. والجملة الفعلية (وَلَنْ تُقاتِلُوا) معطوفة.\n(إِنَّكُمْ) إن واسمها.\n(رَضِيتُمْ) فعل ماض مبني على السكون، والتاء فاعل والجملة في محل رفع خبر إن.\n(بِالْقُعُودِ) متعلقان بالفعل.\n(أَوَّلَ) ظرف زمان متعلق بالفعل.\n(مَرَّةٍ) مضاف إليه.\n(فَاقْعُدُوا) فعل أمر مبني على حذف النون والواو فاعل، والفاء هي الفصيحة.\n(مَعَ) ظرف مكان متعلق بالفعل.\n(الْخالِفِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم، والجملة الفعلية لا محل لها جواب إذا الشرطية غير الجازمة. وجملة إنكم رضيتم تعليلية لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":84,"text":"(وَلا) الواو استئنافية ولا ناهية جازمة.\n(تُصَلِّ) مضارع مجزوم وعلامة جزمه حذف حرف العلة وهو الياء.\n(عَلى أَحَدٍ) متعلقان بالفعل.\n(مِنْهُمْ) متعلقان بمحذوف صفة أحد (ماتَ) الجملة صفة لأحد.\n(أَبَداً) ظرف زمان متعلق بالفعل. وجملة لاتصل استئنافية.\n(وَلا تَقُمْ عَلى قَبْرِهِ) عطف على لا تصل على أحد.. وجملة (إِنَّهُمْ كَفَرُوا) الاسمية تعليلية لا محل لها.\n(إِنَّهُمْ) إن واسمها وجملة كفروا خبر إنهم..\n(وَماتُوا) الجملة معطوفة على جملة كفروا..\n(وَهُمْ فاسِقُونَ) الواو حالية ومبتدأ وخبر والجملة في محل نصب حال.","surah_id":9,"source_id":7},{"ayah_number":85,"text":"هذه الآية تشبه الآية 55 التي تقدم إعرابها.","surah_id":9,"source_id":7},{"ayah_number":86,"text":"(وَإِذا) ظرف لما يستقبل من الزمان. خافض لشرطه منصوب بجوابه، والواو للاستئناف.\n(أُنْزِلَتْ) فعل ماض مبني للمجهول، والتاء للتأنيث.\n(سُورَةٌ) نائب فاعل.\n(أَنْ) حرف مصدري أو مفسرة.\n(آمِنُوا) فعل أمر وفاعله. والمصدر المؤول من أن والفعل في محل جر بحرف الجر المقدر أي بالإيمان باللّه، والجار والمجرور متعلقان بالفعل أنزلت.\n(بِاللَّهِ) متعلقان بآمنوا. وجملة (أُنْزِلَتْ) في محل جر بالإضافة. وقيل أن تفسيرية.\n(وَجاهِدُوا) عطف على آمنوا.\n(مَعَ) ظرف مكان متعلق بالفعل وهو مضاف.\n(رَسُولِهِ) مضاف إليه.\n(اسْتَأْذَنَكَ) فعل ماض ومفعول (أُولُوا) فاعل مرفوع وعلامة رفعه الواو لأنه ملحق بجمع المذكر السالم، وحذفت النون للإضافة.\n(الطَّوْلِ) مضاف إليه.\n(مِنْهُمْ) متعلقان بمحذوف حال من أولو الطول. والجملة لا محل لها جواب شرط غير جازم.\n(وَقالُوا) عطف على استأذنك.\n(ذَرْنا) فعل أمر مبني على السكون، ونا مفعوله، وفاعله ضمير مستتر تقديره أنت.\n(نَكُنْ) مضارع ناقص مجزوم جواب الأمر، واسمه نحن.\n(مَعَ) ظرف مكان متعلق بمحذوف خبر.\n(الْقاعِدِينَ) مضاف إليه مجرور وعلامة جره الياء لأنه جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":87,"text":"(رَضُوا) فعل ماض وفاعله والجملة مستأنفة.\n(أن) ناصبة (يَكُونُوا) مضارع ناقص والواو اسمه، وهو منصوب وعلامة نصبه حذف النون، والمصدر المؤول في محل جر بالباء، والجار والمجرور متعلقان بالفعل أي رضوا بكونهم..\n(مَعَ) ظرف مكان متعلق بمحذوف خبر.\n(الْخَوالِفِ) مضاف إليه.\n(وَطُبِعَ) فعل ماض مبني للمجهول.\n(عَلى قُلُوبِهِمْ) نائب فاعل، والجملة معطوفة.\n(فَهُمْ) مبتدأ، والفاء استئنافية، وجملة (لا يَفْقَهُونَ) خبر والجملة الاسمية مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":88,"text":"(لكِنِ) حرف استدراك.\n(الرَّسُولُ) مبتدأ.\n(وَالَّذِينَ) اسم موصول معطوف على الرسول في محل رفع.\n(آمَنُوا) فعل ماض وفاعل.\n(مَعَهُ) ظرف مكان متعلق بالفعل، والجملة صلة الموصول وجملة (جاهَدُوا) في محل رفع خبر المبتدأ.\n(بِأَمْوالِهِمْ) متعلقان بالفعل (وَأَنْفُسِهِمْ) عطف.\n(وَأُولئِكَ) اسم إشارة في محل رفع مبتدأ، والكاف للخطاب.\n(لَهُمُ) متعلقان بمحذوف خبر المبتدأ الخيرات.\n(الْخَيْراتُ) مبتدأ مؤخر وجملة لهم الخيرات في محل رفع خبر المبتدأ أولئك.\n(وَأُولئِكَ هُمُ الْمُفْلِحُونَ) معطوفة على أولئك لهم الخيرات المستأنفة فهي مثلها.","surah_id":9,"source_id":7},{"ayah_number":89,"text":"(أَعَدَّ اللَّهُ لَهُمْ) ماض ولفظ الجلالة فاعله والجار والمجرور متعلقان بالفعل (جَنَّاتٍ) مفعول به منصوب وعلامة نصبه الكسرة نيابة عن الفتحة جمع مؤنث سالم. والجملة مستأنفة.\n(تَجْرِي مِنْ تَحْتِهَا) مضارع مرفوع وعلامة رفعه الضمة المقدرة على الياء، تعلق به الجار والمجرور (مِنْ تَحْتِهَا).\n(الْأَنْهارُ) فاعل والجملة في محل جر صفة.\n(خالِدِينَ) حال منصوبة وعلامة نصبه الياء لأنه جمع مذكر سالم.\n(فِيها) متعلقان بخالدين.\n(ذلِكَ) مبتدأ.\n(الْفَوْزُ) خبر.\n(الْعَظِيمُ) صفة. والجملة مستأنفة لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":90,"text":"(وَجاءَ الْمُعَذِّرُونَ) فعل ماض وفاعل.\n(مِنَ الْأَعْرابِ) متعلقان بمحذوف حال والجملة مستأنفة.\n(لِيُؤْذَنَ) مضارع مبني للمجهول منصوب بأن المضمرة بعد لام التعليل والمصدر المؤول في محل جر باللام، والجار والمجرور متعلقان بالفعل جاء.\n(لَهُمْ) نائب فاعل.\n(وَقَعَدَ الَّذِينَ) فعل ماض واسم الموصول فاعله والجملة معطوفة وجملة (كَذَبُوا اللَّهَ) صلة الموصول.\n(وَرَسُولَهُ) عطف.\n(سَيُصِيبُ الَّذِينَ) فعل ماض وفاعل والسين للاستقبال والجملة مستأنفة وجملة (كَفَرُوا) الجملة صلة الموصول (مِنْهُمْ) متعلقان بمحذوف حال.\n(عَذابٌ) فاعل.\n(أَلِيمٌ) صفة.","surah_id":9,"source_id":7},{"ayah_number":91,"text":"(لَيْسَ) فعل ماض ناقص.\n(عَلَى الضُّعَفاءِ) متعلقان بمحذوف خبر.\n(وَلا عَلَى الْمَرْضى وَلا عَلَى الَّذِينَ) أسماء معطوفة.\n(لا يَجِدُونَ) مضارع والواو فاعل، ولا نافية لا عمل لها، واسم الموصول (ما) مفعول به وجملة لا يجدون صلة الموصول وكذلك جملة (يُنْفِقُونَ).\n(حَرَجٌ) اسم ليس.\n(إِذا) ظرف لما يستقبل من الزمان.. وجملة (نَصَحُوا) في محل جر بالإضافة.\n(لِلَّهِ) حرف الجر ولفظ الجلالة متعلقان بالفعل.\n(ما عَلَى الْمُحْسِنِينَ) الجار والمجرور متعلقان بمحذوف خبر مقدم وما نافية لا عمل لها.\n(مِنْ سَبِيلٍ) من حرف جر زائد.\n(سَبِيلٍ) اسم مجرور لفظا مرفوع محلا على أنه مبتدأ مؤخر، والجملة مستأنفة لا محل لها.\n(وَاللَّهُ غَفُورٌ رَحِيمٌ) لفظ الجلالة مبتدأ وخبراه والجملة مستأنفة كذلك.","surah_id":9,"source_id":7},{"ayah_number":92,"text":"(وَلا عَلَى الَّذِينَ) عطف على الآية السابقة.\n(إِذا) ظرفية..\n(ما) زائدة.\n(أَتَوْكَ) الجملة الفعلية في محل جر بالإضافة.\n(لِتَحْمِلَهُمْ) مضارع منصوب بأن المضمرة بعد لام التعليل، والمصدر المؤول في محل جر باللام، والجار والمجرور متعلقان بأتوك..\n(قُلْتَ) فعل ماض وفاعله، والجملة في محل نصب حال على تقدير قد قبلها، فتكون جملة تولوا هي جواب الشرط..\n(لا أَجِدُ ما) فعل مضارع واسم الموصول مفعول به، (أَحْمِلُكُمْ) الجملة صلة (عَلَيْهِ) متعلقان بالفعل، (تَوَلَّوْا) الجملة مستأنفة.\n(وَأَعْيُنُهُمْ) مبتدأ، والهاء في محل جر بالإضافة، والميم لجمع الذكور والواو حالية والجملة حالية. وجملة (تَفِيضُ مِنَ الدَّمْعِ) في محل رفع خبر.\n(حَزَناً) مفعول لأجله.\n(أَلَّا) أن حرف مصدري ونصب، ولا نافية.\n(يَجِدُوا) مضارع منصوب وعلامة نصبه حذف النون، والمصدر المؤول في محل جر بحرف الجر أي لعدم وجدان ما ينفقون، وهما متعلقان ب (حَزَناً).\n(ما) اسم موصول في محل نصب مفعول به، وجملة (يُنْفِقُونَ) صلة الموصول لا محل لها. والعائد محذوف أي ما ينفقونه.","surah_id":9,"source_id":7},{"ayah_number":93,"text":"(إِنَّمَا) كافة ومكفوفة.\n(السَّبِيلُ) مبتدأ.\n(عَلَى الَّذِينَ) متعلقان بمحذوف خبر، والجملة الاسمية مستأنفة.\n(يَسْتَأْذِنُونَكَ) مضارع مرفوع بثبوت النون، والواو فاعل، والكاف مفعول به والجملة صلة الموصول.\n(وَهُمْ أَغْنِياءُ) مبتدأ وخبر والجملة في محل نصب حال.\n(رَضُوا) فعل ماض وفاعل والجملة في محل نصب حال على تقدير قد قبلها.\n(بِأَنْ) أن ناصبة (يَكُونُوا) مضارع ناقص منصوب، والواو اسمها والمصدر المؤول من أن والفعل في محل جر بالباء، والجار والمجرور متعلقان برضوا.\n(مَعَ) ظرف مكان متعلق بمحذوف خبر يكونوا.\n(الْخَوالِفِ) مضاف إليه.\n(وَطَبَعَ اللَّهُ عَلى قُلُوبِهِمْ) الجملة الفعلية معطوفة.\n(فَهُمْ) مبتدأ والفاء عاطفة. وجملة (لا يَعْلَمُونَ) خبره وجملة (فَهُمْ لا يَعْلَمُونَ) معطوفة.","surah_id":9,"source_id":7},{"ayah_number":94,"text":"(يَعْتَذِرُونَ) مضارع مرفوع بثبوت النون والواو فاعله والجملة مستأنفة (إِلَيْكُمْ) متعلقان بالفعل قبلهما (إِذا) ظرفية شرطية غير جازمة (رَجَعْتُمْ) ماض وفاعله والجملة في محل جر بالإضافة (إِلَيْهِمْ) متعلقان بالفعل قبلهما (قُلْ) أمر فاعله مستتر (لا) ناهية جازمة (تَعْتَذِرُوا) مضارع مجزوم بحذف النون والواو فاعله (لَنْ) حرف ناصب (نُؤْمِنَ) مضارع منصوب والفاعل مستتر (لَكُمْ) متعلقان بنؤمن والجملة مقول القول (قَدْ) حرف تحقيق (نَبَّأَنَا) ماض ومفعوله الأول (اللَّهُ) لفظ الجلالة فاعل مؤخر (مِنْ أَخْبارِكُمْ) متعلقان بصفة للمفعول الثاني المحذوف (وَسَيَرَى اللَّهُ) حرف عطف والسين للاستقبال والفعل مضارع ولفظ الجلالة فاعله (عَمَلَكُمْ) مفعول به أول (وَرَسُولُهُ) عطف على لفظ الجلالة (ثُمَّ) حرف عطف (تُرَدُّونَ) مضارع مبني للمجهول والواو نائب فاعل (إِلى عالِمِ) متعلقان بالفعل (الْغَيْبِ) مضاف إليه (وَالشَّهادَةِ) عطف على الغيب (فَيُنَبِّئُكُمْ) الفاء عاطفة ومضارع ومفعوله الأول والفاعل مستتر (بِما) متعلقان بالمفعول الثاني المحذوف (كُنْتُمْ) كان واسمها والجملة صلة (تَعْمَلُونَ) مضارع وفاعله والجملة خبر كنتم.","surah_id":9,"source_id":7},{"ayah_number":95,"text":"(سَيَحْلِفُونَ) السين للاستقبال ومضارع وفاعله (بِاللَّهِ) متعلقان بالفعل قبلهما (لَكُمْ) متعلقان بحال محذوفة (إِذَا) ظرفية شرطية غير جازمة (انْقَلَبْتُمْ) ماض وفاعله والجملة في محل جر بالإضافة.\n(إِلَيْهِمْ) متعلقان بالفعل قبلهما (لِتُعْرِضُوا) مضارع منصوب بأن مضمرة بعد لام التعليل منصوب بحذف النون والواو فاعله (عَنْهُمْ) متعلقان بالفعل قبلهما (فَأَعْرِضُوا) الفاء الفصيحة وأمر وفاعله (عَنْهُمْ) متعلقان بالفعل قبلهما (إِنَّهُمْ) إن واسمها (رِجْسٌ) خبرها والجملة تعليلية (وَمَأْواهُمْ جَهَنَّمُ) الواو استئنافية ومبتدأ وخبره والجملة مستأنفة (جَزاءً) مفعول مطلق لفعل محذوف تقديره يجزون (بِما) متعلقان بجزاء (كانُوا) كان واسمها والجملة صلة (يَكْسِبُونَ) مضارع وفاعله والجملة خبر كنتم.","surah_id":9,"source_id":7},{"ayah_number":96,"text":"(يَحْلِفُونَ) مضارع وفاعله (لَكُمْ) متعلقان بيحلفون والجملة بدل من سيحلفون (لِتَرْضَوْا) مضارع منصوب بأن مضمرة والواو فاعله والمصدر المؤول في محل جر باللام (عَنْهُمْ) متعلقان بترضوا (فَإِنْ) الفاء الفصيحة وإن شرطية جازمة (تَرْضَوْا) مضارع مجزوم لأنه فعل الشرط والواو فاعله (عَنْهُمْ) متعلقان بترضوا (فَإِنَّ اللَّهَ) الفاء واقعة في جواب الشرط وإنّ ولفظ الجلالة اسمها والجملة في محل جزم جواب الشرط (لا) نافية (يَرْضى) مضارع مرفوع بالضمة المقدرة على الألف للتعذر والفاعل مستتر (عَنِ الْقَوْمِ) متعلقان بيرضى (الْفاسِقِينَ) صفة القوم.","surah_id":9,"source_id":7},{"ayah_number":97,"text":"(الْأَعْرابُ أَشَدُّ) مبتدأ وخبر (كُفْراً) تمييز والجملة مستأنفة (وَنِفاقاً) معطوف على كفرا (وَأَجْدَرُ) معطوف على أشد (أَلَّا) مركبة من أن الناصبة ولا النافية (يَعْلَمُوا) مضارع منصوب بأن وعلامة نصبه حذف النون والواو فاعله وأن وما بعدها في تأويل مصدر منصوب بنزع الخافض (حُدُودَ) مفعول به (ما) موصولية في محل جر بالإضافة (أَنْزَلَ اللَّهُ) ماض ولفظ الجلالة فاعل والجملة صلة (عَلى رَسُولِهِ) متعلقان بأنزل والهاء مضاف إليه (وَاللَّهُ عَلِيمٌ حَكِيمٌ) الواو استئنافية ولفظ الجلالة مبتدأ وخبراه والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":98,"text":"(وَمِنَ الْأَعْرابِ) الواو استئنافية ومتعلقان بخبر مقدم محذوف (مِنَ) موصولية مبتدأ (يَتَّخِذُ) مضارع مرفوع فاعله مستتر والجملة صلة (ما) موصولية مفعول به أول (يُنْفِقُ) مضارع فاعله مستتر والجملة صلة (مَغْرَماً) مفعول به ثان ليتخذ (وَيَتَرَبَّصُ) معطوف على يتخذ وإعرابه مثله (بِكُمُ) متعلقان بيتربص (الدَّوائِرَ) مفعول به (عَلَيْهِمْ) متعلقان بالخبر المقدم (دائِرَةُ) مبتدأ مؤخر (السَّوْءِ) مضاف إليه (وَاللَّهُ سَمِيعٌ عَلِيمٌ) الواو عاطفة ومبتدأ وخبراه.","surah_id":9,"source_id":7},{"ayah_number":99,"text":"(وَمِنَ الْأَعْرابِ مَنْ يُؤْمِنُ) سبق إعراب مثلها في الآية المتقدمة (بِاللَّهِ) متعلقان بيؤمن (وَالْيَوْمِ) معطوف على ما قبله (الْآخِرِ) صفة لليوم والجملة صلة (وَيَتَّخِذُ) مضارع فاعله مستتر والجملة معطوفة (ما) موصولية مفعول به أول (يُنْفِقُ) مضارع فاعله مستتر (قُرُباتٍ) مفعول به ثان منصوب بالكسرة لأنه جمع مؤنث سالم (عِنْدَ) ظرف مكان في محل نصب صفة لقربات (اللَّهِ) لفظ الجلالة مضاف إليه (وَصَلَواتِ) معطوف على قربات (الرَّسُولِ) مضاف إليه (أَلا) حرف تنبيه (إِنَّها قُرْبَةٌ) إن واسمها وخبرها (لَهُمْ) متعلقان بقربة والجملة مستأنفة (سَيُدْخِلُهُمُ اللَّهُ) السين للاستقبال ومضارع ولفظ الجلالة فاعله والهاء مفعوله (فِي رَحْمَتِهِ) متعلقان بيدخلهم والهاء مضاف إليه (إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ) إن واسمها وخبراها والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":100,"text":"(وَالسَّابِقُونَ) الواو عاطفة ومبتدأ مرفوع بالواو لأنه جمع مذكر سالم (مِنَ الْمُهاجِرِينَ) متعلقان برضي (وَالْأَنْصارِ) معطوف على المهاجرين (وَالَّذِينَ) اسم موصول معطوف على الأنصار (اتَّبَعُوهُمْ) ماض وفاعله ومفعوله والجملة صلة (رَضِيَ اللَّهُ) ماض وفاعله والجملة خبر السابقون (عَنْهُمْ) متعلقان برضي (وَرَضُوا) ماض وفاعله والجملة معطوفة (عَنْهُ) متعلقان برضوا (وَأَعَدَّ) ماض فاعله مستتر والجملة معطوفة (لَهُمْ) متعلقان بأعد (جَنَّاتٍ) مفعول به منصوب بالكسرة لأنه جمع مؤنث سالم (تَجْرِي) مضارع (تَحْتَهَا) متعلقان بتجري (الْأَنْهارُ) فاعل والجملة صفة لجنات (خالِدِينَ) حال (فِيها) متعلقان بخالدين (أَبَداً) ظرف زمان متعلق بخالدين (ذلِكَ) اسم إشارة مبتدأ واللام للبعد والكاف للخطاب والجملة مستأنفة (الْفَوْزُ) خبر (الْعَظِيمُ) صفة.","surah_id":9,"source_id":7},{"ayah_number":101,"text":"(وَمِمَّنْ) الواو استئنافية من: حرف جر ومن: اسم موصول والجار والمجرور متعلقان بخبر مقدم محذوف (حَوْلَكُمْ) ظرف مكان متعلق بصلة الموصول المحذوفة والكاف مضاف إليه (مِنَ الْأَعْرابِ) متعلقان بمحذوف حال (مُنافِقُونَ) مبتدأ مؤخر مرفوع بالواو لأنه جمع مذكر سالم.\n(وَمِنْ أَهْلِ) معطوف على وممّن ومتعلق بالخبر المحذوف (الْمَدِينَةِ) مضاف إليه (مَرَدُوا عَلَى النِّفاقِ) ماض وفاعله والجار والمجرور متعلقان بالفعل مردوا والجملة صفة المنافقون (لا) نافية.\n(تَعْلَمُهُمْ) مضارع فاعله مستتر والهاء مفعول به والجملة مستأنفة (نَحْنُ) مبتدأ والجملة مستأنفة.\n(نَعْلَمُهُمْ) مضارع فاعله مستتر والهاء مفعوله والجملة خبر (سَنُعَذِّبُهُمْ) السين للاستقبال ومضارع فاعله مستتر والهاء مفعوله والجملة مستأنفة (مَرَّتَيْنِ) نائب مفعول مطلق منصوب بالياء لأنه مثنى (ثُمَّ) عاطفة (يُرَدُّونَ) مضارع مبني للمجهول والواو نائب فاعل (إِلى عَذابٍ) متعلقان بيردون (عَظِيمٍ) صفة والجملة معطوفة","surah_id":9,"source_id":7},{"ayah_number":102,"text":"(وَآخَرُونَ) مبتدأ والجملة معطوفة (اعْتَرَفُوا) ماض وفاعله والجملة صفة آخرون (بِذُنُوبِهِمْ) متعلقان باعترفوا (خَلَطُوا) ماض وفاعله والجملة خبر (عَمَلًا) مفعول به (صالِحاً) صفة (وَآخَرَ) معطوف على عملا (سَيِّئاً) صفة آخر.\n(عَسَى) من أفعال الرجاء يرفع الاسم وبنصب الخبر (اللَّهُ) لفظ الجلالة اسمها (أَنْ) ناصبة (يَتُوبَ) مضارع منصوب بأن والفاعل مستتر (عَلَيْهِمْ) متعلقان بيتوب (إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ) إن واسمها وخبراها والجملة تعليل لا محل لها.","surah_id":9,"source_id":7},{"ayah_number":103,"text":"(خُذْ) أمر فاعله مستتر والجملة مستأنفة (مِنْ أَمْوالِهِمْ) متعلقان بخذ والهاء مضاف إليه (صَدَقَةً) مفعول به (تُطَهِّرُهم)...............................\nخذ وهو أمر مبني على حذف حرف العلة وفاعله مستتر (عَلَيْهِمْ) متعلقان بصل (إِنَّ صَلاتَكَ) إن واسمها (سَكَنٌ) خبرها والجملة تعليل (لَهُمْ) متعلقان بسكن (وَاللَّهُ سَمِيعٌ عَلِيمٌ) مبتدأ وخبراه والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":104,"text":"(أَلَمْ) الهمزة استفهامية وحرف جازم (يَعْلَمُوا) مضارع مجزوم بحذف النون لأنه من الأفعال الخمسة والواو فاعله والجملة مستأنفة (أَنَّ اللَّهَ) أن واسمها والمصدر المؤول من أن واسمها وخبرها سد مسد مفعولي يعلموا (هُوَ) مبتدأ والجملة خبر أن (يَقْبَلُ) مضارع فاعله مستتر (التَّوْبَةَ) مفعول به والجملة خبر هو (عَنْ عِبادِهِ) متعلقان بيقبل (وَيَأْخُذُ) الواو عاطفة ومضارع فاعله مستتر والجملة معطوفة (الصَّدَقاتِ) مفعول به منصوب بالكسرة جمع مؤنث سالم (وَأَنَّ اللَّهَ) إن واسمها والجملة معطوفة (هُوَ) مبتدأ (التَّوَّابُ الرَّحِيمُ) خبران للمبتدأ والجملة خبر أن","surah_id":9,"source_id":7},{"ayah_number":105,"text":"«وَقُلِ» الواو استئنافية وأمر فاعله مستتر والجملة مستأنفة «اعْمَلُوا» أمر وفاعله والجملة مقول القول «فَسَيَرَى اللَّهُ عَمَلَكُمْ» الفاء عاطفة ومضارع ولفظ الجلالة فاعله وعملكم مفعول به والكاف مضاف إليه «وَرَسُولُهُ وَالْمُؤْمِنُونَ» معطوفان على ما سبق «وَسَتُرَدُّونَ» مضارع مبني للمجهول مرفوع بثبوت النون والواو نائب فاعل والجملة معطوفة «إِلى عالِمِ» متعلقان بستردون «الْغَيْبِ» مضاف إليه «وَالشَّهادَةِ» معطوف على ما قبله «فَيُنَبِّئُكُمْ» الفاء عاطفة ومضارع ومفعوله والفاعل مستتر والجملة معطوفة «بِما» متعلقان بالفعل قبلهما «كُنْتُمْ» كان واسمها والجملة صلة «تَعْمَلُونَ» مضارع مرفوع بثبوت النون والواو فاعله والجملة خبر كنتم.","surah_id":9,"source_id":7},{"ayah_number":106,"text":"«وَآخَرُونَ» الواو استئنافية ومبتدأ مرفوع بالواو لأنه جمع مذكر سالم «مُرْجَوْنَ» صفة لآخرون «لِأَمْرِ» متعلقان بمرجون «اللَّهِ» لفظ الجلالة مضاف إليه «إِمَّا» أداة شرط وتفصيل «يُعَذِّبُهُمْ» مضارع فاعله مستتر والهاء مفعوله والجملة خبر «وَإِمَّا» معطوفة على ما سبقها «يَتُوبُ» مضارع فاعله مستتر «عَلَيْهِمْ» متعلقان بيتوب «وَاللَّهُ عَلِيمٌ حَكِيمٌ» مبتدأ وخبراه والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":107,"text":"(وَالَّذِينَ) الواو استئنافية واسم الموصول مبتدأ (اتَّخَذُوا) ماض وفاعله والجملة صلة (مَسْجِداً) مفعول به (ضِراراً) مفعول لأجله (وَكُفْراً وَتَفْرِيقاً) معطوفان على ضرارا (بَيْنَ) ظرف مكان متعلق بتفريقا (الْمُؤْمِنِينَ) مضاف إليه (وَإِرْصاداً) معطوف على ما سبق (لِمَنْ) اللام حرف جر ومن اسم موصول متعلقان بإرصادا (حارَبَ اللَّهَ) ماض ولفظ الجلالة مفعوله والفاعل مستتر والجملة صلة (وَرَسُولَهُ) معطوف (مِنْ قَبْلُ) متعلقان بحارب وقبل ظرف مبني على الضم لأنه مقطوع عن الإضافة، في محل جر (وَلَيَحْلِفُنَّ) الواو عاطفة واللام للابتداء ومضارع مرفوع بثبوت النون وحذفت لكراهة توالي الأمثال والواو المحذوفة فاعله حذفت لالتقاء الساكنين ونون التوكيد حرف لا محل له (إِنْ) نافية (أَرَدْنا) ماض وفاعله والجملة مقول القول (إِلَّا) أداة حصر (الْحُسْنى) مفعول به منصوب بالفتحة المقدرة على الألف للتعذر (وَاللَّهُ) الواو عاطفة ولفظ الجلالة مبتدأ والجملة معطوفة (يَشْهَدُ) مضارع فاعله مستتر (إِنَّهُمْ) إن واسمها والجملة تعليل (لَكاذِبُونَ) اللام المزحلقة وكاذبون خبر مرفوع بالواو لأنه جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":108,"text":"(لا) ناهية جازمة (تَقُمْ) مضارع فاعله مستتر والجملة مستأنفة (فِيهِ) متعلقان بتقم (أَبَداً) ظرف زمان متعلق بتقم (لَمَسْجِدٌ) اللام لام الابتداء ومسجد مبتدأ والجملة مستأنفة (أُسِّسَ) ماض مبني للمجهول ونائب الفاعل مستتر (عَلَى التَّقْوى) متعلقان بأسس (مِنْ أَوَّلِ) متعلقان بأسس (يَوْمٍ) مضاف إليه (أَحَقُّ) خبر مسجد (أَنْ تَقُومَ) مضارع منصوب بأن والفاعل مستتر (فِيهِ) متعلقان بتقوم وأن وما بعدها في تأويل مصدر في محل نصب بنزع الخافض (فِيهِ) متعلقان بخبر مقدم محذوف (رِجالٌ) مبتدأ مؤخر والجملة مستأنفة (يُحِبُّونَ) مضارع مرفوع بثبوت النون والواو فاعله والجملة صفة لرجال (أَنْ) ناصبة (يَتَطَهَّرُوا) مضارع منصوب بأن والواو فاعله والجملة مفعول يحبون (وَاللَّهُ) الواو استئنافية ولفظ الجلالة مبتدأ والجملة مستأنفة (يُحِبُّ الْمُطَّهِّرِينَ) مضارع ومفعوله والفاعل مستتر والجملة خبر","surah_id":9,"source_id":7},{"ayah_number":109,"text":"(أَفَمَنْ) الهمزة للاستفهام والفاء استئنافية ومن اسم موصول مبتدأ والجملة مستأنفة (أَسَّسَ بُنْيانَهُ) ماض ومفعوله والهاء في محل جر بالإضافة والفاعل مستتر والجملة صلة (عَلى تَقْوى) متعلقان بأسس (مِنَ اللَّهِ) متعلقان بمحذوف صفة تقوى (وَرِضْوانٍ) معطوف على تقوى (خَيْرٌ) خبر من (أَمْ) حرف عطف (مِنَ) معطوفة على من السابقة فهي مبتدأ (أَسَّسَ بُنْيانَهُ) الجملة صلة (عَلى شَفا) متعلقان بأسس (جُرُفٍ) مضاف إليه (هارٍ) صفة جرف (فَانْهارَ) الفاء عاطفة وماض فاعله مستتر (بِهِ) متعلقان بانهار (فِي نارِ) متعلقان بالفعل (جَهَنَّمَ) مضاف إليه مجرور بالفتحة لأنه ممنوع من الصرف والجملة معطوفة (وَاللَّهُ) الواو استئنافية ولفظ الجلالة مبتدأ (لا) نافية (يَهْدِي) مضارع مرفوع بالضمة المقدرة على الياء للثقل والفاعل مستتر والجملة خبر (الْقَوْمَ) مفعول به (الظَّالِمِينَ) صفة القوم منصوبة بالياء لأنها جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":110,"text":"(لا) نافية (يَزالُ) مضارع ناقص والجملة مستأنفة (بُنْيانُهُمُ) اسمها مرفوع والهاء مضاف إليه (الَّذِي) اسم موصول صفة بنيانهم (بَنَوْا) ماض مبني على الضم المقدر على الألف المحذوفة والواو فاعل والجملة صلة (رِيبَةً) خبر لا يزال منصوب (فِي قُلُوبِهِمْ) متعلقان بصفة محذوفة لريبة (إِلَّا) أداة استثناء (أَنْ) ناصبة (تَقَطَّعَ) مضارع منصوب بأن (قُلُوبِهِمْ) فاعل والهاء مضاف إليه والجملة في محل نصب على الاستثناء (وَاللَّهُ عَلِيمٌ حَكِيمٌ) الواو استئنافية ومبتدأ وخبراه والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":111,"text":"(إِنَّ اللَّهَ) حرف مشبه بالفعل ولفظ الجلالة اسمه والجملة مستأنفة (اشْتَرى) ماض فاعله مستتر والجملة خبر (مِنَ الْمُؤْمِنِينَ) متعلقان باشترى (أَنْفُسَهُمْ) مفعول به والهاء مضاف إليه (وَأَمْوالَهُمْ) معطوف على أنفسهم (بِأَنَّ) الباء حرف جر وحرف مشبه بالفعل (لَهُمُ) متعلقان بالخبر المقدم (الْجَنَّةَ) اسم أن وأن وما بعدها في تأويل مصدر في محل جر بالباء والجار والمجرور متعلقان باشترى (يُقاتِلُونَ) مضارع والواو فاعله (فِي سَبِيلِ اللَّهِ) متعلقان بيقاتلون ولفظ الجلالة مضاف إليه والجملة مستأنفة (فَيَقْتُلُونَ) الفاء عاطفة والمضارع مرفوع بثبوت النون والواو فاعله والجملة معطوفة (وَيُقْتَلُونَ) مضارع مبني للمجهول والواو نائب فاعل والجملة معطوفة (وَعْداً) مفعول مطلق لفعل محذوف (عَلَيْهِ) متعلقان بمحذوف صفة وعدا (حَقًّا) مفعول مطلق لفعل محذوف (فِي التَّوْراةِ) متعلقان بمحذوف صفة وعدا (وَالْإِنْجِيلِ) معطوف على التوراة (وَالْقُرْآنِ) معطوف على ما قبله (وَمَنْ) الواو استئنافية ومن اسم استفهام مبتدأ والجملة مستأنفة (أَوْفى) خبر مرفوع بالضمة المقدرة على الألف للتعذر (بِعَهْدِهِ) متعلقان بأوفى (مِنَ اللَّهِ) متعلقان بأوفى (فَاسْتَبْشِرُوا) الفاء الفصيحة وفعل أمر مبني على حذف النون والواو فاعله والجملة لا محل لها جواب شرط غير جازم (بِبَيْعِكُمُ) متعلقان باستبشروا (الَّذِي) موصول في محل جر صفة (بايَعْتُمْ) ماض والتاء فاعله والجملة صلة (بِهِ) متعلقان ببايعتم (وَذلِكَ) الواو استئنافية واسم الإشارة مبتدأ واللام للبعد والكاف للخطاب والجملة مستأنفة (هُوَ) ضمير فصل (الْفَوْزُ) خبر المبتدأ (الْعَظِيمُ) صفة والجملة خبر ذلك.","surah_id":9,"source_id":7},{"ayah_number":112,"text":"(التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الْآمِرُونَ) هذه أخبار متعددة لمبتدأ متقدم مرفوعة بالواو لأنها جمع مذكر سالم.\n(بِالْمَعْرُوفِ) متعلقان بالآمرون (وَالنَّاهُونَ) معطوف على ما قبله (عَنِ الْمُنْكَرِ) متعلقان بالناهون (وَالْحافِظُونَ) معطوف على ما قبله (لِحُدُودِ) متعلقان بالحافظون (اللَّهِ) لفظ الجلالة مضاف إليه (وَبَشِّرِ) الواو استئنافية وأمر فاعله مستتر (الْمُؤْمِنِينَ) مفعول به منصوب بالياء والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":113,"text":"(ما) نافية (كانَ) ماض ناقص والجملة مستأنفة (لِلنَّبِيِّ) متعلقان بمحذوف خبر (وَالَّذِينَ) اسم موصول معطوف على النبي (آمَنُوا) ماض وفاعله والجملة صلة (أَنْ يَسْتَغْفِرُوا) مضارع منصوب بأن وعلامة نصبه حذف النون والواو فاعله والمصدر المؤول في محل رفع اسم كان المؤخر (لِلْمُشْرِكِينَ) متعلقان بيستغفروا (وَلَوْ) الواو حالية ولو شرطية غير جازمة (كانُوا) كان واسمها والجملة حالية (أُولِي) خبر منصوب بالياء لأنه ملحق بجمع المذكر السالم (قُرْبى) مضاف إليه مجرور بالكسرة المقدرة على الألف للتعذر (مِنْ بَعْدِ) متعلقان بيستغفروا (ما) اسم موصول مضاف إليه (تَبَيَّنَ) ماض مبني على الفتح (لَهُمْ) متعلقان بتبين (أَنَّهُمْ) أن واسمها (أَصْحابُ) خبر أن والمصدر المؤول في محل رفع فاعل لتبين (الْجَحِيمِ) مضاف إليه.","surah_id":9,"source_id":7},{"ayah_number":114,"text":"(وَما) الواو استئنافية وما نافية (كانَ) ماض ناقص (اسْتِغْفارُ) اسمها (إِبْراهِيمَ) مضاف إليه مجرور بالفتحة لأنه ممنوع من الصرف والجملة مستأنفة (لِأَبِيهِ) متعلقان باستغفار مجرور بالياء لأنه من الأسماء الخمسة والهاء مضاف إليه (إِلَّا) أداة حصر (عَنْ مَوْعِدَةٍ) متعلقان بخبر محذوف لكان (وَعَدَها) ماض ومفعوله الأول والفاعل مستتر والجملة صفة لموعدة (إِيَّاهُ) مفعول به ثان (فَلَمَّا) الفاء استئنافية ولما ظرف زمان (تَبَيَّنَ) ماض (لَهُ) متعلقان بتبين (أَنَّهُ عَدُوٌّ) أن واسمها وخبرها والجملة في تأويل مصدر في محل رفع فاعل تبين (لِلَّهِ) متعلقان بعدو (تَبَرَّأَ) ماض وفاعله مستتر والجملة لا محل لها لأنها جواب شرط غير جازم (مِنْهُ) متعلقان بتبرأ (إِنَّ إِبْراهِيمَ) إنّ واسمها (لَأَوَّاهٌ) اللام المزحلقة وأواه خبر (حَلِيمٌ) خبر ثان والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":115,"text":"(وَما) الواو استئنافية وما نافية (كانَ اللَّهُ) لفظ الجلالة اسمها والجملة مستأنفة (لِيُضِلَّ قَوْماً) اللام لام الجحود ومضارع منصوب بأن المضمرة وقوما مفعول به والفاعل مستتر (بَعْدَ) ظرف زمان متعلق بيضل (إِذْ) ظرف مضاف إلى بعد (هَداهُمْ) ماض ومفعوله والفاعل مستتر والجملة في محل جر بالإضافة (حَتَّى) حرف غاية وجر (يُبَيِّنَ) مضارع منصوب بأن المضمرة بعد حتى والفاعل مستتر (لَهُمْ) متعلقان بيبين (ما) موصولية مفعول به (يَتَّقُونَ) مضارع مرفوع بثبوت النون والواو فاعله والجملة صلة  (إِنَّ اللَّهَ) إن ولفظ الجلالة اسمها (بِكُلِّ) متعلقان بعليم (شَيْءٍ) مضاف إليه (عَلِيمٌ) خبر والجملة مستأنفة","surah_id":9,"source_id":7},{"ayah_number":116,"text":"(إِنَّ اللَّهَ) إن واسمها والجملة مستأنفة (لَهُ) متعلقان بخبر مقدم (مُلْكُ) مبتدأ مؤخر والجملة خبر إن (السَّماواتِ) مضاف إليه (وَالْأَرْضِ) معطوف على السموات (يُحْيِي) مضارع مرفوع بالضمة المقدرة على الياء للثقل والفاعل مستتر والجملة خبر ثان لإن (وَيُمِيتُ) مضارع معطوف على يحيي (وَما) الواو عاطفة وما نافية (لَكُمْ) متعلقان بالخبر المحذوف (مِنْ دُونِ) متعلقان بحال محذوفة (اللَّهَ) مضاف إليه (مِنْ وَلِيٍّ) من حرف جر زائد وولي اسم مجرور لفظا مرفوع محلا مبتدأ مؤخر (وَلا) الواو عاطفة ولا زائدة (نَصِيرٍ) معطوف على من ولي.","surah_id":9,"source_id":7},{"ayah_number":117,"text":"(لَقَدْ) اللام واقعة في جواب القسم المحذوف وقد حرف تحقيق (تابَ اللَّهُ) ماض ولفظ الجلالة فاعله والجملة جواب قسم محذوف (عَلَى النَّبِيِّ) متعلقان بتاب (الْمُهاجِرِينَ وَالْأَنْصارِ) معطوف على ما سبق (الَّذِينَ) اسم موصول صفة لما قبله (اتَّبَعُوهُ) ماض وفاعله ومفعوله والجملة صلة (فِي ساعَةِ) متعلقان باتبعوا (الْعُسْرَةِ) مضاف إليه (مِنْ بَعْدِ) متعلقان باتبعوا (ما) نافية (كادَ) ماض ناقص واسمه محذوف والجملة مضاف إليه (يَزِيغُ) مضارع (قُلُوبُ) فاعل (فَرِيقٍ) مضاف إليه (مِنْهُمْ) متعلقان بفريق (ثُمَّ) عاطفة (تابَ) ماض فاعله مستتر والجملة معطوفة (عَلَيْهِمْ) متعلقان بتاب (إِنَّهُ) إن واسمها والجملة مستأنفة (بِهِمْ) متعلقان بالخبر (رَؤُفٌ رَحِيمٌ) خبران لإنّ","surah_id":9,"source_id":7},{"ayah_number":118,"text":"(وَعَلَى الثَّلاثَةِ) عطف على ما قبله (الَّذِينَ) اسم موصول صفة لثلاثة (خُلِّفُوا) ماض مبني للمجهول والواو نائب فاعل والجملة صلة (حَتَّى) حرف غاية وجر (إِذا) ظرف زمان يتضمن معنى الشرط (ضاقَتْ) ماض والتاء للتأنيث (عَلَيْهِمُ) متعلقان بضاقت (أَنْفُسُهُمْ) فاعل والجملة معطوفة (وَظَنُّوا) ماض وفاعله والجملة معطوفة (أَنْ) مخففة من أنّ واسمه ضمير الشأن والمصدر المؤول من أن وما بعدها سد مسد مفعولي ظن و(لا) نافية للجنس (مَلْجَأَ) اسم لا (مِنَ اللَّهِ) متعلقان بالخبر المحذوف (إِلَّا) أداة حصر (إِلَيْهِ) متعلقان بمحذوف بدل من اللّه (ثُمَّ) حرف عطف (تابَ) ماض فاعله مستتر والجملة معطوفة (عَلَيْهِمُ) متعلقان بتاب (لِيَتُوبُوا) اللام لام التعليل ومضارع منصوب بأن مضمرة بعد لام التعليل والمصدر المؤول في محل جر باللام والجار والمجرور متعلقان بتاب (إِنَّ اللَّهَ) إن واسمها (هُوَ) ضمير فصل (التَّوَّابُ الرَّحِيمُ) خبران لإن والجملة مستأنفة.","surah_id":9,"source_id":7},{"ayah_number":119,"text":"(يا) أداة نداء (أَيُّهَا) منادى نكرة مقصودة مبني على الضم في محل نصب والها للتنبيه والجملة لا محل لها (الَّذِينَ) اسم موصول بدل أو عطف بيان (آمَنُوا) ماض وفاعله والجملة صلة (اتَّقُوا اللَّهَ) أمر وفاعله ومفعوله والجملة ابتدائية (وَكُونُوا) كان واسمها والجملة معطوفة (مَعَ) ظرف مكان متعلق بالخبر المحذوف (الصَّادِقِينَ) مضاف إليه مجرور بالياء لأنه جمع مذكر سالم","surah_id":9,"source_id":7},{"ayah_number":120,"text":"(ما) نافية (كانَ لِأَهْلِ الْمَدِينَةِ) كان والجار والمجرور متعلقان بالخبر المحذوف المقدم (وَمَنْ) الواو عاطفة ومن اسم موصول معطوف على أهل (حَوْلَهُمْ) ظرف مكان متعلق بصلة الموصول والهاء مضاف إليه (مِنَ الْأَعْرابِ) حال (أَنْ) ناصبة (يَتَخَلَّفُوا) مضارع منصوب بأن وعلامة نصبه حذف النون والواو فاعل والجملة في محل رفع اسم كان (عَنْ رَسُولِ) متعلقان بيتخلفوا (اللَّهِ) لفظ الجلالة مضاف إليه (وَلا يَرْغَبُوا) الواو عاطفة ولا نافية ومضارع منصوب بحذف النون والواو فاعل (بِأَنْفُسِهِمْ) متعلقان بيرغبوا (عَنْ نَفْسِهِ) متعلقان بيرغبوا والهاء مضاف إليه (ذلِكَ) اسم اشارة مبتدأ واللام للبعد والكاف للخطاب والجملة مستأنفة (بِأَنَّهُمْ) الباء حرف جر وأن وما بعدها في تأويل مصدر في محل جر ومتعلقان بخبر المبتدأ المحذوف (لا) نافية (يُصِيبُهُمْ) مضارع ومفعوله والجملة خبر أنّ (ظَمَأٌ) فاعل (وَلا) الواو عاطفة ولا زائدة (نَصَبٌ وَلا مَخْمَصَةٌ) معطوف على ما قبله (فِي سَبِيلِ) متعلقان بمحذوف صفة مما تقدم (اللَّهِ) لفظ الجلالة مضاف إليه (وَلا) الواو عاطفة ولا نافية (يَطَؤُنَ) مضارع مرفوع بثبوت النون والواو فاعل والجملة معطوفة (مَوْطِئاً) مفعول مطلق (يَغِيظُ) مضارع فاعله مستتر (الْكُفَّارَ) مفعول به والجملة صفة لموطئا (وَلا) الواو عاطفة ولا نافية (يَنالُونَ) معطوف على ما قبله (مِنْ عَدُوٍّ) متعلقان بينالون (نَيْلًا) مفعول مطلق (إِلَّا) أداة حصر (كُتِبَ) ماض مبني للمجهول (لَهُمْ) متعلقان بكتب (بِهِ) متعلقان بكتب (عَمَلٌ) نائب فاعل (صالِحٌ) صفة لعمل (إِنَّ اللَّهَ) إن واسمها والجملة مستأنفة (لا) نافية (يُضِيعُ) مضارع وفاعله مستتر والجملة خبر إن (أَجْرَ) مفعول به (الْمُحْسِنِينَ) مضاف إليه مجرور بالياء لأنه جمع مذكر سالم.","surah_id":9,"source_id":7},{"ayah_number":121,"text":"(وَلا) الواو عاطفة ولا نافية (يُنْفِقُونَ) مضارع مرفوع بثبوت النون والواو فاعله والجملة معطوفة (نَفَقَةً) مفعول به (صَغِيرَةً) صفة (وَلا كَبِيرَةً) عطف على صغيرة (وَلا يَقْطَعُونَ) الجملة معطوفة والإعراب واضح (وادِياً) مفعول به (إِلَّا) أداة حصر (كُتِبَ) ماض مبني للمجهول (لَهُمْ) متعلقان بكتب (لِيَجْزِيَهُمُ) اللام لام التعليل ومضارع منصوب بأن مضمرة والمصدر المؤول في محل جر باللام والجار والمجرور متعلقان بكتب (اللَّهُ) لفظ الجلالة فاعل (أَحْسَنَ) مفعول به (ما) موصولية مضاف إليه (كانُوا) كان واسمها والجملة صلة (يَعْمَلُونَ) مضارع مرفوع بثبوت النون والواو فاعله والجملة خبر كانوا","surah_id":9,"source_id":7},{"ayah_number":122,"text":"(وَما) الواو استئنافية وما نافية (كانَ الْمُؤْمِنُونَ) كان واسمها المرفوع بالواو لأنه جمع مذكر سالم والجملة مستأنفة (لِيَنْفِرُوا) اللام لام الجحود ومضارع منصوب بأن مضمرة بعد لام الجحود والواو فاعل والمصدر المؤول من أن والفعل في محل جر باللام ومتعلقان بخبر كان (كَافَّةً) حال (فَلَوْ لا) الفاء استئنافية ولو لا حرف تحضيض (نَفَرَ) فعل ماض (مِنْ كُلِّ) متعلقان بنفر (فِرْقَةٍ) مضاف إليه (مِنْهُمْ) متعلقان بحال محذوفة (طائِفَةٌ) فاعل (لِيَتَفَقَّهُوا) مضارع منصوب بأن المضمرة بعد لام التعليل والواو فاعله والمصدر المؤول في محل جر باللام وهما متعلقان بنفر (فِي الدِّينِ) متعلقان بيتفقهوا (وَلِيُنْذِرُوا) معطوف على ما سبق (قَوْمَهُمْ) مفعول به والهاء مضاف إليه (إِذا) ظرف متضمن معنى الشرط (رَجَعُوا) ماض وفاعله والجملة في محل جر بالإضافة (إِلَيْهِمْ) متعلقان برجعوا (لَعَلَّهُمْ) لعل واسمها والجملة تعليل لا محل لها (يَحْذَرُونَ) مضارع مرفوع بثبوت النون والواو فاعل والجملة خبر لعل.","surah_id":9,"source_id":7},{"ayah_number":123,"text":"(يا) أداة نداء (أَيُّهَا) منادى نكرة مقصودة وها للتنبيه والجملة لا محل لها (الَّذِينَ) اسم موصول بدل من أي (آمَنُوا) ماض وفاعله والجملة صلة (قاتِلُوا) أمر مبني على حذف النون والواو فاعله (الَّذِينَ) اسم موصول مفعول به (يَلُونَكُمْ) مضارع مرفوع بثبوت النون والواو فاعل والكاف مفعول به والجملة صلة (مِنَ الْكُفَّارِ) متعلقان بيلونكم (وَلْيَجِدُوا) الواو عاطفة ومضارع مجزوم بلام الأمر وعلامة جزمه حذف النون والجملة معطوفة (فِيكُمْ) متعلقان بيجدوا (غِلْظَةً) مفعول به (وَاعْلَمُوا) الواو عاطفة وأمر مبني على حذف النون والواو فاعله والجملة معطوفة (أَنَّ اللَّهَ) أن واسمها (مَعَ الْمُتَّقِينَ) مع ظرف مكان والمتقين مضاف إليه مجرور بالياء لأنه جمع مذكر سالم والمصدر المؤول من أن وما بعدها سد مسد مفعولي اعلموا","surah_id":9,"source_id":7},{"ayah_number":124,"text":"(وَإِذا) الواو استئنافية وإذا ظرفية شرطية غير جازمة (ما) زائدة (أُنْزِلَتْ سُورَةٌ) ماض مبني للمجهول ونائب فاعل والتاء في أنزلت للتأنيث والجملة مضاف إليه.","surah_id":9,"source_id":7},{"ayah_number":125,"text":"مَرَّةوع بثبوت النون والواو فاعله والجملة صفة لقوم","surah_id":9,"source_id":7},{"ayah_number":126,"text":"","surah_id":9,"source_id":7},{"ayah_number":127,"text":"","surah_id":9,"source_id":7},{"ayah_number":128,"text":"(لَقَدْ) اللام واقعة في جواب قسم محذوف وقد حرف تحقيق (جاءَكُمْ) ماض ومفعوله (رَسُولٌ) فاعل (مِنْ أَنْفُسِكُمْ) متعلقان بمحذوف صفة لرسول والجملة جواب قسم لا محل لها (عَزِيزٌ) خبر مقدم (عَلَيْهِ) متعلقان بعزيز (ما) موصولة مبتدأ والجملة صفة لرسول (عَنِتُّمْ) ماض وفاعله والجملة صلة (حَرِيصٌ) صفة لرسول (عَلَيْكُمْ) متعلقان بحريص (بِالْمُؤْمِنِينَ) متعلقان برؤوف (رَؤُفٌ رَحِيمٌ) صفتان لرسول","surah_id":9,"source_id":7},{"ayah_number":129,"text":"(فَإِنْ) الفاء استئنافية وإن شرطية (تَوَلَّوْا) ماض مبني على الضم والواو فاعله والجملة مستأنفة (فَقُلْ) الفاء رابطة لجواب الشرط وأمر فاعله مستتر والجملة في محل جزم جواب الشرط (حَسْبِيَ) مبتدأ مرفوع بالضمة المقدرة على ما قبل ياء المتكلم والياء مضاف إليه (اللَّهُ) لفظ الجلالة خبر والجملة مقول القول (لا) نافية للجنس تعمل عمل إنّ (إِلهَ) اسم لا (إِلَّا) أداة حصر (هُوَ) بدل من الضمير المستكن في الخبر المحذوف والجملة مقول القول (عَلَيْهِ) متعلقان بتوكلت (تَوَكَّلْتُ) ماض وفاعله والجملة مستأنفة (وَهُوَ) الواو حالية هو مبتدأ والجملة حال (رَبُّ) خبر (الْعَرْشِ) مضاف إليه (الْعَظِيمِ) صفة.","surah_id":9,"source_id":7}]