[{"ayah_number":1,"text":"(وَالسَّماءِ) جار ومجرور متعلقان بفعل محذوف تقديره أقسم (وَالطَّارِقِ) معطوف على السماء.","surah_id":86,"source_id":7},{"ayah_number":2,"text":"(وَما) الواو حرف عطف (ما) اسم استفهام مبتدأ (أَدْراكَ) ماض ومفعوله والفاعل مستتر والجملة الفعلية خبر المبتدأ وجملة ما أدراك.. معطوفة على ما قبلها (مَا الطَّارِقُ) مبتدأ وخبره والجملة سدت مسد مفعول أدراك الثاني.","surah_id":86,"source_id":7},{"ayah_number":3,"text":"(النَّجْمُ) خبر لمبتدأ محذوف تقديره هو (الثَّاقِبُ) صفة والجملة الاسمية حال.","surah_id":86,"source_id":7},{"ayah_number":4,"text":"(إِنْ) حرف نفي (كُلُّ نَفْسٍ) مبتدأ مضاف إلى نفس (لَمَّا) حرف حصر (عَلَيْها حافِظٌ) خبر مقدم ومبتدأ مؤخر والجملة الاسمية خبر كل وجملة إن.. جواب القسم لا محل لها.","surah_id":86,"source_id":7},{"ayah_number":5,"text":"(فَلْيَنْظُرِ) الفاء حرف استئناف ومضارع مجزوم بلام الأمر (الْإِنْسانُ) فاعل والجملة مستأنفة (مِمَّ) متعلقان بما بعدهما (خُلِقَ) ماض مبني للمجهول ونائب الفاعل مستتر والجملة مفعول به.","surah_id":86,"source_id":7},{"ayah_number":6,"text":"(خُلِقَ) ماض مبني للمجهول ونائب الفاعل مستتر (مِنْ ماءٍ) متعلقان بالفعل (دافِقٍ) صفة ماء والجملة مستأنفة.","surah_id":86,"source_id":7},{"ayah_number":7,"text":"(يَخْرُجُ) مضارع فاعله مستتر والجملة صفة ثانية لماء (مِنْ بَيْنِ) متعلقان بالفعل (الصُّلْبِ) مضاف إليه (وَالتَّرائِبِ) معطوف عليه.","surah_id":86,"source_id":7},{"ayah_number":8,"text":"(إِنَّهُ) إن واسمها (عَلى رَجْعِهِ) متعلقان بما بعدهما (لَقادِرٌ) اللام المزحلقة وقادر خبر إن والجملة الاسمية تعليلية لا محل لها.","surah_id":86,"source_id":7},{"ayah_number":9,"text":"(يَوْمَ) ظرف زمان (تُبْلَى) مضارع مبني للمجهول (السَّرائِرُ) نائب فاعل، والجملة في محل جر بالإضافة.","surah_id":86,"source_id":7},{"ayah_number":10,"text":"(فَما) الفاء حرف عطف (ما) نافية (لَهُ) خبر مقدم (مِنْ) حرف جر زائد (قُوَّةٍ) مجرور لفظا مرفوع محلا مبتدأ مؤخر والجملة معطوفة على ما قبلها، (وَلا) الواو حرف عطف (لا) نافية (ناصِرٍ) معطوف على ما قبله.","surah_id":86,"source_id":7},{"ayah_number":11,"text":"(وَالسَّماءِ) جار ومجرور متعلقان بفعل محذوف تقديره أقسم (ذاتِ) صفة السماء (الرَّجْعِ) مضاف إليه.","surah_id":86,"source_id":7},{"ayah_number":12,"text":"الجملة معطوفة على ما قبلها والإعراب واحد.","surah_id":86,"source_id":7},{"ayah_number":13,"text":"(إِنَّهُ) إن واسمها (لَقَوْلٌ) اللام المزحلقة (قول) خبرها (فَصْلٌ) صفة والجملة جواب القسم لا محل لها.","surah_id":86,"source_id":7},{"ayah_number":14,"text":"(وَما) الواو حرف عطف (ما) نافية حجازية تعمل عمل ليس (هُوَ) اسمها (بِالْهَزْلِ) الباء حرف جر زائد (الهزل) مجرور لفظا منصوب محلا خبر ما والجملة معطوفة على ما قبلها.","surah_id":86,"source_id":7},{"ayah_number":15,"text":"(إِنَّهُمْ) إن واسمها (يَكِيدُونَ) مضارع مرفوع والواو فاعله والجملة الفعلية خبر إن (كَيْداً) مفعول مطلق والجملة الاسمية مستأنفة لا محل لها.","surah_id":86,"source_id":7},{"ayah_number":16,"text":"(وَأَكِيدُ) مضارع فاعله مستتر (كَيْداً) مفعول مطلق والجملة معطوفة على ما قبلها.","surah_id":86,"source_id":7},{"ayah_number":17,"text":"(فَمَهِّلِ) الفاء الفصيحة وأمر فاعله مستتر (الْكافِرِينَ) مفعول به والجملة جواب شرط لا محل لها (أَمْهِلْهُمْ) أمر ومفعوله والفاعل مستتر (رُوَيْداً) صفة مفعول مطلق محذوف والجملة توكيد لما قبلها.","surah_id":86,"source_id":7}]