[{"ayah_number":1,"text":"(سَبِّحِ) أمر فاعله مستتر (اسْمَ رَبِّكَ) اسم مفعول به مضاف إلى ربك (الْأَعْلَى) صفة ربك والجملة ابتدائية لا محل لها.","surah_id":87,"source_id":7},{"ayah_number":2,"text":"(الَّذِي) صفة ثانية لربك (خَلَقَ) ماض فاعله مستتر والجملة صلة (فَسَوَّى) معطوف على خلق.","surah_id":87,"source_id":7},{"ayah_number":3,"text":"الجملة معطوفة على ما قبلها.","surah_id":87,"source_id":7},{"ayah_number":4,"text":"الجملة معطوفة على ما قبلها أيضا.","surah_id":87,"source_id":7},{"ayah_number":5,"text":"(فَجَعَلَهُ) ماض ومفعوله الأول والفاعل مستتر (غُثاءً) مفعول به ثان (أَحْوى) حال من المرعى والجملة معطوفة على ما قبلها.","surah_id":87,"source_id":7},{"ayah_number":6,"text":"(سَنُقْرِئُكَ) السين للاستقبال ومضارع ومفعوله والفاعل مستتر والجملة مستأنفة (فَلا تَنْسى) الفاء حرف تعليل ولا نافية ومضارع فاعله مستتر.","surah_id":87,"source_id":7},{"ayah_number":7,"text":"(إِلَّا) حرف استثناء (ما) اسم موصول في محل نصب على الاستثناء (شاءَ اللَّهُ) ماض ولفظ الجلالة فاعله والجملة صلة (إِنَّهُ) إن واسمها (يَعْلَمُ) مضارع فاعله مستتر (الْجَهْرَ) مفعول به والجملة الفعلية خبر إن والجملة الاسمية تعليلية لا محل لها.\n(وَما) اسم موصول معطوف على الجهر (يَخْفى) مضارع فاعله مستتر والجملة صلة.","surah_id":87,"source_id":7},{"ayah_number":8,"text":"(وَنُيَسِّرُكَ) مضارع ومفعوله والفاعل مستتر (لِلْيُسْرى) متعلقان بالفعل، والجملة معطوفة على ما قبلها.","surah_id":87,"source_id":7},{"ayah_number":9,"text":"(فَذَكِّرْ) الفاء الفصيحة وأمر فاعله مستتر والجملة جواب شرط مقدر لا محل لها (إِنْ) حرف شرط جازم (نَفَعَتِ) ماض في محل جزم فعل الشرط (الذِّكْرى) فاعل والجملة ابتدائية لا محل لها.","surah_id":87,"source_id":7},{"ayah_number":10,"text":"(سَيَذَّكَّرُ) السين للاستقبال ومضارع مرفوع (مَنْ) اسم موصول فاعله والجملة مستأنفة (يَخْشى) مضارع فاعله مستتر والجملة صلة.","surah_id":87,"source_id":7},{"ayah_number":11,"text":"(وَيَتَجَنَّبُهَا) مضارع ومفعوله.\n(الْأَشْقَى) فاعل والجملة معطوفة على ما قبلها.","surah_id":87,"source_id":7},{"ayah_number":12,"text":"(الَّذِي) اسم موصول صفة الأشقى (يَصْلَى) مضارع فاعله مستتر (النَّارَ) مفعول به (الْكُبْرى) صفة النار والجملة صلة.","surah_id":87,"source_id":7},{"ayah_number":13,"text":"(ثُمَّ) حرف عطف (لا) نافية (يَمُوتُ) مضارع فاعله مستتر والجملة معطوفة على ما قبلها (فِيها) متعلقان بالفعل (وَلا) الواو حرف عطف (وَلا) نافية (يَحْيى) معطوف على يموت.","surah_id":87,"source_id":7},{"ayah_number":14,"text":"(قَدْ) حرف تحقيق (أَفْلَحَ) ماض (مَنْ) فاعله والجملة مستأنفة (تَزَكَّى) ماض فاعله مستتر والجملة صلة.","surah_id":87,"source_id":7},{"ayah_number":15,"text":"(وَذَكَرَ) ماض فاعله مستتر (اسْمَ رَبِّهِ) مفعول به مضاف إلى ربه والجملة معطوفة على ما قبلها (فَصَلَّى) الفاء حرف عطف وصلى معطوف على ذكر.","surah_id":87,"source_id":7},{"ayah_number":16,"text":"(بَلْ) حرف عطف (تُؤْثِرُونَ) مضارع مرفوع والواو فاعله (الْحَياةَ) مفعول به (الدُّنْيا) صفة.","surah_id":87,"source_id":7},{"ayah_number":17,"text":"(وَالْآخِرَةُ خَيْرٌ) الواو حالية ومبتدأ وخبره والجملة حال وأبقى معطوف على خبر.","surah_id":87,"source_id":7},{"ayah_number":18,"text":"(إِنَّ هذا) إن واسمها (لَفِي الصُّحُفِ) اللام المزحلقة وفي الصحف خبر إن (الْأُولى) صفة والجملة مستأنفة لا محل لها.","surah_id":87,"source_id":7},{"ayah_number":19,"text":"(صُحُفِ) بدل من الصحف (إِبْراهِيمَ) مضاف إليه (وَمُوسى) معطوف على إبراهيم.","surah_id":87,"source_id":7}]