[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية [إلا من آية 1 إلى غاية آية 11 فمدنية] وآياتها 69 [نزلت بعد الروم] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":29,"source_id":9},{"ayah_number":1,"ayah_text":"الم (1) أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَهُمْ لا يُفْتَنُونَ (2) وَلَقَدْ فَتَنَّا الَّذِينَ مِنْ قَبْلِهِمْ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكاذِبِينَ (3)","text":"الحسبان لا يصح تعليقه بمعاني المفردات، ولكن بمضامين الجمل. ألا ترى أنك لو قلت:\n\nحسبت زيدا وظننت الفرس: لم يكن شيئا حتى تقول: حسبت زيدا عالما وظننت الفرس جوادا، لأنّ قولك: زيد عالم، أو الفرس جواد كلام دال على مضمون، فأردت الإخبار عن ذلك المضمون ثابتا عندك على وجه الظن لا اليقين، فلم تجد بدّا في العبارة عن ثباته عندك على ذلك الوجه، من ذكر شطرى الجملة مدخلا عليهما فعل الحسبان، حتى يتم لك غرضك. فإن قلت:\n\nفأين الكلام الدال على المضمون الذي يقتضيه الحسبان في الآية؟ قلت: هو في قوله أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَهُمْ لا يُفْتَنُونَ وذلك أن تقديره: أحسبوا تركهم غير مفتونين، لقولهم: آمنا، فالترك أول مفعولي حسب، ولقولهم: آمنا، هو الخبر. وأما «غير مفتونين» فتتمة الترك، لأنه من الترك الذي هو بمعنى التصيير، كقوله:\n\nفتركته جزر السّباع ينشنه\n\nألا ترى أنك قبل المجيء بالحسبان، تقدر أن تقول: تركهم غير مفتونين، لقولهم: آمنا، على تقدير: حاصل ومستقر، قبل اللام. فإن قلت: أَنْ يَقُولُوا هو علة تركهم غير مفتونين، فكيف يصح أن يقع خبر مبتدأ؟ قلت: كما تقول خروجه لمخافة الشر، وضربه للتأديب، وقد كان التأديب والمخافة في قولك: خرجت مخافة الشر، وضربته تأديبا: تعليلين. وتقول أيضا:\n\nحسبت خروجه لمخافة الشر، وظننت ضربه للتأديب، فتجعلهما مفعولين كما جعلتهما مبتدأ وخبرا. والفتنة: الامتحان بشدائد التكليف: من مفارقة الأوطان، ومجاهدة الأعداء، وسائر الطاعات الشاقة، وهجر الشهوات والملاذ، وبالفقر والقحط، وأنواع المصائب في الأنفس والأموال. وبمصابرة الكفار على أذاهم وكيدهم وضرارهم. والمعنى: أحسب الذين أجروا كلمة الشهادة على ألسنتهم وأظهروا القول بالإيمان: أنهم يتركون بذلك غير ممتحنين، بل يمحنهم الله بضروب المحن، حتى يبلو صبرهم، وثبات أقدامهم، وصحة عقائدهم، ونصوع نياتهم، ليتميز المخلص من غير المخلص، والراسخ في الدين من المضطرب، والمتمكن من العابد على حرف، كما قال لَتُبْلَوُنَّ فِي أَمْوالِكُمْ وَأَنْفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتابَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذىً كَثِيراً وَإِنْ تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذلِكَ مِنْ عَزْمِ الْأُمُورِ وروى أنها نزلت في ناس من أصحاب رسول الله صلى الله عليه وسلم قد جزعوا من أذى المشركين. وقيل في عمار بن ياسر: وكان يعذب في الله. وقيل: في ناس أسلموا بمكة، فكتب إليهم المهاجرون: لا يقبل منكم إسلامكم حتى تهاجروا، فخرجوا فتبعهم المشركون فردّوهم، فلما نزلت كتبوا بها إليهم، فخرجوا فاتبعهم المشركون فقاتلوهم، فمنهم من قتل ومنهم من نجا. وقيل: في مهجع بن عبد الله مولى عمر بن الخطاب رضى الله عنه، وهو أوّل قتيل من المسلمين يوم بدر، رماه عامر بن الحضرمي فقال رسول الله صلى الله عليه وسلم: سيد الشهداء مهجع، وهو أول من يدعى إلى باب الجنة من هذه الأمة ، فجزع عليه أبواه وامرأته وَلَقَدْ فَتَنَّا موصول بأحسب أو بلا يفتنون، كقولك: ألا يمتحن فلان وقد امتحن من هو خير منه، يعنى: أن أتباع الأنبياء عليهم السلام قبلهم، قد أصابهم من الفتن والمحن نحو ما أصابهم. أو ما هو أشدّ منه فصبروا، كما قال: وَكَأَيِّنْ مِنْ نَبِيٍّ قاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَما وَهَنُوا ... الآية وعن النبي صلى الله عليه وسلم: «قد كان من قبلكم يؤخذ فيوضع المنشار على رأسه فيفرق فرقتين، ما يصرفه ذلك عن دينه، ويمشط بأمشاط الحديد ما دون عظمه من لحم وعصب، ما يصرفه ذلك عن دينه» فَلَيَعْلَمَنَّ اللَّهُ بالامتحان الَّذِينَ صَدَقُوا في الإيمان وَلَيَعْلَمَنَّ الْكاذِبِينَ فيه. فإن قلت: كيف وهو عالم بذلك فيما لم يزل؟ قلت: لم يزل يعلمه معدوما، ولا يعلمه موجودا إلا إذا وجد ، والمعنى: وليتميزن الصادق منهم من الكاذب. ويجوز أن يكون وعدا ووعيدا، كأنه قال: وليثيبن الذين صدقوا وليعاقبنّ الكاذبين. وقرأ على رضى الله عنه والزهري: وليعلمنّ، من الإعلام، أى:\n\nوليعرفنهم الله الناس من هم. أو ليسمنهم بعلامة يعرفون بها من بياض الوجوه وسوادها، وكحل العيون وزرقتها.","surah_id":29,"source_id":9},{"ayah_number":4,"ayah_text":"أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئاتِ أَنْ يَسْبِقُونا ساءَ ما يَحْكُمُونَ (4)","text":"أَنْ يَسْبِقُونا أن يفوتونا، يعنى أنّ الجزاء يلحقهم لا محالة، وهم لم يطمعوا في الفوت، ولم يحدّثوا به نفوسهم، ولكنهم لغفلتهم وقلة فكرهم في العاقبة وإصرارهم على المعاصي: في صورة من يقدر ذلك ويطمع فيه. ونظيره وَما أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ، وَلا يَحْسَبَنَّ الَّذِينَ كَفَرُوا سَبَقُوا إِنَّهُمْ لا يُعْجِزُونَ. فإن قلت: أين مفعولا «حسب» ؟ قلت: اشتمال صلة أن على مسند ومسند إليه سدّ مسدّ المفعولين، كقوله تعالى أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ ويجوز أن يضمن حسب معنى قدر وأم منقطعة. ومعنى الإضراب فيها: أن هذا الحسبان أبطل من الحسبان الأوّل، لأن ذاك يقدر أنه لا يمتحن لإيمانه، وهذا يظن أنه لا يجازى بمساويه ساءَ ما يَحْكُمُونَ بئس الذي يحكمونه حكمهم هذا. أو بئس حكما يحكمونه حكمهم هذا، فحذف المخصوص بالذم.","surah_id":29,"source_id":9},{"ayah_number":5,"ayah_text":"مَنْ كانَ يَرْجُوا لِقاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ وَهُوَ السَّمِيعُ الْعَلِيمُ (5)","text":"لقاء الله: مثل للوصول إلى العاقبة، من تلقى ملك الموت، والبعث، والحساب، والجزاء:\n\nمثلت تلك الحال بحال عبد قدم على سيده بعد عهد طويل، وقد اطلع مولاه على ما كان يأتى ويذر، فإما أن يلقاه ببشر وترحيب لما رضى من أفعاله، أو بضد ذلك لما سخطه منها، فمعنى قوله مَنْ كانَ يَرْجُوا لِقاءَ اللَّهِ: من كان يأمل تلك الحال. وأن يلقى فيها الكرامة من الله والبشر فَإِنَّ أَجَلَ اللَّهِ وهو الموت لَآتٍ لا محالة، فليبادر العمل الصالح الذي يصدق رجاءه، ويحقق أمله، ويكتسب به القربة عند الله والزلفى وَهُوَ السَّمِيعُ الْعَلِيمُ الذي لا يخفى عليه شيء مما يقوله عباده ومما يفعلونه، فهو حقيق بالتقوى والخشية. وقيل يَرْجُوا: يخاف من قول الهذلي في صفة عسال: إذا لسعته الدّبر لم يرج لسعها\n\nفإن قلت: فإن أجل الله لآت، كيف وقع جوابا للشرط؟ قلت: إذا علم أن لقاء الله عنيت به تلك الحال الممثلة والوقت الذي تقع فيه تلك الحال هو الأجل المضروب للموت: فكأنه قال:\n\nمن كان يرجو لقاء الله فإن لقاء الله لآت، لأن الأجل واقع فيه اللقاء، كما تقول: من كان يرجو لقاء الملك فإن يوم الجمعة قريب، إذا علم أنه يقعد للناس يوم الجمعة.\n","surah_id":29,"source_id":9},{"ayah_number":6,"ayah_text":"وَمَنْ جاهَدَ فَإِنَّما يُجاهِدُ لِنَفْسِهِ إِنَّ اللَّهَ لَغَنِيٌّ عَنِ الْعالَمِينَ (6)","text":"وَمَنْ جاهَدَ نفسه في منعها ما تأمر به وحملها على ما تأباه فَإِنَّما يُجاهِدُ لها، لأن منفعة ذلك راجعة إليها، وإنما أمر الله عز وجل ونهى، رحمة لعباده وهو الغنى عنهم وعن طاعتهم.","surah_id":29,"source_id":9},{"ayah_number":7,"ayah_text":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّئاتِهِمْ وَلَنَجْزِيَنَّهُمْ أَحْسَنَ الَّذِي كانُوا يَعْمَلُونَ (7)","text":"إما أن يريد قوما مسلمين صالحين قد أساءوا في بعض أعمالهم وسيئاتهم مغمورة بحسناتهم فهو يكفرها عنهم، أى يسقط عقابها بثواب الحسنات ويجزيهم أحسن الذي كانوا يعملون، أى: أحسن جزاء أعمالهم: وإما قوما مشركين آمنوا وعملوا الصالحات، فالله عز وجل يكفر سيئاتهم بأن يسقط عقاب ما تقدم لهم من الكفر والمعاصي ويجزيهم أحسن جزاء أعمالهم في الإسلام .","surah_id":29,"source_id":9},{"ayah_number":8,"ayah_text":"وَوَصَّيْنَا الْإِنْسانَ بِوالِدَيْهِ حُسْناً وَإِنْ جاهَداكَ لِتُشْرِكَ بِي ما لَيْسَ لَكَ بِهِ عِلْمٌ فَلا تُطِعْهُما إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِما كُنْتُمْ تَعْمَلُونَ (8)","text":"«وصى» حكمه حكم «أمر» في معناه وتصرفه. يقال: وصيت زيدا بأن يفعل خيرا، كما تقول: أمرته بأن يفعل. ومنه بيت الإصلاح:\n\nوذبيانيّة وصّت بنيها ... بأن كذب القراطف والقروف\n\nكما لو قال: أمرتهم بأن ينتهبوها. ومنه قوله تعالى وَوَصَّى بِها إِبْراهِيمُ بَنِيهِ أى وصاهم بكلمة التوحيد وأمرهم بها، وقولك: وصيت زيدا بعمرو، معناه: وصيته بتعهد عمرو ومراعاته ونحو ذلك، وكذلك معنى قوله وَوَصَّيْنَا الْإِنْسانَ بِوالِدَيْهِ حُسْناً: وصيناه بإيتاء والديه حسنا، أو بإيلاء والديه حسنا، أى: فعلا ذا حسن، أو ما هو في ذاته حسن لفرط حسنه، كقوله تعالى وَقُولُوا لِلنَّاسِ حُسْناً وقرئ: حسنا. وإحسانا. ويجوز أن تجعل حُسْناً من باب قولك: زيدا، بإضمار «أضرب» إذا رأيته متهيئا للضرب، فتنصبه بإضمار أو لهما. أو افعل بهما، لأن التوصية بهما دالة عليه، وما بعده مطابق له، كأنه قال: قلنا أو لهما معروفا وفَلا تُطِعْهُما في الشرك إذا حملاك عليه. وعلى هذا التفسير إن وقف على بِوالِدَيْهِ وابتدأ حُسْناً حسن الوقف، وعلى التفسير الأول لا بد من إضمار القول، معناه: وقلنا إن جاهداك أيها الإنسان ما لَيْسَ لَكَ بِهِ عِلْمٌ أى لا علم لك بإلهيته. والمراد بنفي العلم: نفى المعلوم، كأنه قال: لتشرك بى شيئا لا يصح أن يكون إلها ولا يستقيم: وصاه بوالديه وأمره بالإحسان إليهما، ثم نبه بنهيه عن طاعتهما إذا أراداه على ما ذكر، على أن كل حق وإن عظم ساقط إذا جاء حق الله، وأنه لا طاعة لمخلوق في معصية الخالق، ثم قال: إلىّ مرجع من آمن منكم ومن أشرك، فأجازيكم حق جزائكم. وفيه شيئان، أحدهما: أن الجزاء إلىّ، فلا تحدث نفسك بجفوة والديك وعقوقهما لشركهما، ولا تحرمهما برك ومعروفك في الدنيا، كما أنى لا أمنعهما رزقي. والثاني: التحذير من متابعتهما على الشرك، والحث على الثبات والاستقامة في الدين بذكر المرجع والوعيد.\n\nروى أن سعد بن أبى وقاص الزهري رضى الله عنه حين أسلم قالت أمّه- وهي حمنة بنت أبى سفيان بن أمية بن عبد شمس-: يا سعد، بلغني أنك قد صبأت، فو الله لا يظلني سقف بيت من الضح والريج، وإن الطعام والشراب علىّ حرام حتى تكفر بمحمد- وكان أحبّ ولدها إليها- فأبى سعد وبقيت ثلاثة أيام كذلك، فجاء سعد إلى رسول الله صلى الله عليه وسلم وشكا إليه، فنزلت هذه الآية والتي في لقمان والتي في الأحقاف، فأمره رسول الله صلى الله عليه وسلم أن يداريها ويترضاها بالإحسان . وروى أنها نزلت في عياش بن أبى ربيعة المخزومي، وذلك أنه هاجر مع عمر بن الخطاب رضى الله عنهما مترافقين حتى نزلا المدينة ، فخرج أبو جهل بن هشام والحرث بن هشام- أخواه لأمه أسماء بنت مخرمة: امرأة من بنى تميم من بنى حنظلة- فنزلا بعياش وقالا له: إن من دين محمد صلة الأرحام وبر الوالدين، وقد تركت أمّك لا تطعم ولا تشرب ولا تأوى بيتا حتى تراك، وهي أشدّ حبا لك منا فاخرج معنا، وفتلا منه في الذروة والغارب فاستشار عمر رضى الله عنه فقال: هما يخدعانك، ولك علىّ أن أقسم مالى بيني وبينك، فما زالا به حتى أطاعهما وعصى عمر، فقال له عمر: أما إذ عصيتني فخذ ناقتي، فليس في الدنيا بعير يلحقها، فإن رابك منهما ريب فارجع، فلما انتهوا إلى البيداء قال أبو جهل:\n\nإن ناقتي قد كلت فاحملني معك. قال: نعم، فنزل ليوطئ لنفسه وله، فأخذاه وشدّاه وثاقا، وجلده كل واحد منهما مائة جلدة، وذهبا به إلى أمه فقالت: لا تزال في عذاب حتى ترجع عن دين محمد، فنزلت.","surah_id":29,"source_id":9},{"ayah_number":9,"ayah_text":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ لَنُدْخِلَنَّهُمْ فِي الصَّالِحِينَ (9)","text":"فِي الصَّالِحِينَ في جملتهم. والصلاح من أبلغ صفات المؤمنين، وهو متمنى أنبياء الله. قال الله تعالى حكاية عن سليمان عليه السلام وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبادِكَ الصَّالِحِينَ وقال في إبراهيم عليه السلام: وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ أو في مدخل الصالحين وهي الجنة، وهذا نحو قوله تعالى وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ الآية.","surah_id":29,"source_id":9},{"ayah_number":10,"ayah_text":"وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ فَإِذا أُوذِيَ فِي اللَّهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذابِ اللَّهِ وَلَئِنْ جاءَ نَصْرٌ مِنْ رَبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ أَوَلَيْسَ اللَّهُ بِأَعْلَمَ بِما فِي صُدُورِ الْعالَمِينَ (10) وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ آمَنُوا وَلَيَعْلَمَنَّ الْمُنافِقِينَ (11)","text":" هم ناس كانوا يؤمنون بألسنتهم، فإذا مسهم أذى من الكفار وهو المراد بفتنة الناس، كان ذلك صارفا لهم عن الإيمان، كما أن عذاب الله صارف للمؤمنين عن الكفر. أو كما يجب أن يكون عذاب الله صارفا. وإذا نصر الله المؤمنين وغنمهم اعترضوهم وقالوا إِنَّا كُنَّا مَعَكُمْ أى مشايعين لكم في دينكم، ثابتين عليه ثباتكم، ما قدر أحد أن يفتننا، فأعطونا نصيبنا من المغنم. ثم أخبر سبحانه أنه أعلم بِما فِي صُدُورِ الْعالَمِينَ من العالمين بما في صدورهم، ومن ذلك ما تكنّ صدور هؤلاء من النفاق، وهذا إطلاع منه للمؤمنين على ما أبطنوه، ثم وعد المؤمنين وأوعد المنافقين. وقرئ: ليقولنّ، بفتح اللام.","surah_id":29,"source_id":9},{"ayah_number":12,"ayah_text":"وَقالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا اتَّبِعُوا سَبِيلَنا وَلْنَحْمِلْ خَطاياكُمْ وَما هُمْ بِحامِلِينَ مِنْ خَطاياهُمْ مِنْ شَيْءٍ إِنَّهُمْ لَكاذِبُونَ (12) وَلَيَحْمِلُنَّ أَثْقالَهُمْ وَأَثْقالاً مَعَ أَثْقالِهِمْ وَلَيُسْئَلُنَّ يَوْمَ الْقِيامَةِ عَمَّا كانُوا يَفْتَرُونَ (13)","text":"أمروهم باتباع سبيلهم وهي طريقتهم التي كانوا عليها في دينهم، وأمروا أنفسهم بحمل خطاياهم فعطف الأمر على الأمر، وأرادوا: ليجتمع هذان الأمران في الحصول أن تتبعوا سبيلنا وأن تحمل خطاياكم. والمعنى: تعليق الحمل بالاتباع، وهذا قول صناديد قريش: كانوا يقولون لمن آمن منهم: لا نبعث نحن ولا أنتم، فإن عسى كان ذلك فإنا نتحمل عنكم الإثم. ونرى في المتسمين بالإسلام من يستن بأولئك فيقول لصاحبه- إذا أراد أن يشجعه على ارتكاب بعض العظائم-: افعل هذا وإثمه في عنقي. وكم من مغرور بمثل هذا الضمان من ضعفة العامّة وجهلتهم- ومنه ما يحكى أنّ أبا جعفر المنصور رفع إليه بعض أهل الحشو حوائجه، فلما قضاها قال: يا أمير المؤمنين، بقيت الحاجة العظمى. قال: وما هي؟ قال شفاعتك يوم القيامة، فقال له عمرو بن عبيد رحمه الله: إياك وهؤلاء، فإنهم قطاع الطريق في المأمن . فإن قلت: كيف سماهم كاذبين، وإنما ضمنوا شيئا علم الله أنهم لا يقدرون على الوفاء به، وضامن ما لا يعلم اقتداره على الوفاء به، لا يسمى كاذبا لا حين ضمن ولا حين عجز، لأنه في الحالين لا يدخل تحت حدّ الكاذب وهو المخبر عن الشيء لا على ما هو عليه؟ قلت: شبه الله حالهم حيث علم أن ما ضمنوه لا طريق لهم إلى أن يفوا به، فكان ضمانهم عنده لا على ما عليه المضمون بالكاذبين الذين خبرهم لا على ما عليه لمخبر، عنه. ويجوز أن يريد أنهم كاذبون، لأنهم قالوا ذلك وقلوبهم على خلافه، كالكاذبين الذين يعدون الشيء وفي قلوبهم نية الخلف وَلَيَحْمِلُنَّ أَثْقالَهُمْ أى أثقال أنفسهم وَأَثْقالًا يعنى أثّقالا أخر غير الخطايا التي ضمنوا للمؤمنين حملها، وهي أثقال الذين كانوا سببا في ضلالهم وَلَيُسْئَلُنَّ سؤال تقريع عَمَّا كانُوا يَفْتَرُونَ أى يختلقون من الأكاذيب والأباطيل. وقرئ: من خطيآتهم.","surah_id":29,"source_id":9},{"ayah_number":14,"ayah_text":"وَلَقَدْ أَرْسَلْنا نُوحاً إِلى قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلاَّ خَمْسِينَ عاماً فَأَخَذَهُمُ الطُّوفانُ وَهُمْ ظالِمُونَ (14) فَأَنْجَيْناهُ وَأَصْحابَ السَّفِينَةِ وَجَعَلْناها آيَةً لِلْعالَمِينَ (15)","text":"\nكان عمر نوح عليه السلام ألفا وخمسين سنة، بعث على رأس أربعين، ولبث في قومه تسعمائة وخمسين، وعاش بعد الطوفان ستين. وعن وهب: أنه عاش ألفا وأربعمائة سنة. فإن قلت: هلا قيل تسعمائة وخمسين سنة؟ قلت: ما أورده الله أحكم. لأنه لو قيل كما قلت، لجاز أن يتوهم إطلاق هذا العدد على أكثره، وهذا التوهم زائل مع مجيئه كذلك، وكأنه قيل: تسعمائة وخمسين سنة كاملة وافية العدد، إلا أنّ ذلك أخصر وأعذب لفظا وأملأ بالفائدة ، وفيه نكتة أخرى: وهي أنّ القصة مسوقة لذكر ما ابتلى به نوح عليه السلام من أمّته وما كابده من طول المصابرة، تسلية لرسول الله صلى الله عليه وسلم وتثبيتا له، فكان ذكر رأس العدد الذي لا رأس أكثر منه، أوقع وأوصل إلى الغرض من استطالة السامع مدّة صبره. فإن قلت: فلم جاء المميز أوّلا بالسنة وثانيا بالعام؟ قلت: لأنّ تكرير اللفظ الواحد في الكلام الواحد حقيق بالاجتناب في البلاغة، إلا إذا وقع ذلك لأجل غرض ينتحيه المتكلم من تفخيم أو تهويل أو تنويه أو نحو ذلك. والطُّوفانُ ما أطاف وأحاط بكثرة وغلبة، من سيل أو ظلام ليل أو نحوهما. قال العجاج:\n\nوغمّ طوفان الظّلام الأثأبا\n\nأَصْحابَ السَّفِينَةِ كانوا ثمانية وسبعين نفسا: نصفهم ذكور، ونصفهم إناث، منهم أولاد نوح عليه السلام: سام، وحام، ويافث، ونساؤهم. وعن محمد بن إسحاق: كانوا عشرة. خمسة رجال وخمس نسوة. وقد روى عن النبىّ صلى الله عليه وسلم «كانوا ثمانية: نوح وأهله وبنوه الثلاثة» والضمير في وَجَعَلْناها للسفينة أو للحادثة والقصة.","surah_id":29,"source_id":9},{"ayah_number":16,"ayah_text":"وَإِبْراهِيمَ إِذْ قالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ ذلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (16) إِنَّما تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثاناً وَتَخْلُقُونَ إِفْكاً إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لا يَمْلِكُونَ لَكُمْ رِزْقاً فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ إِلَيْهِ تُرْجَعُونَ (17) وَإِنْ تُكَذِّبُوا فَقَدْ كَذَّبَ أُمَمٌ مِنْ قَبْلِكُمْ وَما عَلَى الرَّسُولِ إِلاَّ الْبَلاغُ الْمُبِينُ (18)","text":"نصب إِبْراهِيمَ بإضمار اذكر، وأبدل عنه إِذْ بدل الاشتمال، لأنّ الأحيان تشتمل على ما فيها. أو هو معطوف على نُوحاً وإذ ظرف لأرسلنا، يعنى: أرسلناه حين بلغ من السنّ والعلم مبلغا صلح فيه لأن يعظ قومه وينصحهم ويعرض عليهم الحق ويأمرهم بالعبادة والتقوى وقرأ إبراهيم النخعي وأبو حنيفة رحمهما الله. وإبراهيم، بالرفع على معنى: ومن المرسلين إبراهيم إِنْ كُنْتُمْ تَعْلَمُونَ يعنى: إن كان فيكم علم بما هو خير لكم مما هو شر لكم. أو إن نظرتم بعين الدراية المبصرة دون عين الجهل العمياء: علمتم أنه خير لكم: وقرئ: تخلقون من خلق بمعنى التكثير في خلق. وتخلقون، من تخلق بمعنى تكذب وتخرص. وقرئ: إفكا، فيه وجهان:\n\nأن يكون مصدرا، نحو: كذب ولعب. والإفك: مخفف منه، كالكذب واللعب من أصلهما، وأن يكون صفة على فعل، أى خلقا إفكا، أى ذا إفك وباطل. واختلاقهم الإفك: تسميتهم الأوثان آلهة وشركاء لله أو شفعاء إليه. أو سمى الأصنام: إفكا، وعملهم لها ونحتهم: خلقا للإفك. فإن قلت: لم نكر الرزق ثم عرفه؟ قلت: لأنه أراد لا يستطيعون أن يرزقوكم شيئا من الرزق، فابتغوا عند الله الرزق كله. فإنه هو الرزاق وحده لا يرزق غيره إِلَيْهِ تُرْجَعُونَ وقرئ: بفتح التاء، فاستعدوا للقائه بعبادته والشكر له على أنعمه، وإن تكذبونني فلا تضروننى بتكذيبكم، فإنّ الرسل قبلي قد كذبتهم أممهم، وما ضرّوهم وإنما ضروا أنفسهم، حيث حلّ بهم ما حل بسبب تكذيب الرسل: وأما الرسول فقد تم أمره حين بلغ البلاغ المبين الذي زال معه الشكّ، وهو اقترانه بآيات الله ومعجزاته. أو: وإن كنت مكذبا فيما بينكم فلي في سائر الأنبياء أسوة وسلوة حيث كذبوا، وعلى الرسول أن يبلغ وما عليه أن يصدق ولا يكذب، وهذه الآية والآيات التي بعدها إلى قوله فَما كانَ جَوابَ قَوْمِهِ محتملة أن تكون من جملة قول إبراهيم صلوات الله عليه لقومه، وأن تكون آيات وقعت معترضة في شأن رسول الله صلى الله عليه وسلم وشأن قريش بين أوّل قصة إبراهيم وآخرها. فإن قلت: إذا كانت من قول إبراهيم فما المراد بالأمم قبله؟ قلت: قوم شيث وإدريس ونوح وغيرهم، وكفى بقوم نوح أمّة في معنى أمم جمة مكذبة، ولقد عاش إدريس ألف سنة في قومه إلى أن رفع إلى السماء. وآمن به ألف إنسان منهم على عدد سنيه، وأعقابهم على التكذيب.","surah_id":29,"source_id":9},{"ayah_number":19,"ayah_text":"أَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللَّهُ الْخَلْقَ ثُمَّ يُعِيدُهُ إِنَّ ذلِكَ عَلَى اللَّهِ يَسِيرٌ (19) قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ بَدَأَ الْخَلْقَ ثُمَّ اللَّهُ يُنْشِئُ النَّشْأَةَ الْآخِرَةَ إِنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ (20) يُعَذِّبُ مَنْ يَشاءُ وَيَرْحَمُ مَنْ يَشاءُ وَإِلَيْهِ تُقْلَبُونَ (21) وَما أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ وَلا فِي السَّماءِ وَما لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلا نَصِيرٍ (22)","text":" فإن قلت: فما تصنع بقوله قُلْ سِيرُوا فِي الْأَرْضِ؟ قلت: هي حكاية كلام حكاه إبراهيم عليه السلام لقومه، كما يحكى رسولنا صلى الله عليه وسلم كلام الله على هذا المنهاج في أكثر القرآن فإن قلت: فإذا كانت خطابا لقريش فما وجه توسطهما بين طرفى قصة إبراهيم والجملة؟ أو الجمل الاعتراضية لا بد لها من اتصال بما وقعت معترضة فيه؟ ألا تراك لا تقول: مكة- وزيد أبوه قائم- خير بلاد الله؟ قلت: إيراد قصة إبراهيم ليس إلا إرادة للتنفيس عن رسول الله صلى الله عليه وسلم، وأن تكون مسلاة له ومتفرجا بأنّ أباه إبراهيم خليل الله كان ممنوّا بنحو ما مني به من شرك قومه وعبادتهم الأوثان، فاعترض بقوله: وإن تكذبوا، على معنى إنكم يا معشر قريش إن تكذبوا محمدا فقد كذب إبراهيم قومه وكل أمة نبيها، لأن قوله فَقَدْ كَذَّبَ أُمَمٌ مِنْ قَبْلِكُمْ لا بد من تناوله لأمّة إبراهيم، وهو كما ترى اعتراض واقع متصل، ثم سائر الآيات الواطئة عقبها من أذيالها وتوابعها، لكونها ناطقة بالتوحيد ودلائله، وهدم الشرك وتوهين قواعده، وصفة قدرة الله وسلطانه، ووضوح حجته وبرهانه. قرئ يَرَوْا بالياء والتاء. ويبدئ ويبدأ. وقوله ثُمَّ يُعِيدُهُ ليس بمعطوف على يبدئ، وليست الرؤية واقعة عليه، وإنما هو إخبار على حياله بالإعادة بعد الموت، كما وقع النظر في قوله تعالى: فَانْظُرُوا كَيْفَ بَدَأَ الْخَلْقَ ثُمَّ اللَّهُ يُنْشِئُ النَّشْأَةَ الْآخِرَةَ على البدء دون الإنشاء، ونحوه قولك: ما زلت أوثر فلانا وأستخلفه على من أخلفه . فإن قلت: هو معطوف بحرف العطف، فلا بد له من معطوف عليه، فما هو؟ قلت: هو جملة قوله أَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللَّهُ الْخَلْقَ وكذلك: وأستخلفه، معطوف على جملة قوله: ما زلت أوثر فلانا ذلِكَ يرجع إلى ما يرجع إليه هو في قوله وَهُوَ أَهْوَنُ عَلَيْهِ من معنى يعيد. دل بقوله النَّشْأَةَ الْآخِرَةَ على أنهما نشأتان، وأن كل واحدة منهما إنشاء، أى: ابتداء واختراع، وإخراج من العدم إلى الوجود، لا تفاوت بينهما إلا أن الآخرة إنشاء بعد إنشاء مثله، والأولى ليست كذلك. وقرئ: النشأة والنشاءة، كالرأفة والرآفة. فإن قلت: ما معنى الإفصاح باسمه مع إيقاعه مبتدأ في قوله ثُمَّ اللَّهُ يُنْشِئُ النَّشْأَةَ الْآخِرَةَ بعد إضماره في قوله: كيف بدأ الخلق؟ وكان القياس أن يقال: كيف بدأ الله الخلق ثم ينشئ النشأة الآخرة؟ قلت: الكلام معهم كان واقعا في الإعادة، وفيها كانت تصطك الركب، فلما قرّرهم في الإبداء بأنه من الله، احتج عليهم بأن الإعادة إنشاء مثل الإبداء، فإذا كان الله الذي لا يعجزه شيء هو الذي لم يعجزه الإبداء، فهو الذي وجب أن لا تعجزه الإعادة ، فكأنه قال: ثم ذاك الذي أنشأ النشأة الأولى هو الذي ينشئ النشأة الآخرة، فللدلالة والتنبيه على هذا المعنى أبرز اسمه وأوقعه مبتدأ يُعَذِّبُ مَنْ يَشاءُ تعذيبه وَيَرْحَمُ مَنْ يَشاءُ رحمته، ومتعلق المشيئتين مفسر مبين في مواضع من القرآن وهو من يستوجبهما من الكافر والفاسق إذا لم يتوبا، ومن المعصوم والتائب تُقْلَبُونَ تردون وترجعون وَما أَنْتُمْ بِمُعْجِزِينَ ربكم أى لا تفوتونه إن هربتم من حكمه وقضائه فِي الْأَرْضِ الفسيحة وَلا فِي السَّماءِ التي هي أفسح منها وأبسط لو كنتم فيها، كقوله تعالى:\n\nإِنِ اسْتَطَعْتُمْ أَنْ تَنْفُذُوا مِنْ أَقْطارِ السَّماواتِ وَالْأَرْضِ فَانْفُذُوا، وقيل: ولا من في السماء كما قال حسان رضى الله عنه:\n\nأمن يهجو رسول الله منكم ... ويمدحه وينصره سواء\n\nويحتمل أن يراد: لا تعجزونه كيفما هبطتم في مهاوي الأرض وأعماقها، أو علوتم في البروج والقلاع الذاهبة في السماء، كقوله تعالى وَلَوْ كُنْتُمْ فِي بُرُوجٍ مُشَيَّدَةٍ أو لا تعجزون أمره الجاري في السماء والأرض أن يجرى عليكم، فيصيبكم ببلاء يظهر من الأرض أو ينزل من السماء.","surah_id":29,"source_id":9},{"ayah_number":23,"ayah_text":"وَالَّذِينَ كَفَرُوا بِآياتِ اللَّهِ وَلِقائِهِ أُولئِكَ يَئِسُوا مِنْ رَحْمَتِي وَأُولئِكَ لَهُمْ عَذابٌ أَلِيمٌ (23)","text":"بِآياتِ اللَّهِ بدلائله على وحدانيته وكتبه ومعجزاته ولقائه والبعث يَئِسُوا مِنْ رَحْمَتِي وعيد، أى ييأسون يوم القيامة، كقوله: وَيَوْمَ تَقُومُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُونَ. أو هو وصف لحالهم، لأنّ المؤمن إنما يكون راجيا خاشيا، فأما الكافر فلا يخطر بباله رجاء ولا خوف.\n\nأو شبه حالهم في انتفاء الرحمة عنهم بحال من يئس من الرحمة: وعن قتادة رضى الله عنه. إن الله ذمّ قوما هانوا عليه فقال أُولئِكَ يَئِسُوا مِنْ رَحْمَتِي وقال إِنَّهُ لا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكافِرُونَ فينبغي للمؤمن أن لا ييأس من روح الله ولا من رحمته، وأن لا يأمن عذابه وعقابه صفة المؤمن أن يكون راجيا لله عز وجل خائفا.","surah_id":29,"source_id":9},{"ayah_number":24,"ayah_text":"فَما كانَ جَوابَ قَوْمِهِ إِلاَّ أَنْ قالُوا اقْتُلُوهُ أَوْ حَرِّقُوهُ فَأَنْجاهُ اللَّهُ مِنَ النَّارِ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يُؤْمِنُونَ (24)","text":"قرئ جَوابَ قَوْمِهِ بالنصب والرفع قالُوا قال بعضهم لبعض. أو قاله واحد منهم وكان الباقون راضين، فكانوا جميعا في حكم القائلين. وروى أنه لم ينتفع في ذلك اليوم بالنار، نعنى: يوم ألقى إبراهيم في النار، وذلك لذهاب حرّها.","surah_id":29,"source_id":9},{"ayah_number":25,"ayah_text":"وَقالَ إِنَّمَا اتَّخَذْتُمْ مِنْ دُونِ اللَّهِ أَوْثاناً مَوَدَّةَ بَيْنِكُمْ فِي الْحَياةِ الدُّنْيا ثُمَّ يَوْمَ الْقِيامَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَيَلْعَنُ بَعْضُكُمْ بَعْضاً وَمَأْواكُمُ النَّارُ وَما لَكُمْ مِنْ ناصِرِينَ (25)","text":"قرئ على النصب بغير إضافة وبإضافة، وعلى الرفع كذلك، فالنصب على وجهين: على التعليل، أى لتتوادّوا بينكم وتتواصلوا، لاجتماعكم على عبادتها واتفاقكم عليها وائتلافكم، كما يتفق الناس على مذهب فيكون ذلك سبب تحابهم وتصادقهم. وأن يكون مفعولا ثانيا، كقوله اتَّخَذَ إِلهَهُ هَواهُ أى اتخذتم الأوثان سبب المودّة بينكم، على تقدير حذف المضاف.\n\nأو اتخذتموها مودّة بينكم، بمعنى مودودة بينكم، كقوله تعالى وَمِنَ النَّاسِ مَنْ يَتَّخِذُ مِنْ دُونِ اللَّهِ أَنْداداً يُحِبُّونَهُمْ كَحُبِّ اللَّهِ وفي الرفع وجهان: أن يكون خبرا لأنّ، على أن ما موصولة.\n\nوأن يكون خبر مبتدإ محذوف. والمعنى: أنّ الأوثان مودّة بينكم، أى: مودودة، أو سبب مودّة. وعن عاصم: مودّة بينكم: بفتح بينكم مع الإضافة، كما قرئ لَقَدْ تَقَطَّعَ بَيْنَكُمْ ففتح وهو فاعل. وقرأ ابن مسعود رضى الله عنه: أوثانا إنما مودّة بينكم في الحياة الدنيا، أى: إنما تتوادّون عليها، أو تودّونها في الحياة الدنيا ثُمَّ يَوْمَ الْقِيامَةِ يقوم بينكم التلاعن والتباغض والتعادي: يتلاعن العبدة، ويتلاعن العبدة والأصنام، كقوله تعالى وَيَكُونُونَ عَلَيْهِمْ ضِدًّا.","surah_id":29,"source_id":9},{"ayah_number":26,"ayah_text":"فَآمَنَ لَهُ لُوطٌ وَقالَ إِنِّي مُهاجِرٌ إِلى رَبِّي إِنَّهُ هُوَ الْعَزِيزُ الْحَكِيمُ (26)","text":"كان لوط ابن أخت إبراهيم عليهما السلام، وهو أول من آمن له حين رأى النار لم تحرقه وَقالَ يعنى إبراهيم إِنِّي مُهاجِرٌ من «كوثى» وهي من سواد الكوفة إلى «حرّان» ثم منها إلى فلسطين، ومن ثمة قالوا: لكل نبى هجرة ولإبراهيم هجرتان، وكان معه في هجرته: لوط، وامرأته سارّة، وهاجر وهو ابن خمس وسبعين سنة إِلى رَبِّي إلى حيث أمرنى بالهجرة إليه إِنَّهُ هُوَ الْعَزِيزُ الذي يمنعني من أعدائى الْحَكِيمُ الذي لا يأمرنى إلا بما هو مصلحتي.","surah_id":29,"source_id":9},{"ayah_number":27,"ayah_text":"وَوَهَبْنا لَهُ إِسْحاقَ وَيَعْقُوبَ وَجَعَلْنا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتابَ وَآتَيْناهُ أَجْرَهُ فِي الدُّنْيا وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ (27)","text":"أَجْرَهُ الثناء الحسن، والصلاة عليه آخر الدهر والذرية الطيبة والنبوّة، وأن أهل الملل كلهم يتولونه. فإن قلت: ما بال إسماعيل عليه السلام لم يذكر، وذكر إسحاق وعقبه؟\n\nقلت: قد دلّ عليه في قوله وَجَعَلْنا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتابَ وكفى الدليل لشهرة أمره وعلوّ قدره. فإن قلت: ما المراد بالكتاب؟ قلت: قصد به جنس الكتاب، حتى دخل تحته ما نزل على ذرّيته من الكتب الأربعة: التي هي التوراة والزبور والإنجيل والقرآن؟\n","surah_id":29,"source_id":9},{"ayah_number":28,"ayah_text":"وَلُوطاً إِذْ قالَ لِقَوْمِهِ إِنَّكُمْ لَتَأْتُونَ الْفاحِشَةَ ما سَبَقَكُمْ بِها مِنْ أَحَدٍ مِنَ الْعالَمِينَ (28) أَإِنَّكُمْ لَتَأْتُونَ الرِّجالَ وَتَقْطَعُونَ السَّبِيلَ وَتَأْتُونَ فِي نادِيكُمُ الْمُنْكَرَ فَما كانَ جَوابَ قَوْمِهِ إِلاَّ أَنْ قالُوا ائْتِنا بِعَذابِ اللَّهِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ (29) قالَ رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ (30)","text":"وَلُوطاً معطوف على إبراهيم، أو على ما عطف عليه. والْفاحِشَةَ الفعلة البالغة في القبح. وما سَبَقَكُمْ بِها مِنْ أَحَدٍ مِنَ الْعالَمِينَ جملة مستأنفة مقررة لفحاشة تلك الفعلة، كأن قائلا قال: لم كانت فاحشة؟ فقيل له: لأن أحدا قبلهم لم يقدم عليها اشمئزازا منها في طباعهم لإفراط قبحها، حتى أقدم عليها قوم لوط لخبث طينتهم وقذر طباعهم. قالوا لم ينز ذكر على ذكر قبل قوم لوط قط. وقرئ: إنكم، بغير استفهام في الأوّل دون الثاني: قال أبو عبيدة:\n\n وجدته في الإمام بحرف واحد بغير ياء، ورأيت الثاني بحرفين الياء والنون وقطع السبيل:\n\nعمل قطاع الطريق، من قتل الأنفس وأخذ الأموال. وقيل: اعتراضهم السابلة بالفاحشة.\n\nوعن الحسن: قطع النسل بإتيان ما ليس بحرث. والْمُنْكَرَ عن ابن عباس رضى الله عنهما هو الخذف بالحصى، والرمي بالبنادق، والفرقعة، ومضغ العلك، والسواك بين الناس، وحل الأزرار، والسباب، والفحش في المزاح. وعن عائشة رضى الله عنها: كانوا يتحابقون .\n\nوقيل السخرية بمن مرّ بهم. وقيل: المجاهرة في ناديهم بذلك العمل، وكل معصية فإظهارها أقبح من سترها، ولذلك جاء: من خرق جلباب الحياء فلا غيبة له. ولا يقال للمجلس: ناد، إلا ما دام فيه أهله، فإذا قاموا عنه لم يبق ناديا إِنْ كُنْتَ مِنَ الصَّادِقِينَ فيما تعدناه من نزول العذاب. كانوا يفسدون الناس بحملهم على ما كانوا عليه من المعاصي والفواحش طوعا وكرها ولأنهم ابتدعوا الفاحشة وسنوها فيمن بعدهم، وقال الله تعالى الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ بِما كانُوا يُفْسِدُونَ فأراد لوط عليه السلام أن يشتد غضب الله عليهم، فذكر لذلك صفة المفسدين في دعائه.","surah_id":29,"source_id":9},{"ayah_number":31,"ayah_text":"وَلَمَّا جاءَتْ رُسُلُنا إِبْراهِيمَ بِالْبُشْرى قالُوا إِنَّا مُهْلِكُوا أَهْلِ هذِهِ الْقَرْيَةِ إِنَّ أَهْلَها كانُوا ظالِمِينَ (31) قالَ إِنَّ فِيها لُوطاً قالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيها لَنُنَجِّيَنَّهُ وَأَهْلَهُ إِلاَّ امْرَأَتَهُ كانَتْ مِنَ الْغابِرِينَ (32)","text":"بِالْبُشْرى هي البشارة بالولد. والنافلة: وهما إسحاق ويعقوب. وإضافة مهلكو إضافة تخفيف لا تعريف. والمعنى الاستقبال. والقرية: سدوم التي قيل فيها: أجور من قاضى سدوم كانُوا ظالِمِينَ معناه أنّ الظلم قد استمر منهم إيجاده في الأيام السالفة، وهم عليه مصرون، وظلمهم: كفرهم وألوان معاصيهم إِنَّ فِيها لُوطاً ليس إخبارا لهم بكونه فيها، وإنما هو جدال في شأنه، لأنهم لما عللوا إهلاك أهلها بظلمهم: اعترض عليهم بأن فيها من هو بريء من الظلم، وأراد بالجدال: إظهار الشفقة عليهم، وما يجب للمؤمن من التحزن لأخيه، والتشمر في نصرته وحياطته، والخوف من أن يمسه أذى أو يلحقه ضرر. قال قتادة: لا يرى المؤمن ألا يحوط المؤمن، ألا ترى إلى جوابهم بأنهم أعلم منه بِمَنْ فِيها يعنون: نحن أعلم منك وأخبر بحال لوط وحال قومه، وامتيازه منهم الامتياز البين، وأنه لا يستأهل ما يستأهلون، فخفض على نفسك وهوّن عليك الخطب. وقرئ لَنُنَجِّيَنَّهُ بالتشديد والتخفيف، وكذلك منجوك.","surah_id":29,"source_id":9},{"ayah_number":33,"ayah_text":"وَلَمَّا أَنْ جاءَتْ رُسُلُنا لُوطاً سِيءَ بِهِمْ وَضاقَ بِهِمْ ذَرْعاً وَقالُوا لا تَخَفْ وَلا تَحْزَنْ إِنَّا مُنَجُّوكَ وَأَهْلَكَ إِلاَّ امْرَأَتَكَ كانَتْ مِنَ الْغابِرِينَ (33)","text":"أَنْ صلة أكدت وجود الفعلين مترتبا أحدهما على الآخر في وقتين متجاورين لا فاصل بينهما، كأنهما وجدا في جزء واحد من الزمان، كأنه قيل: كما أحس بمجيئهم فاجأته المساءة من غير ريث ، خيفة عليهم من قومه وَضاقَ بِهِمْ ذَرْعاً وضاق بشأنهم وبتدبير أمرهم ذرعه أى طاقته، وقد جعلت العرب ضيق الذراع والذرع: عبارة عن فقد الطاقة، كما قالوا: رحب الذراع بكذا، إذا كان مطيقا له، والأصل فيه أنّ الرجل إذا طالت ذراعه نال ما لا يناله القصير الذراع، فضرب ذلك مثلا في العجز والقدرة.","surah_id":29,"source_id":9},{"ayah_number":34,"ayah_text":"إِنَّا مُنْزِلُونَ عَلى أَهْلِ هذِهِ الْقَرْيَةِ رِجْزاً مِنَ السَّماءِ بِما كانُوا يَفْسُقُونَ (34) وَلَقَدْ تَرَكْنا مِنْها آيَةً بَيِّنَةً لِقَوْمٍ يَعْقِلُونَ (35)","text":"الرجز والرجس: العذاب، من قولهم: ارتجز وارتجس إذا اضطرب، لما يلحق المعذب من القلق والاضطراب. وقرئ مُنْزِلُونَ مخففا ومشدّدا مِنْها من القرية آيَةً بَيِّنَةً هي آثار منازلهم الخربة. وقيل: بقية الحجارة. وقيل: الماء الأسود على وجه الأرض. وقيل: الخبر عما صنع بهم لِقَوْمٍ متعلق بتركنا أو ببينة.","surah_id":29,"source_id":9},{"ayah_number":36,"ayah_text":"وَإِلى مَدْيَنَ أَخاهُمْ شُعَيْباً فَقالَ يا قَوْمِ اعْبُدُوا اللَّهَ وَارْجُوا الْيَوْمَ الْآخِرَ وَلا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ (36) فَكَذَّبُوهُ فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دارِهِمْ جاثِمِينَ (37)","text":"وَارْجُوا وافعلوا ما ترجون به العاقبة. فأقيم المسبب مقام السبب. أو أمروا بالرجاء:\n\nوالمراد: اشتراط ما يسوّغه من الإيمان، كما يؤمر الكافر بالشرعيات على إرادة الشرط. وقيل:\n\nهو من الرجاء بمعنى الخوف. والرجفة: الزلزلة الشديدة. وعن الضحاك: صيحة جبريل عليه السلام، لأنّ القلوب رجفت لها فِي دارِهِمْ في بلدهم وأرضهم. أو في ديارهم، فاكتفى بالواحد لأنه لا يلبس جاثِمِينَ باركين على الركب ميتين.","surah_id":29,"source_id":9},{"ayah_number":38,"ayah_text":"وَعاداً وَثَمُودَ وَقَدْ تَبَيَّنَ لَكُمْ مِنْ مَساكِنِهِمْ وَزَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكانُوا مُسْتَبْصِرِينَ (38)","text":"وَعاداً منصوب بإضمار «أهلكنا» لأن قوله فَأَخَذَتْهُمُ الرَّجْفَةُ يدل عليه، لأنه في معنى الإهلاك وَقَدْ تَبَيَّنَ لَكُمْ ذلك: يعنى ما وصفه من إهلاكهم مِنْ جهة مَسْكَنِهِمْ إذا نظرتم إليها عند مروركم بها، وكان أهل مكة يمرون عليها في أسفارهم فيبصرونها وَكانُوا مُسْتَبْصِرِينَ عقلاء متمكنين من النظر والافتكار، ولكنهم لم يفعلوا. أو كانوا متبينين أن العذاب نازل بهم لأن الله تعالى قد بين لهم على ألسنة الرسل عليهم السلام، ولكنهم لجوا حتى هلكوا.","surah_id":29,"source_id":9},{"ayah_number":39,"ayah_text":"وَقارُونَ وَفِرْعَوْنَ وَهامانَ وَلَقَدْ جاءَهُمْ مُوسى بِالْبَيِّناتِ فَاسْتَكْبَرُوا فِي الْأَرْضِ وَما كانُوا سابِقِينَ (39)","text":"سابِقِينَ فائتين، أدركهم أمر الله فلم يفوتوه.","surah_id":29,"source_id":9},{"ayah_number":40,"ayah_text":"فَكُلاًّ أَخَذْنا بِذَنْبِهِ فَمِنْهُمْ مَنْ أَرْسَلْنا عَلَيْهِ حاصِباً وَمِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَمِنْهُمْ مَنْ خَسَفْنا بِهِ الْأَرْضَ وَمِنْهُمْ مَنْ أَغْرَقْنا وَما كانَ اللَّهُ لِيَظْلِمَهُمْ وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ (40)","text":"الحاصب: لقوم لوط، وهي ريح عاصف فيها حصباء. وقيل: ملك كان يرميهم. والصيحة:\n\nلمدين وثمود. والخسف: لقارون. والغرق: لقوم نوح وفرعون.\n","surah_id":29,"source_id":9},{"ayah_number":41,"ayah_text":"مَثَلُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِياءَ كَمَثَلِ الْعَنْكَبُوتِ اتَّخَذَتْ بَيْتاً وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنْكَبُوتِ لَوْ كانُوا يَعْلَمُونَ (41) إِنَّ اللَّهَ يَعْلَمُ ما يَدْعُونَ مِنْ دُونِهِ مِنْ شَيْءٍ وَهُوَ الْعَزِيزُ الْحَكِيمُ (42)","text":"الغرض تشبيه ما اتخذوه متكلا ومعتمدا في دينهم وتولوه من دون الله، بما هو مثل عند الناس في الوهن وضعف القوّة. وهو نسج العنكبوت. ألا ترى إلى مقطع التشبيه وهو قوله وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنْكَبُوتِ؟ فإن قلت: ما معنى قوله لَوْ كانُوا يَعْلَمُونَ وكل أحد يعلم وهن بيت العنكبوت؟ قلت: معناه لو كانوا يعلمون أن هذا مثلهم وأن أمر دينهم بالغ هذه الغاية من الوهن. ووجه آخر: وهو أنه إذا صحّ تشبيه ما اعتمدوه في دينهم ببيت العنكبوت، وقد صح أن أوهن البيوت بيت العنكبوت، فقد تبين أن دينهم أوهن الأديان لو كانوا يعلمون. أو أخرج الكلام بعد تصحيح التشبيه مخرج المجاز، فكأنه قال: وإن أوهن ما يعتمد عليه في الدين عبادة الأوثان لو كانوا يعلمون. ولقائل أن يقول: مثل المشرك الذي يعبد الوثن بالقياس إلى المؤمن الذي يعبد الله، مثل عنكبوت يتخذ بيتا، بالإضافة إلى رجل يبنى بيتا بآجر وجص أو ينحته من صخر، وكما أن أوهن البيوت إذا استقريتها بيتا بيتا بيت العنكبوت، كذلك أضعف الأديان إذا استقريتها دينا دينا عبادة الأوثان لو كانوا يعلمون.\n\nقرئ: تدعون، بالتاء والياء. وهذا توكيد للمثل وزيادة عليه، حيث لم يجعل ما يدعونه شيئا وَهُوَ الْعَزِيزُ الْحَكِيمُ فيه تجهيل لهم حيث عبدوا ما ليس بشيء، لأنه جماد ليس معه مصحح العلم والقدرة أصلا، وتركوا عبادة القادر القاهر على كل شيء، الحكيم الذي لا يفعل شيئا إلا بحكمة وتدبير.","surah_id":29,"source_id":9},{"ayah_number":43,"ayah_text":"وَتِلْكَ الْأَمْثالُ نَضْرِبُها لِلنَّاسِ وَما يَعْقِلُها إِلاَّ الْعالِمُونَ (43)","text":"كان الجهلة والسفهاء من قريش يقولون إنّ ربّ محمد يضرب المثل بالذباب والعنكبوت، ويضحكون من ذلك، فلذلك قال وَما يَعْقِلُها إِلَّا الْعالِمُونَ أى لا يعقل صحتها وحسنها وفائدتها إلا هم، لأنّ الأمثال والتشبيهات إنما هي الطرق إلى المعاني المحتجبة في الأستار حتى تبرزها وتكشف عنها وتصوّرها للأفهام، كما صوّر هذا التشبيه الفرق بين حال المشرك وحال الموحد وعن النبي صلى الله عليه وسلم أنه تلا هذه الآية فقال: «العالم من عقل عن الله فعمل بطاعته واجتنب سخطه » :","surah_id":29,"source_id":9},{"ayah_number":44,"ayah_text":"خَلَقَ اللَّهُ السَّماواتِ وَالْأَرْضَ بِالْحَقِّ إِنَّ فِي ذلِكَ لَآيَةً لِلْمُؤْمِنِينَ (44)","text":"بِالْحَقِّ أى بالغرض الصحيح الذي هو حق لا باطل، وهو أن تكونا مساكن عباده وعبرة للمعتبرين منهم، ودلائل على عظم قدرته: ألا ترى إلى قوله إِنَّ فِي ذلِكَ لَآيَةً لِلْمُؤْمِنِينَ ونحوه قوله تعالى وَما خَلَقْنَا السَّماءَ وَالْأَرْضَ وَما بَيْنَهُما باطِلًا ثم قال ذلِكَ ظَنُّ الَّذِينَ كَفَرُوا","surah_id":29,"source_id":9},{"ayah_number":45,"ayah_text":"اتْلُ ما أُوحِيَ إِلَيْكَ مِنَ الْكِتابِ وَأَقِمِ الصَّلاةَ إِنَّ الصَّلاةَ تَنْهى عَنِ الْفَحْشاءِ وَالْمُنْكَرِ وَلَذِكْرُ اللَّهِ أَكْبَرُ وَاللَّهُ يَعْلَمُ ما تَصْنَعُونَ (45)","text":"الصلاة تكون لطفا في ترك المعاصي، فكأنها ناهية عنها. فإن قلت: كم من مصل يرتكب ولا تنهاه صلاته؟ قلت الصلاة التي هي الصلاة عند الله المستحق بها الثواب: أن يدخل فيها مقدّما للتوبة النصوح، متقيا، لقوله تعالى إِنَّما يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ ويصليها خاشعا بالقلب والجوارح، فقد روى عن حاتم: كأنّ رجلي على الصراط والجنة عن يمينى والنار عن يساري وملك الموت من فوقى، وأصلى بين الخوف والرجاء، ثم يحوطها بعد أن يصليها فلا يحبطها، فهي الصلاة التي تنهى عن الفحشاء والمنكر. وعن ابن عباس رضى الله عنهما: من لم تأمره صلاته بالمعروف وتنهه عن المنكر لم يزدد بصلاته من الله إلا بعدا . وعن الحسن رحمه الله: من لم تنهه صلاته عن الفحشاء والمنكر، فليست صلاته بصلاة، وهي وبال عليه. وقيل: من كان مراعيا للصلاة جرّه ذلك إلى أن ينتهى عن السيئات يوما ما، فقد روى أنه قيل لرسول الله صلى الله عليه وسلم إنّ فلانا يصلى بالنهار ويسرق بالليل، فقال «إنّ صلاته لتردعه» وروى أنّ فتى من الأنصار كان يصلى معه الصلوات، ولا يدع شيئا من الفواحش إلا ركبه، فوصف له فقال «إن صلاته ستنهاه» فلم يلبث أن تاب . وعلى كل حال إنّ المراعى للصلاة لا بدّ أن يكون أبعد من الفحشاء والمنكر ممن لا يراعيها. وأيضا فكم من مصلين تنهاهم الصلاة عن الفحشاء والمنكر، واللفظ لا يقتضى أن لا يخرج واحد من المصلين عن قضيتها، كما تقول: إنّ زيدا ينهى عن المنكر فليس غرضك أنه ينهى عن جميع المناكير، وإنما تريد أنّ هذه الخصلة موجودة فيه وحاصلة منه من غير اقتضاء للعموم وَلَذِكْرُ اللَّهِ أَكْبَرُ يريد: وللصلاة أكبر من غيرها من الطاعات، وسماها بذكر الله كما قال فَاسْعَوْا إِلى ذِكْرِ اللَّهِ وإنما قال: ولذكر الله: ليستقلّ بالتعليل، كأنه قال:\n\nوللصلاة أكبر، لأنها ذكر الله. أو ولذكر الله عند الفحشاء والمنكر وذكر نهيه عنهما ووعيده عليهما أكبر، فكان أولى بأن ينهى من اللطف الذي في الصلاة. وعن ابن عباس رضى الله عنهما ولذكر الله إياكم برحمته أكبر من ذكركم إياه بطاعته وَاللَّهُ يَعْلَمُ ما تَصْنَعُونَ من الخير والطاعة، فيثيبكم أحسن الثواب.","surah_id":29,"source_id":9},{"ayah_number":46,"ayah_text":"وَلا تُجادِلُوا أَهْلَ الْكِتابِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ إِلاَّ الَّذِينَ ظَلَمُوا مِنْهُمْ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنا وَأُنْزِلَ إِلَيْكُمْ وَإِلهُنا وَإِلهُكُمْ واحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ (46)","text":"بِالَّتِي هِيَ أَحْسَنُ بالخصلة التي هي أحسن: وهي مقابلة الخشونة باللين، والغضب بالكظم.\n\nوالسورة بالأناة، كما قال. ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ، إِلَّا الَّذِينَ ظَلَمُوا فأفرطوا في الاعتداء والعناد ولم يقبلوا النصح ولم ينفع فيهم الرفق، فاستعملوا معهم الغلظة، وقيل: إلا الذين آذوا رسول الله صلى الله عليه وسلم. وقيل: إلا الذين أثبتوا الولد والشريك وقالوا يد الله مغلولة.\n\nوقيل: معناه ولا تجادلوا الداخلين في الذمّة المؤدّين للجزية إلا بالتي هي أحسن، إلا الذين ظلموا فنبذوا الذمّة ومنعوا الجزية، فإن أولئك مجادلتهم بالسيف. وعن قتادة: الآية منسوخة بقوله تعالى قاتِلُوا الَّذِينَ لا يُؤْمِنُونَ بِاللَّهِ وَلا بِالْيَوْمِ الْآخِرِ ولا مجادلة أشدّ من السيف: وقوله قُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنا من جنس المجادلة بالتي هي أحسن. وعن النبي صلى الله عليه وسلم:\n\nما حدّثكم أهل الكتاب فلا تصدّقوهم ولا تكذبوهم، وقولوا آمنا بالله وكتبه ورسله، فإن كان باطلا لم تصدّقوهم، وإن كان حقا لم تكذبوهم .","surah_id":29,"source_id":9},{"ayah_number":47,"ayah_text":"وَكَذلِكَ أَنْزَلْنا إِلَيْكَ الْكِتابَ فَالَّذِينَ آتَيْناهُمُ الْكِتابَ يُؤْمِنُونَ بِهِ وَمِنْ هؤُلاءِ مَنْ يُؤْمِنُ بِهِ وَما يَجْحَدُ بِآياتِنا إِلاَّ الْكافِرُونَ (47)","text":"ومثل ذلك الإنزال أَنْزَلْنا إِلَيْكَ الْكِتابَ أى: أنزلناه مصدّقا لسائر الكتب السماوية، تحقيقا لقوله آمنا بالذي أنزل إلينا وأنزل إليكم. وقيل: كما أنزلنا الكتب إلى من كان قبلك أنزلنا إليك الكتاب فَالَّذِينَ آتَيْناهُمُ الْكِتابَ هم عبد الله بن سلام ومن آمن معه وَمِنْ هؤُلاءِ من أهل مكة وقيل: أراد بالذين أوتوا الكتاب الذين تقدموا عهد رسول الله صلى الله عليه وسلم من أهل الكتاب، ومن هؤلاء ممن في عهده منهم وَما يَجْحَدُ بِآياتِنا مع ظهورها وزوال الشبهة عنها، إلا المتوغلون في الكفر المصممون عليه. وقيل: هم كعب بن الأشرف وأصحابه.","surah_id":29,"source_id":9},{"ayah_number":48,"ayah_text":"وَما كُنْتَ تَتْلُوا مِنْ قَبْلِهِ مِنْ كِتابٍ وَلا تَخُطُّهُ بِيَمِينِكَ إِذاً لارْتابَ الْمُبْطِلُونَ (48) بَلْ هُوَ آياتٌ بَيِّناتٌ فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ وَما يَجْحَدُ بِآياتِنا إِلاَّ الظَّالِمُونَ (49)","text":"\nوأنت أمىّ ما عرفك أحد قط بتلاوة كتاب ولا خط إِذاً لو كان شيء من ذلك، أى، من التلاوة والخط لَارْتابَ الْمُبْطِلُونَ من أهل الكتاب وقالوا: الذي نجده في كتبنا أمى لا يكتب ولا يقرأ وليس به. أو لارتاب مشركو مكة وقالوا: لعله تعلمه أو كتبه بيده. فإن قلت:\n\nلم سماهم مبطلين، ولو لم يكن أمّيا وقالوا: ليس بالذي نجده في كتبنا لكانوا صادقين محقين؟\n\nولكان أهل مكة أيضا على حق في قولهم لعله تعلمه أو كتبه فإنه رجل قارئ كاتب؟ قلت: سماهم مبطلين لأنهم كفروا به وهو أمىّ بعيد من الريب، فكأنه قال: هؤلاء المبطلون في كفرهم به لو لم يكن أمّيا لارتابوا أشدّ الريب، فحين ليس بقارئ كاتب فلا وجه لارتيابهم. وشيء آخر: وهو أن سائر الأنبياء عليهم السلام لم يكونوا أمّيين، ووجب الإيمان بهم وبما جاءوا به، لكونهم مصدقين من جهة الحكيم بالمعجزات، فهب أنه قارئ كاتب فما لهم لم يؤمنوا به من الوجه الذي آمنوا منه بموسى وعيسى عليهما السلام؟ على أن المنزلين ليسا بمعجزين، وهذا المنزل معجز، فإذا هم مبطلون حيث لم يؤمنوا به وهو أمى، ومبطلون لو لم يؤمنوا به وهو غير أمى.\n\nفان قلت: ما فائدة قوله بيمينك؟ قلت ذكر اليمين وهي الجارحة التي يزاول بها الخط: زيادة تصوير لما نفى عنه من كونه كاتبا. ألا ترى أنك إذا قلت في الإثبات، رأيت الأمير يخط هذا الكتاب بيمينه، كان أشد لإثباتك أنه تولى كتبته، فكذلك النفي بَلْ القرآن آياتٌ بَيِّناتٌ فِي صُدُورِ العلماء به وحفاظه، وهما من خصائص القرآن: كون آياته بينات الإعجاز، وكونه محفوظا في الصدور يتلوه أكثر الأمة ظاهرا: بخلاف سائر الكتب، فإنها لم تكن معجزات، وما كانت تقرأ إلا من المصاحف. ومنه ما جاء في صفة هذه الأمة «صدورهم أناجيلهم» وَما يَجْحَدُ بآيات الله الواضحة، إلا المتوغلون في الظلم المكابرون.","surah_id":29,"source_id":9},{"ayah_number":51,"ayah_text":"أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنا عَلَيْكَ الْكِتابَ يُتْلى عَلَيْهِمْ إِنَّ فِي ذلِكَ لَرَحْمَةً وَذِكْرى لِقَوْمٍ يُؤْمِنُونَ (51) قُلْ كَفى بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيداً يَعْلَمُ ما فِي السَّماواتِ وَالْأَرْضِ وَالَّذِينَ آمَنُوا بِالْباطِلِ وَكَفَرُوا بِاللَّهِ أُولئِكَ هُمُ الْخاسِرُونَ (52)","text":"قرئ: آية، وآيات. أرادوا: هلا أنزل عليه آية مثل ناقة صالح ومائدة عيسى عليهما السلام ونحو ذلك إِنَّمَا الْآياتُ عِنْدَ اللَّهِ ينزل أيتها شاء، ولو شاء أن ينزل ما تقترحونه لفعل وَإِنَّما أَنَا نَذِيرٌ كلفت الإنذار وإبانته بما أعطيت من الآيات، وليس لي أن أتخير على الله آياته فأقول، أنزل علىّ آية كذا دون آية كذا، مع علمى أنّ الغرض من الآية ثبوت الدلالة، والآيات كلها في حكم آية واحدة في ذلك، ثم قال أَوَلَمْ يَكْفِهِمْ آية مغنية عن سائر الآيات- إن كانوا طالبين للحق غير متعنتين- هذا القرآن الذي تدوم تلاوته عليهم في كل مكان وزمان فلا يزال معهم آية ثابتة لا تزول ولا تضمحلّ، كما تزول كل آية بعد كونها، وتكون في مكان دون مكان. إنّ في مثل هذه الآية الموجودة في كل مكان وزمان إلى آخر الدهر لَرَحْمَةً لنعمة عظيمة لا تشكر. وتذكرة لِقَوْمٍ يُؤْمِنُونَ وقيل: أو لم يكفهم، يعنى اليهود: أنا أنزلنا عليك الكتاب يتلى عليهم بتحقيق ما في أيديهم من نعتك ونعت دينك. وقيل: إنّ ناسا من المسلمين أتوا رسول الله صلى الله عليه وسلم بكتف قد كتبوا فيها بعض ما يقول اليهود، فلما أن نظر إليها ألقاها وقال: كفى بها حماقة قوم أو ضلالة قوم أن يرغبوا عما جاءهم به نبيهم إلى ما جاء به غير نبيهم، فنزلت . والوجه ما ذكرناه كَفى بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيداً أنى قد بلغتكم ما أرسلت به إليكم وأنذرتكم، وأنكم قابلتمونى بالجحد والتكذيب يَعْلَمُ ما فِي السَّماواتِ وَالْأَرْضِ فهو مطلع على أمرى وأمركم، وعالم بحقي وباطلكم وَالَّذِينَ آمَنُوا بِالْباطِلِ منكم وهو ما تعبدون من دون الله وَكَفَرُوا بِاللَّهِ وآياته أُولئِكَ هُمُ الْخاسِرُونَ المغبونون في صفقتهم حيث اشتروا الكفر بالإيمان، إلا أن الكلام ورد مورد الإنصاف، كقوله وَإِنَّا أَوْ إِيَّاكُمْ لَعَلى هُدىً أَوْ فِي ضَلالٍ مُبِينٍ وكقول حسان:\n\nفشر كما لخير كما الفداء\n\nوروى أنّ كعب بن الأشرف وأصحابه قالوا: يا محمد، من يشهد لك بأنك رسول الله، فنزلت.","surah_id":29,"source_id":9},{"ayah_number":53,"ayah_text":"وَيَسْتَعْجِلُونَكَ بِالْعَذابِ وَلَوْلا أَجَلٌ مُسَمًّى لَجاءَهُمُ الْعَذابُ وَلَيَأْتِيَنَّهُمْ بَغْتَةً وَهُمْ لا يَشْعُرُونَ (53) يَسْتَعْجِلُونَكَ بِالْعَذابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكافِرِينَ (54) يَوْمَ يَغْشاهُمُ الْعَذابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُوا ما كُنْتُمْ تَعْمَلُونَ (55)","text":"كان استعجال العذاب استهزاء منهم وتكذيبا، والنضر بن الحرث هو الذي قال: اللهم أمطر علينا حجارة من السماء، كما قال أصحاب الأيكة: فأسقط علينا كسفا من السماء وَلَوْلا أَجَلٌ قد سماه الله وبينه في اللوح لعذابهم، وأوجبت الحكمة تأخيره إلى ذلك الأجل المسمى لَجاءَهُمُ الْعَذابُ عاجلا. والمراد بالأجل: الآخرة، لما روى أنّ الله تعالى وعد رسول الله صلى الله عليه وسلم أن لا يعذب قومه ولا يستأصلهم، وأن يؤخر عذابهم إلى يوم القيامة .\n\nوقيل: يوم بدر. وقيل: وقت فنائهم بآجالهم لَمُحِيطَةٌ أى ستحيط بهم يَوْمَ يَغْشاهُمُ الْعَذابُ أو هي محيطة بهم في الدنيا: لأنّ المعاصي التي توجبها محيطة بهم. أو لأنها مآلهم ومرجعهم لا محالة فكأنها الساعة محيطة بهم. ويَوْمَ يَغْشاهُمُ على هذا منصوب بمضمر، أى: يوم يغشاهم العذاب كان كيت وكيت. مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ كقوله تعالى لَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ، وَيَقُولُ قرئ بالنون والياء ما كُنْتُمْ تَعْمَلُونَ أى جزاءه.","surah_id":29,"source_id":9},{"ayah_number":56,"ayah_text":"يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ (56)","text":"معنى الآية: أنّ المؤمن إذا لم يتسهل له العبادة في بلد هو فيه ولم يتمش له أمر دينه كما يحب فليهاجر عنه إلى بلد يقدّر أنه فيه أسلم قلبا وأصح دينا وأكثر عبادة وأحسن خشوعا. ولعمري إن البقاع تتفاوت في ذلك التفاوت الكثير، ولقد جرّبنا وجرّب أوّلونا، فلم نجد فيما درنا وداروا: أعون على قهر النفس وعصيان الشهوة وأجمع للقلب المتلفت وأضم للهم المنتشر وأحث على القناعة وأطرد للشيطان وأبعد من كثير من الفتن وأضبط للأمر الديني في الجملة- من سكنى حرم الله وجوار بيت الله، فلله الحمد على ما سهل من ذلك وقرب، ورزق من الصبر وأوزع من الشكر. وعن النبي صلى الله عليه وسلم «من فرّ بدينه من أرض إلى أرض وإن كان شبرا من الأرض، استوجب الجنة وكان رفيق إبراهيم ومحمد» وقيل: هي في المستضعفين بمكة الذين نزل فيهم أَلَمْ تَكُنْ أَرْضُ اللَّهِ واسِعَةً فَتُهاجِرُوا فِيها وإنما كان ذلك لأنّ أمر دينهم ما كان يستتب لهم بين ظهراني الكفرة فَإِيَّايَ فَاعْبُدُونِ في المتكلم، نحو: إياه ضربته، في الغائب وإياك عضتك، في المخاطب. والتقدير: فإياى فاعبدوا: فاعبدون. فإن قلت: ما معنى الفاء في فَاعْبُدُونِ وتقديم المفعول؟ قلت: الفاء جواب شرط محذوف، لأنّ المعنى: إنّ أرضى واسعة فإن لم تخلصوا العبادة لي في أرض فأخلصوها لي في غيرها، ثم حذف الشرط وعوّض من حذفه تقديم المفعول، مع إفادة تقديمه معنى الاختصاص والإخلاص.","surah_id":29,"source_id":9},{"ayah_number":57,"ayah_text":"كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ ثُمَّ إِلَيْنا تُرْجَعُونَ (57)","text":"لما أمر عباده بالحرص على العبادة وصدق الاهتمام بها حتى يتطلبوا لها أوفق البلاد وإن شسعت ، أتبعه قوله كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ أى واجدة مرارته وكربه كما يجد الذائق طعم المذوق. ومعناه: إنكم ميتون فواصلون الى الجزاء، ومن كانت هذه عاقبته لم يكن له بد من التزود لها والاستعداد بجهده.","surah_id":29,"source_id":9},{"ayah_number":58,"ayah_text":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ لَنُبَوِّئَنَّهُمْ مِنَ الْجَنَّةِ غُرَفاً تَجْرِي مِنْ تَحْتِهَا الْأَنْهارُ خالِدِينَ فِيها نِعْمَ أَجْرُ الْعامِلِينَ (58) الَّذِينَ صَبَرُوا وَعَلى رَبِّهِمْ يَتَوَكَّلُونَ (59)","text":"لَنُبَوِّئَنَّهُمْ لننزلنهم مِنَ الْجَنَّةِ علالي. وقرئ: لنثوّينهم، من الثواء وهو النزول للإقامة.\n\nيقال: ثوى في المنزل، وأثوى هو، وأثوى غيره وثوى: غير متعد، فإذا تعدى بزيادة همزة النقل لم يتجاوز مفعولا واحدا، نحو: ذهب، وأذهبته. والوجه في تعديته إلى ضمير المؤمنين وإلى الغرف: إمّا إجراؤه مجرى لننزلنهم ونبوئنهم. أو حذف الجار وإيصال الفعل: أو تشبيه الظرف المؤقت بالمبهم. وقرأ يحيى بن وثاب: فنعم، بزيادة الفاء الَّذِينَ صَبَرُوا على مفارقة الأوطان والهجرة لأجل الدين. وعلى أذى المشركين، وعلى المحن والمصائب، وعلى الطاعات، وعن المعاصي، ولم يتوكلوا في جميع ذلك إلا على الله.","surah_id":29,"source_id":9},{"ayah_number":60,"ayah_text":"وَكَأَيِّنْ مِنْ دَابَّةٍ لا تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُها وَإِيَّاكُمْ وَهُوَ السَّمِيعُ الْعَلِيمُ (60)","text":"لما أمر رسول الله صلى الله عليه وسلم من أسلم بمكة بالهجرة، خافوا الفقر والضيعة، فكان يقول الرجل منهم: كيف أقدم بلدة ليست لي فيها معيشة، فنزلت. والدابة: كل نفس دبت على وجه الأرض، عقلت أو لم تعقل. تَحْمِلُ رِزْقَهَا لا تطيق أن تحمله لضعفها عن حمله اللَّهُ يَرْزُقُها وَإِيَّاكُمْ أى لا يرزق تلك الدواب الضعاف إلا الله، ولا يرزقكم أيضا أيها الأقوياء إلا هو وإن كنتم مطيقين لحمل أرزاقكم وكسبها، لأنه لو لم يقدركم ولم يقدّر لكم أسباب الكسب، لكنتم أعجز من الدواب التي لا تحمل، وعن الحسن لا تَحْمِلُ رِزْقَهَا لا تدّخره، إنما تصبح فيرزقها الله. وعن ابن عيينة: ليس شيء يخبأ إلا الإنسان والنملة والفأرة.\n\nوعن بعضهم: رأيت البلبل يحتكر في حضنيه. ويقال: للعقعق مخابئ إلا أنه ينساها وَهُوَ السَّمِيعُ لقولكم: نخشى الفقر والضيعة الْعَلِيمُ بما في ضمائركم.","surah_id":29,"source_id":9},{"ayah_number":61,"ayah_text":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّماواتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللَّهُ فَأَنَّى يُؤْفَكُونَ (61)","text":"الضمير في سَأَلْتَهُمْ لأهل مكة فَأَنَّى يُؤْفَكُونَ فكيف يصرفون عن توحيد الله وأن لا يشركوا به، مع إقرارهم بأنه خالق السماوات والأرض.","surah_id":29,"source_id":9},{"ayah_number":62,"ayah_text":"اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشاءُ مِنْ عِبادِهِ وَيَقْدِرُ لَهُ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ (62)","text":"قدر الرزق وقتره بمعنى إذا ضيقه. فإن قلت: الذي رجع إليه الضمير في قوله وَيَقْدِرُ لَهُ هو من يشاء، فكأن بسط الرزق وقدره جعلا لواحد. قلت: يحتمل الوجهين جميعا:\n\nأن يريد ويقدر لمن يشاء، فوضع الضمير موضع من يشاء، لأن لِمَنْ يَشاءُ مبهم غير معين، فكان الضمير مبهما مثله، وأن يريد تعاقب الأمرين على واحد على حسب المصلحة إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ يعلم ما يصلح العباد وما يفسدهم.","surah_id":29,"source_id":9},{"ayah_number":63,"ayah_text":"وَلَئِنْ سَأَلْتَهُمْ مَنْ نَزَّلَ مِنَ السَّماءِ ماءً فَأَحْيا بِهِ الْأَرْضَ مِنْ بَعْدِ مَوْتِها لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لا يَعْقِلُونَ (63)","text":"استحمد رسول الله صلى الله عليه وسلم على أنه ممن أقر بنحو ما أقروا به ثم نفعه ذلك في توحيد الله ونفى الأنداد والشركاء عنه، ولم يكن إقرارا عاطلا كاقرار المشركين، وعلى أنهم أقروا بما هو حجة عليهم حيث نسبوا النعمة إلى الله وقد جعلوا العبادة للصنم، ثم قال بَلْ أَكْثَرُهُمْ لا يَعْقِلُونَ ما يقولون وما فيه من الدلالة على بطلان الشرك وصحة التوحيد. أو لا يعقلون ما تريد بقولك الحمد لله، ولا يفطنون لم حمدت الله عند مقالتهم؟","surah_id":29,"source_id":9},{"ayah_number":64,"ayah_text":"وَما هذِهِ الْحَياةُ الدُّنْيا إِلاَّ لَهْوٌ وَلَعِبٌ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوانُ لَوْ كانُوا يَعْلَمُونَ (64)","text":"هذِهِ فيها ازدراء للدنيا وتصغير لأمرها، وكيف لا يصغرها وهي لا تزن عنده جناح بعوضة. يريد: ما هي- لسرعة زوالها عن أهلها وموتهم عنها- إلا كما يلعب الصبيان ساعة ثم يتفرقون وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوانُ أى ليس فيها إلا حياة مستمرة دائمة خالدة لا موت فيها، فكأنها في ذاتها حياة. والحيوان: مصدر حي، وقياسه حييان، فقلبت الياء الثانية واوا، كما قالوا: حيوة، في اسم رجل، وبه سمى ما فيه حياة: حيوانا. قالوا: اشتر من الموتان، ولا تشتر من الحيوان . وفي بناء الحيوان زيادة معنى ليس في بناء الحياة، وهي ما في بناء فعلان من معنى الحركة والاضطراب، كالنزوان والنغصان واللهبان ، وما أشبه ذلك. والحياة: حركة، كما أن الموت سكون، فمجيئه على بناء دال على معنى الحركة، مبالغة في معنى الحياة، ولذلك اختيرت على الحياة في هذا الموضع المقتضى للمبالغة لَوْ كانُوا يَعْلَمُونَ فلم يؤثروا الحياة الدنيا عليها.","surah_id":29,"source_id":9},{"ayah_number":65,"ayah_text":"فَإِذا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذا هُمْ يُشْرِكُونَ (65) لِيَكْفُرُوا بِما آتَيْناهُمْ وَلِيَتَمَتَّعُوا فَسَوْفَ يَعْلَمُونَ (66)","text":"فإن قلت: بم اتصل قوله فَإِذا رَكِبُوا؟ قلت: بمحذوف دلّ عليه ما وصفهم به وشرح من أمرهم، معناه: هم على ما وصفوا به من الشرك والعناد فَإِذا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ كائنين في صورة من يخلص الدين لله من المؤمنين، حيث لا يذكرون إلا الله ولا يدعون معه إلها آخر. وفي تسميتهم مخلصين: ضرب من التهكم فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ وآمنوا عادوا إلى حال الشرك: واللام في لِيَكْفُرُوا محتملة أن تكون لام كى، وكذلك في وَلِيَتَمَتَّعُوا فيمن قرأها بالكسر. والمعنى: أنهم يعودون إلى شركهم ليكونوا- بالعود إلى شركهم- كافرين بنعمة النجاة، قاصدين التمتع بها والتلذذ لا غير، على خلاف ما هو عادة المؤمنين المخلصين على الحقيقة: إذا أنجاهم الله أن يشكروا نعمة الله في إنجائهم، ويجعلوا نعمة النجاة ذريعة إلى ازدياد الطاعة، لا إلى التمتع والتلذذ، وأن تكون لام الأمر وقراءة من قرأ وليتمتعوا بالسكون تشهد له. ونحوه قوله تعالى اعْمَلُوا ما شِئْتُمْ إِنَّهُ بِما تَعْمَلُونَ بَصِيرٌ. فإن قلت: كيف جاز أن يأمر الله تعالى بالكفر وبأن يعمل العصاة ما شاءوا، وهو ناه عن ذلك ومتوعد عليه؟ قلت: هو مجاز عن الخذلان والتخلية، وأن ذلك الأمر متسخط إلى غاية. ومثاله أن ترى الرجل قد عزم على أمر، وعندك أنّ ذلك الأمر خطأ، وأنه يؤدى إلى ضرر عظيم، فتبالغ في نصحه واستنزاله عن رأيه، فإذا لم تر منه إلا الإباء والتصميم، حردت عليه وقلت:\n\nأنت وشأنك وافعل ما شئت، فلا تريد بهذا حقيقة الأمر. وكيف والآمر بالشيء مريد له، وأنت شديد الكراهة متحسر، ولكنك كأنك تقول له: فإذ قد أبيت قبول النصيحة، فأنت أهل ليقال لك: افعل ما شئت وتبعث عليه، ليتبين لك- إذا فعلت- صحة رأى الناصح وفساد رأيك.","surah_id":29,"source_id":9},{"ayah_number":67,"ayah_text":"أَوَلَمْ يَرَوْا أَنَّا جَعَلْنا حَرَماً آمِناً وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ أَفَبِالْباطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ يَكْفُرُونَ (67)","text":"كانت العرب حول مكة يغزو بعضهم بعضا، ويتغاورون، ويتناهبون، وأهل مكة قارّون آمنون فيها، لا يغزون ولا يغار عليهم مع قلتهم وكثرة العرب، فذكرهم الله هذه النعمة الخاصة عليهم، ووبخهم بأنهم يؤمنون بالباطل الذي هم عليه، ومثل هذه النعمة المكشوفة الظاهرة وغيرها من النعم التي لا يقدر عليها إلا الله وحده مكفورة عندهم.","surah_id":29,"source_id":9},{"ayah_number":68,"ayah_text":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرى عَلَى اللَّهِ كَذِباً أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جاءَهُ أَلَيْسَ فِي جَهَنَّمَ مَثْوىً لِلْكافِرِينَ (68)","text":"افتراؤهم على الله كذبا: زعمهم أن لله شريكا. وتكذيبهم بما جاءهم من الحق: كفرهم بالرسول والكتاب. وفي قوله لَمَّا جاءَهُ تسفيه لهم، يعنى: لم يتلعثموا في تكذيبه وقت سمعوه، ولم يفعلوا كما يفعل المراجيح العقول المثبتون في الأمور: يسمعون الخبر فيستعملون فيه الروية والفكر، ويستأنون إلى أن يصح لهم صدقه أو كذبه أَلَيْسَ تقرير لثوائهم في جهنم، كقوله:\n\nألستم خير من ركب المطايا\n\nقال بعضهم: ولو كان استفهاما ما أعطاه الخليفة مائة من الإبل. وحقيقته: أن الهمزة همزة الإنكار دخلت على النفي، فرجع إلى معنى التقرير، فهما وجهان، أحدهما: ألا يثوون في جهنم، وألا يستوجبون الثواء فيها، وقد افتروا مثل هذا الكذب على الله، وكذبوا بالحق هذا التكذيب والثاني: ألم يصح عندهم أن في جهنم مثوى للكافرين، حتى اجترءوا مثل هذه الجرأة؟.","surah_id":29,"source_id":9},{"ayah_number":69,"ayah_text":"وَالَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ (69)","text":"أطلق المجاهدة ولم يقيدها بمفعول، ليتناول كل ما يجب مجاهدته من النفس الأمّارة بالسوء والشيطان وأعداء الدين فِينا في حقنا ومن أجلنا ولوجهنا خالصا لَنَهْدِيَنَّهُمْ سُبُلَنا لنزيدنهم هداية إلى سبل الخير وتوفيقا، كقوله تعالى وَالَّذِينَ اهْتَدَوْا زادَهُمْ هُدىً وعن أبى سليمان الداراني: والذين جاهدوا فيما علموا لنهدينهم إلى ما لم يعلموا. وعن بعضهم: من عمل بما يعلم وفق لما لا يعلم. وقيل: إن الذي نرى من جهلنا بما لا نعلم، إنما هو من تقصيرنا فيما نعلم لَمَعَ الْمُحْسِنِينَ لناصرهم ومعينهم.\n\nوعن رسول الله صلى الله عليه وسلم «من قرأ سورة العنكبوت كان له من الأجر عشر حسنات بعدد كل المؤمنين والمنافقين ».","surah_id":29,"source_id":9}]