[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، وآياتها 5 «نزلت بعد الكافرون» بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":105,"source_id":9},{"ayah_number":1,"ayah_text":"أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحابِ الْفِيلِ (1) أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ (2) وَأَرْسَلَ عَلَيْهِمْ طَيْراً أَبابِيلَ (3) تَرْمِيهِمْ بِحِجارَةٍ مِنْ سِجِّيلٍ (4) فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ (5)","text":"روى أنّ أبرهة بن الصباح الأشرم ملك اليمن من قبل أصحمة النجاشي بنى كنيسة بصنعاء وسماها القليس ، وأراد أن يصرف إليها الحاج، فخرج رجل من كنانة فقعد فيها ليلا ، فأغضبه ذلك. وقيل: أججت رفقة من العرب نارا فحملتها الريح فأحرقتها، فحلف ليهدمنّ الكعبة فخرج بالحبشة ومعه فيل له اسمه محمود، وكان قويا عظيما، واثنا عشر فيلا غيره. وقيل: ثمانية.\n\nوقيل: كان معه ألف فيل، وكان وحده، فلما بلغ المغمس خرج إليه عبد المطلب وعرض عليه ثلث أموال تهامة ليرجع، فأبى وعبأ جيشه وقدّم الفيل، فكانوا كلما وجهوه إلى الحرم برك ولم يبرح، وإذا وجهوه إلى اليمن أو إلى غيره من الجهات هرول، فأرسل الله طيرا سودا. وقيل خضرا وقيل: بيضا. مع كل طائر حجر في منقاره، وحجران في رجليه أكبر من العدسة وأصغر من الحمصة. وعن ابن عباس رضى الله عنهما أنه رأى منها عند أم هانئ نحو قفيز مخططة بحمرة كالجزع الظفاري، فكان الحجر يقع على رأس الرجل فيخرج من دبره، وعلى كل حجر اسم من يقع عليه، ففروا فهلكوا في كل طريق ومنهل، ودوى أبرهة فتساقطت أنامله وآرابه، وما مات حتى انصدع صدره عن قلبه. وانفلت وزيره أبو يكسوم وطائره يحلق فوقه، حتى بلغ النجاشي فقص عليه القصة، فلما أتمها وقع عليه الحجر فخر ميتا بين يديه. وقيل: كان أبرهة جدّ النجاشي الذي كان في زمن رسول الله صلى الله عليه وسلم بأربعين سنة، وقيل: بثلاث وعشرين سنة . وعن عائشة رضى الله عنها: رأيت قائد الفيل وسائسه أعميين مقعدين يستطعمان. وفيه أن أبرهة أخذ لعبد المطلب مائتي بعير، فخرج إليه فيها، فجهره وكان رجلا جسيما وسيما.\n\nوقيل: هذا سيد قريش وصاحب عير مكة الذي يطعم الناس في السهل والوحوش في رؤوس الجبال، فلما ذكر حاجته قال: سقطت من عينى، جئت لأهدم البيت الذي هو دينك ودين آبائك وعصمتكم وشرفكم في قديم الدهر، فألهاك عنه ذود أخذ لك، فقال أنا رب الإبل، وللبيت رب سيمنعه، ثم رجع وأتى باب البيت فأخذ بحلقته وهو يقول:\n\nلاهمّ إنّ المرء يمنع ... أهله فامنع حلالك\n\nلا يغلبنّ صليبهم ... ومحالهم عدوا محالك\n\nإن كنت تاركهم وكعبتنا ... فأمر ما بدا لك\n\n يا ربّ أرجو لهم سوا كا ... يا ربّ فامنع منهم حما كا\n\nفالتفت وهو يدعو فإذا هو بطير من نحو اليمن فقال: والله إنها لطير غريبة ما هي ببحرية ولا تهامية . وفيه: أنّ أهل مكة قد احتووا على أموالهم، وجمع عبد المطلب من جواهرهم وذهبهم الجور ، وكان سبب يساره. وعن أبى سعيد الخدري رضى الله عنه أنه سئل عن الطير فقال: حمام مكة منها. وقيل جاءت عشية ثم صبحتهم. وعن عكرمة: من أصابته جدّرته وهو أوّل جدري ظهر. وقرئ: ألم تر، بسكون الراء للجد في إظهار أثر الجازم: والمعنى:\n\nأنك رأيت آثار فعل الله بالحبشة، وسمعت الأخبار به متواترة، فقامت لك مقام المشاهدة.\n\nوكَيْفَ في موضع نصب بفعل ربك، لا بألم تر، لما في كَيْفَ من معنى الاستفهام فِي تَضْلِيلٍ في تضييع وإبطال. يقال: ضلل كيده، إذا جعله ضالا ضائعا. ومنه قوله تعالى وَما كَيْدُ الْكافِرِينَ إِلَّا فِي ضَلالٍ وقيل لامرئ القيس: الملك الضليل، لأنه ضلل ملك أبيه، أى. ضيعه، يعنى: أنهم كادوا البيت أوّلا ببناء القليس، وأرادوا أن ينسخوا أمره بصرف وجوه الحاج إليه، فضلل كيدهم بإيقاع الحريق فيه، وكادوه ثانيا بإرادة هدمه، فضلل بإرسال الطير عليهم أَبابِيلَ حزائق، الواحدة: إبالة. وفي أمثالهم: ضغث على إبالة، وهي: الحزمة الكبيرة، شبهت الحزقة من الطير في تضامّها بالإبالة. وقيل: أبابيل مثل عباديد، وشماطيط لا واحد لها وقرأ أبو حنيفة رحمه الله، يرميهم، أى الله تعالى أو الطير، لأنه اسم جمع مذكر، وإنما يؤنث على المعنى. وسجيل: كأنه علم للديوان الذي كتب فيه عذاب الكفار، كما أن سجينا علم لديوان أعمالهم، كأنه قيل: بحجارة من جملة العذاب المكتوب المدوّن، واشتقاقه من الإسجال وهو الإرسال، لأنّ العذاب موصوف بذلك، وأرسل عليهم طيرا، فأرسلنا عليهم الطوفان. وعن ابن عباس رضى الله عنهما: من طين مطبوخ كما يطبخ الآجر. وقيل: هو معرب من سنككل. وقيل: من شديد عذابه، ورووا بيت ابن مقبل:\n\nضربا تواصت به الأبطال سجّيلا\n\nوإنما هو سجينا، والقصيدة نونية مشهورة في ديوانه، وشبهوا بورق الزرع إذا أكل، أى:\n\nوقع فيه الأكال: وهو أن يأكله الدود. أو بتبن أكلته الدواب وراثته، ولكنه جاء على ما عليه آداب القرآن، كقوله كانا يَأْكُلانِ الطَّعامَ أو أريد: أكل حبه فبقى صفرا منه.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة الفيل أعفاه الله أيام حياته من الخسف والمسخ».","surah_id":105,"source_id":9}]