[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"سورة محمد صلى الله عليه وسلم\n\nمدنية عند مجاهد. وقال الضحاك وسعيد بن جبير: مكية. وهي سورة القتال وهي تسع وثلاثون آية. وقيل ثمان وثلاثون [نزلت بعد الحديد] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":47,"source_id":9},{"ayah_number":1,"ayah_text":"الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمالَهُمْ (1) وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ وَآمَنُوا بِما نُزِّلَ عَلى مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ كَفَّرَ عَنْهُمْ سَيِّئاتِهِمْ وَأَصْلَحَ بالَهُمْ (2)","text":"\nوَصَدُّوا. وأعرضوا وامتنعوا عن الدخول في الإسلام: أو صدّوا غيرهم عنه. قال ابن عباس رضى الله عنه: هم المطعمون يوم بدر. وعن مقاتل: كانوا اثنى عشر رجلا من أهل الشرك يصدّون الناس عن الإسلام ويأمرونهم بالكفر. وقيل: هم أهل الكتاب الذين كفروا وصدّوا من أراد منهم ومن غيرهم أن يدخل في الإسلام. وقيل: هو عامّ في كل من كفر وصدّ أَضَلَّ أَعْمالَهُمْ أبطلها وأحبطها. وحقيقته: جعلها ضالة ضائعة ليس لها من يتقبلها ويثيب عليها، كالضالة من الإبل التي هي بمضيعة لا ربّ لها يحفظها ويعتنى بأمرها. أو جعلها ضالة في كفرهم ومعاصيهم ومغلوبة بها، كما يضل الماء في اللبن. وأعمالهم: ما عملوه في كفرهم بما كانوا يسمونه مكارم: من صلة الأرحام وفك الأسارى وقرى الأضياف وحفظ الجوار.\n\nوقيل: أبطل ما عملوه من الكيد لرسول الله صلى الله عليه وسلم والصدّ عن سبيل الله: بأن نصره عليهم وأظهر دينه على الدين كله وَالَّذِينَ آمَنُوا قال مقاتل: هم ناس من قريش. وقيل: من الأنصار. وقيل: هم مؤمنو أهل الكتاب. وقيل: هو عام. وقوله وَآمَنُوا بِما نُزِّلَ عَلى مُحَمَّدٍ اختصاص للإيمان بالمنزل على رسول الله صلى الله عليه وسلم من بين ما يجب به الإيمان تعظيما لشأنه وتعليما، لأنه لا يصح الإيمان ولا يتم إلا به. وأكد ذلك بالجملة الاعتراضية التي هي قوله وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ وقيل: معناها إنّ دين محمد هو الحق، إذ لا يرد عليه النسخ، وهو ناسخ لغيره. وقرئ:\n\nنزل وأنزل، على البناء للمفعول. ونزّل على البناء للفاعل، ونزل بالتخفيف كَفَّرَ عَنْهُمْ سَيِّئاتِهِمْ ستر بإيمانهم وعملهم الصالح ما كان منهم من الكفر والمعاصي لرجوعهم عنها وتوبتهم وَأَصْلَحَ بالَهُمْ أى حالهم وشأنهم بالتوفيق في أمور الدين، وبالتسليط على الدنيا بما أعطاهم من النصرة والتأييد.","surah_id":47,"source_id":9},{"ayah_number":3,"ayah_text":"ذلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْباطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ كَذلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثالَهُمْ (3)","text":"ذلِكَ مبتدأ وما بعده خبره، أى: ذلك الأمر وهو إضلال أعمال أحد الفريقين وتكفير سيئات الثاني: كائن بسبب اتباع هؤلاء الباطل وهؤلاء الحق. ويجوز أن يكون ذلك خبر مبتدإ محذوف، أى. الأمر كما ذكر بهذا السبب، فيكون محل الجار والمجرور منصوبا على هذا، ومرفوعا على الأوّل والْباطِلَ ما لا ينتفع به. وعن مجاهد: الباطل الشيطان: وهذا الكلام يسميه علماء البيان التفسير كَذلِكَ مثل ذلك الضرب يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثالَهُمْ والضمير راجع إلى الناس، أو إلى المذكورين من الفريقين، على معنى: أنه يضرب أمثالهم لأجل الناس ليعتبروا بهم. فإن قلت: أين ضرب الأمثال؟ قلت: في أن جعل اتباع الباطل مثلا لعمل الكفار، واتباع الحق مثلا لعمل المؤمنين. أو في أن جعل الإضلال مثلا لخيبة الكفار، وتكفير السيئات مثلا لفوز المؤمنين.","surah_id":47,"source_id":9},{"ayah_number":4,"ayah_text":"فَإِذا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها ذلِكَ وَلَوْ يَشاءُ اللَّهُ لانْتَصَرَ مِنْهُمْ وَلكِنْ لِيَبْلُوَا بَعْضَكُمْ بِبَعْضٍ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَنْ يُضِلَّ أَعْمالَهُمْ (4) سَيَهْدِيهِمْ وَيُصْلِحُ بالَهُمْ (5) وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَها لَهُمْ (6)","text":"لَقِيتُمُ من اللقاء وهو الحرب فَضَرْبَ الرِّقابِ أصله: فاضربوا الرقاب ضربا، فحذف الفعل وقدّم المصدر فأنيب منابه مضافا إلى المفعول. وفيه اختصار مع إعطاء معنى التوكيد، لأنك تذكر المصدر وتدل على الفعل بالنصبة التي فيه. وضرب الرقاب عبارة عن القتل، لأنّ الواجب أن تضرب الرقاب خاصة دون غيرها من الأعضاء، وذلك أنهم كانوا يقولون:\n\nضرب الأمير رقبة فلان، وضرب عنقه وعلاوته، وضرب ما فيه عيناه إذا قتله، وذلك أن قتل الإنسان أكثر ما يكون بضرب رقبته، فوقع عبارة عن القتل، وإن ضرب بغير رقبته من المقاتل كما ذكرنا في قوله فَبِما كَسَبَتْ أَيْدِيكُمْ على أن في هذه العبارة من الغلظة والشدّة ما ليس في لفظ القتل، لما فيه من تصوير القتل بأشنع صورة وهو حز العنق وإطارة العضو الذي هو رأس البدن وعلوه وأوجه أعضائه. ولقد زاد في هذه الغلظة في قوله تعالى فَاضْرِبُوا فَوْقَ الْأَعْناقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنانٍ. أَثْخَنْتُمُوهُمْ أكثرتم قتلهم وأغلظتموه، من الشيء الثخين: وهو الغليظ. أو أثقلتموهم بالقتل والجراح حتى أذهبتم عنهم النهوض فَشُدُّوا الْوَثاقَ فأسروهم.\n\nوالوثاق بالفتح والكسر: - اسم ما يوثق به مَنًّا وفِداءً منصوبان بفعليهما مضمرين، أى: فإمّا تمنون منا، وإما تفدون فداء. والمعنى: التخيير بعد الأسر بين أن يمنوا عليهم فيطلقوهم، وبين أن يفادوهم. فإن قلت: كيف حكم أسارى المشركين؟ قلت: أمّا عند أبى حنيفة وأصحابه فأحد أمرين: إمّا قتلهم وإمّا استرقاقهم: أيهما رأى الإمام، ويقولون في المنّ والفداء المذكورين في الآية: نزل ذلك في يوم بدر ثم نسخ. وعن مجاهد: ليس اليوم منّ ولا فداء، وإنما هو الإسلام أو ضرب العنق. ويجوز أن يراد بالمنّ: أن يمنّ عليهم بترك القتل ويسترقوا. أو يمنّ عليهم فيخلوا لقبولهم الجزية، وكونهم من أهل الذمّة. وبالفداء أن يفادى بأساراهم أسارى المشركين، فقد رواه الطحاوي مذهبا عن أبى حنيفة، والمشهور أنه لا يرى فداءهم لا بمال ولا بغيره، خيفة أن يعودوا حربا للمسلمين، وأما الشافعي فيقول: للإمام أن يختار أحد أربعة على حسب ما اقتضاه نظره للمسلمين، وهو: القتل، والاسترقاق ، والفداء بأسارى المسلمين، والمن. ويحتج بأن رسول الله صلى الله عليه وسلم منّ على أبى عروة الحجبي ، وعلى ثمامة بن أثال الحنفي، وفادى رجل برجلين من المشركين : وهذا كله منسوخ عند أصحاب الرأى. وقرئ: فدى، بالقصر مع فتح الفاء. أوزار الحرب: آلاتها وأثقالها التي لا تقوم إلا بها كالسلاح والكراع. قال الأعشى:\n\nوأعددت للحرب أوزارها ... رماحا طوالا وخيلا ذكورا\n\nوسميت أوزارها لأنه لما لم يكن لها بد من جرّها فكأنها تحملها وتستقل بها، فإذا انقضت فكأنها وضعتها. وقيل. أوزارها آثامها، يعنى: حتى يترك أهل الحرب. هم المشركون شركهم ومعاصيهم بأن يسلموا. فإن قلت: حَتَّى بم تعلقت؟ قلت: لا تخلو إما أن تتعلق بالضرب والشد: أو بالمن والفداء، فالمعنى على كلا المتعلقين عند الشافعي رضى الله عنه: أنهم لا يزالون على ذلك أبدا إلى أن لا يكون حرب مع المشركين. وذلك إذا لم يبق لهم شوكة. وقيل:\n\nإذا نزل عيسى ابن مريم عليه السلام. وعند أبى حنيفة رحمه الله: إذا علق بالضرب والشد، فالمعنى: أنهم يقتلون ويؤسرون حتى تضع جنس الحرب الأوزار، وذلك حين لا تبقى شوكة للمشركين. وإذا علق بالمن والفداء، فالمعنى: أنه يمن عليهم ويفادون حتى تضع حرب بدر أوزارها إلا أن يتأول المن والفداء بما ذكرنا من التأويل ذلِكَ أى الأمر ذلك، أو افعلوا ذلك لَانْتَصَرَ مِنْهُمْ لانتقم منهم ببعض أسباب الهلك: من خسف، أو رجفة، أو حاصب، أو غرق. أو موت جارف، وَلكِنْ أمركم بالقتال ليبلو المؤمنين بالكافرين: أن يجاهدوا ويصبروا حتى يستوجبوا الثواب العظيم، والكافرين بالمؤمنين بأن يعاجلهم على أيديهم ببعض ما وجب لهم من العذاب. وقرئ: قتلوا، بالتخفيف والتشديد: وقتلوا. وقاتلوا. وقرئ:\n\nفلن يضل أعمالهم، وتضل أعمالهم: على البناء للمفعول. ويضل أعمالهم من ضل. وعن قتادة:\n\nأنها نزلت في يوم أحد عَرَّفَها لَهُمْ أعلمها لهم وبينها بما يعلم به كل أحد منزلته ودرجته من الجنة. قال مجاهد: يهتدى أهل الجنة إلى مساكنهم منها لا يخطئون، كأنهم كانوا سكانها منذ خلقوا لا يستدلون عليها. وعن مقاتل: إن الملك الذي وكل بحفظ عمله في الدنيا يمشى بين يديه فيعرفه كل شيء أعطاه الله. أو طيبها لهم، من العرف: وهو طيب الرائحة. وفي كلام بعضهم:\n\nعزف كنوح القمارى ، وعرف كفوح القمارى. أو حددها لهم، فجنة كل أحد محدودة مفرزة عن غيرها، من: عرف الدار وارفها. والعرف والارف، الحدود.","surah_id":47,"source_id":9},{"ayah_number":7,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَنْصُرُوا اللَّهَ يَنْصُرْكُمْ وَيُثَبِّتْ أَقْدامَكُمْ (7)","text":"إِنْ تَنْصُرُوا دين اللَّهَ ورسوله يَنْصُرْكُمْ على عدوكم ويفتح لكم وَيُثَبِّتْ أَقْدامَكُمْ في مواطن الحرب أو على محجة الإسلام.","surah_id":47,"source_id":9},{"ayah_number":8,"ayah_text":"وَالَّذِينَ كَفَرُوا فَتَعْساً لَهُمْ وَأَضَلَّ أَعْمالَهُمْ (8) ذلِكَ بِأَنَّهُمْ كَرِهُوا ما أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمالَهُمْ (9)","text":"وَالَّذِينَ كَفَرُوا يحتمل الرفع على الابتداء والنصب بما يفسره فَتَعْساً لَهُمْ كأنه قال:\n\nأتعس الذين كفروا. فإن قلت: علام عطف قوله وَأَضَلَّ أَعْمالَهُمْ؟ قلت: على الفعل الذي نصب تعسا، لأنّ المعنى فقال: تعسا لهم، أو فقضى تعسا لهم. وتعسا له: نقيض «لعاله» قال الأعشى:\n\nفالتّعس أولى لها من أن أقول لعا يريد: فالعثور والانحطاط أقرب لها من الانتعاش والثبوت. وعن ابن عباس رضى الله عنهما: يريد في الدنيا القتل، وفي الآخرة التردي في النار كَرِهُوا القرآن وما أنزل الله فيه من التكاليف والأحكام، لأنهم قد ألفوا الإهمال وإطلاق العنان في الشهوات والملاذ فشق عليهم ذلك وتعاظمهم.","surah_id":47,"source_id":9},{"ayah_number":10,"ayah_text":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كانَ عاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ دَمَّرَ اللَّهُ عَلَيْهِمْ وَلِلْكافِرِينَ أَمْثالُها (10)","text":"دمره: أهلكه، ودمر عليه: أهلك عليه ما يختص به. والمعنى: دمر الله عليهم ما اختص بهم من أنفسهم وأموالهم وأولادهم وكل ما كان لهم وَلِلْكافِرِينَ أَمْثالُها الضمير للعاقبة المذكورة أو للهلكة، لأن التدمير يدل عليها. أو للسنة، لقوله عزّ وعلا سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا.","surah_id":47,"source_id":9},{"ayah_number":11,"ayah_text":"ذلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكافِرِينَ لا مَوْلى لَهُمْ (11)","text":"مَوْلَى الَّذِينَ آمَنُوا وليهم وناصرهم. وفي قراءة ابن مسعود: ولى الذين آمنوا. ويروى أن رسول الله صلى الله عليه وسلم كان في الشعب يوم أحد وقد فشت فيهم الجراحات، وفيه نزلت، فنادى المشركون: اعل هبل: فنادى المسلمون: الله أعلى وأجل، فنادى المشركون:\n\nيوم بيوم والحرب سجال، إن لنا عزى ولا عزى لكم فقال رسول الله صلى الله عليه وسلم:\n\n«قولوا الله مولانا ولا مولى لكم، إن القتلى مختلفة أما قتلانا فأحياء يرزقون وأما قتلاكم ففي النار يعذبون . فإن قلت: قوله تعالى وَرُدُّوا إِلَى اللَّهِ مَوْلاهُمُ الْحَقِّ مناقض لهذه الآية. قلت:\n\nلا تناقض بينهما، لأن الله مولى عباده جميعا على معنى أنه ربهم ومالك أمرهم وأما على معنى الناصر فهو مول المؤمنين خاصة.","surah_id":47,"source_id":9},{"ayah_number":12,"ayah_text":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهارُ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَما تَأْكُلُ الْأَنْعامُ وَالنَّارُ مَثْوىً لَهُمْ (12)","text":"يَتَمَتَّعُونَ ينتفعون بمتاع الحياة الدنيا أياما قلائل وَيَأْكُلُونَ غافلين غير مفكرين في العاقبة كَما تَأْكُلُ الْأَنْعامُ في مسارحها ومعالفها، غافلة عما هي بصدده من النحر والذبح مَثْوىً لَهُمْ منزل ومقام.","surah_id":47,"source_id":9},{"ayah_number":13,"ayah_text":"وَكَأَيِّنْ مِنْ قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِنْ قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْناهُمْ فَلا ناصِرَ لَهُمْ (13)","text":"وقرئ: وكائن، بوزن كاعن . وأراد بالقرية أهلها، ولذلك قال أَهْلَكْناهُمْ كأنه قال: وكم من قوم هم أشد قوّة من قومك الذين أخرجوك أهلكناهم. ومعنى أخرجوك: كانوا سبب خروجك. فإن قلت: كيف قال فَلا ناصِرَ لَهُمْ؟ وإنما هو أمر قد مضى. قلت:\n\nمجراه مجرى الحال المحكية، كأنه قال أهلكناهم فهم لا ينصرون.","surah_id":47,"source_id":9},{"ayah_number":14,"ayah_text":"أَفَمَنْ كانَ عَلى بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْواءَهُمْ (14)","text":"من زين له: هم أهل مكة الذين زين لهم الشيطان شركهم وعداوتهم لله ورسوله، ومن كان على بينة من ربه أى على حجة من عنده وبرهان: وهو القرآن المعجز وسائر المعجزات هو رسول الله صلى الله عليه وسلم. وقرئ: أمن كان على بينة من ربه. وقال تعالى سُوءُ عَمَلِهِ وَاتَّبَعُوا للحمل على لفظ مِنْ ومعناه.","surah_id":47,"source_id":9},{"ayah_number":15,"ayah_text":"مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيها أَنْهارٌ مِنْ ماءٍ غَيْرِ آسِنٍ وَأَنْهارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهارٌ مِنْ عَسَلٍ مُصَفًّى وَلَهُمْ فِيها مِنْ كُلِّ الثَّمَراتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ كَمَنْ هُوَ خالِدٌ فِي النَّارِ وَسُقُوا ماءً حَمِيماً فَقَطَّعَ أَمْعاءَهُمْ (15)","text":"فإن قلت: ما معنى قوله تعالى مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيها أَنْهارٌ كمن هو خالد في النار؟\n\nقلت: هو كلام في صورة الإثبات ومعنى النفي والإنكار ، لانطوائه تحت حكم كلام مصدّر بحرف الإنكار، ودخوله في حيزه، وانخراطه في سلكه، وهو قوله تعالى أَفَمَنْ كانَ عَلى بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فكأنه قيل: أمثل الجنة كمن هو خالد في النار، أى كمثل جزاء من هو خالد في النار. فإن قلت: فلم عرّى في حرف الإنكار؟ وما فائدة التعرية؟ قلت:\n\nتعريته من حرف الإنكار فيها زيادة تصوير لمكابرة من يسوّى بين المتمسك بالبينة والتابع لهواه، وأنه بمنزلة من يثبت التسوية بين الجنة التي تجرى فيها تلك الأنهار، وبين النار التي يسقى أهلها الحميم. ونظيره قول القائل:\n\nأفرح أن أرزأ الكرام وأن ... أورث ذودا شصائصا نبلا\n\nهو كلام منكر للفرح برزية الكرام ووراثة الذود، مع تعريه عن حرف الإنكار لانطوائه تحت حكم قول من قال: أتفرح بموت أخيك وبوراثة إبله، والذي طرح لأجله حرف الإنكار إرادة أن يصوّر قبح ما أزن به فكأنه قال له: نعم مثلي يفرح بمرزاة الكرام وبأن يستبدل منهم ذودا يقل طائله ، وهو من التسليم الذي تحته كل إنكار، ومثل الجنة: صفة الجنة العجيبة الشأن، وهو مبتدأ، وخبره: كمن هو خالد. وقوله: فيها أنهار، داخل في حكم الصلة كالتكرير لها. ألا ترى إلى صحة قولك: التي فيها أنهار. ويجوز أن يكون خبر مبتدأ محذوف هي فيها أنهار، وكأن قائلا قال: وما مثلها؟ فقيل: فيها أنهار، وأن يكون في موضع الحال، أى: مستقرّة فيها أنهار، وفي قراءة على رضى الله عنه: أمثال الجنة، أى: ما صفاتها كصفات النار. وقرئ: أسن. يقال: أسن الماء وأجن: إذا تغير طعمه وريحه. وأنشد ليزيد بن معاوية:\n\nلقد سقتني رضابا غير ذى أسن ... كالمسك فتّ على ماء العناقيد\n\nمِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ كما تتغير ألبان الدنيا، فلا يعود قارصا ولا حاذرا ، ولا ما يكره من الطعوم لَذَّةٍ تأنيث لذّ، وهو اللذيذ، أو وصف بمصدر. وقرئ بالحركات الثلاث، فالجر على صفه الخمر، والرفع على صفة الأنهار، والنصب على العلة، أى: لأجل لذة الشاربين.\n\nوالمعنى: ما هو إلا التلذذ الخالص، ليس معه ذهاب عقل ولا خمار ولا صداع، ولا آفة من آفات الخمر مُصَفًّى لم يخرج من بطون النحل فيخالطه الشمع وغيره ماءً حَمِيماً قيل إذا دنا منهم شوى وجوههم، وانمازت فروة رءوسهم، فإذا شربوه قطع أمعاءهم.","surah_id":47,"source_id":9},{"ayah_number":16,"ayah_text":"وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ حَتَّى إِذا خَرَجُوا مِنْ عِنْدِكَ قالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ ماذا قالَ آنِفاً أُولئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلى قُلُوبِهِمْ وَاتَّبَعُوا أَهْواءَهُمْ (16)","text":"هم المنافقون: كانوا يحضرون مجلس رسول الله صلى الله عليه وسلم فيسمعون كلامه ولا يعونه ولا يلقون له إلا تهاونا منهم، فإذا خرجوا قالوا لأولى العلم من الصحابة، ماذا قال الساعة؟\n\nعلى جهة الاستهزاء. وقيل: كان يخطب فإذا عاب المنافقين خرجوا فقالوا ذلك للعلماء. وقيل:\n\nقالوه لعبد الله بن مسعود. وعن ابن عباس: أنا منهم، وقد سميت فيمن سئل آنِفاً وقرئ:\n\nأنفا على فعل، نصب على الظرف قال الزجاج: هو من استأنفت الشيء: إذا ابتدأته.\n\nوالمعنى: ماذا قال في أوّل وقت يقرب منا.","surah_id":47,"source_id":9},{"ayah_number":17,"ayah_text":"وَالَّذِينَ اهْتَدَوْا زادَهُمْ هُدىً وَآتاهُمْ تَقْواهُمْ (17)","text":"زادَهُمْ الله هُدىً بالتوفيق وَآتاهُمْ تَقْواهُمْ أعانهم عليها. أو أتاهم جزاء تقواهم.\n\n وعن السدى: بين لهم ما يتقون. وقرئ: وأعطاهم. وقيل: الضمير في زادهم، لقول الرسول أو لاستهزاء المنافقين.\n","surah_id":47,"source_id":9},{"ayah_number":18,"ayah_text":"فَهَلْ يَنْظُرُونَ إِلاَّ السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً فَقَدْ جاءَ أَشْراطُها فَأَنَّى لَهُمْ إِذا جاءَتْهُمْ ذِكْراهُمْ (18)","text":"أَنْ تَأْتِيَهُمْ بدل اشتمال من الساعة، نحو: أن تطؤهم من قوله رِجالٌ مُؤْمِنُونَ وَنِساءٌ مُؤْمِناتٌ وقرئ: أن تأتهم، بالوقف على الساعة واستئناف الشرط، وهي في مصاحف أهل مكة كذلك: فإن قلت: فما جزاء الشرط؟ قلت: قوله فأنى لهم. ومعناه: إن تأتهم الساعة فكيف لهم ذكراهم، أى تذكرهم واتعاظهم إذا جاءتهم الساعة، يعنى لا تنفعهم الذكرى حينئذ، كقوله تعالى يَوْمَئِذٍ يَتَذَكَّرُ الْإِنْسانُ وَأَنَّى لَهُ الذِّكْرى. فإن قلت: بم يتصل قوله فَقَدْ جاءَ أَشْراطُها على القراءتين؟ قلت: بإتيان الساعة اتصال العلة بالمعلول، كقولك: إن أكرمنى زيد فأنا حقيق بالإكرام أكرمه. والأشراط: العلامات. قال أبو الأسود:\n\nفإن كنت قد أزمعت بالصّرم بيننا ... فقد جعلت أشراط أوّله تبدو\n\nوقيل: مبعث محمد خاتم الأنبياء صلى الله عليه وسلم وعليهم منها، وانشقاق القمر، والدخان.\n\nوعن الكلبي: كثرة المال والتجارة، وشهادة الزور، وقطع الأرحام، وقلة الكرام، وكثرة اللثام. وقرئ: بغتة بوزن جربة ، وهي غريبة لم ترد في المصادر أختها، وهي مروية عن أبى عمرو، وما أخوفنى أن تكون غلطة من الراوي على أبى عمرو، وأن يكون الصواب:\n\nبغتة، بفتح الغين من غير تشديد، كقراءة الحسن فيما تقدم.","surah_id":47,"source_id":9},{"ayah_number":19,"ayah_text":"فَاعْلَمْ أَنَّهُ لا إِلهَ إِلاَّ اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِناتِ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْواكُمْ (19)","text":"لما ذكر حال المؤمنين وحال الكافرين قال: إذا علمت أن الأمر كما ذكر من سعادة هؤلاء وشقاوة هؤلاء، فاثبت على ما أنت عليه من العلم بوحدانية الله، وعلى التواضع وهضم النفس: باستغفار ذنبك وذنوب من على دينك. والله يعلم أحوالكم ومتصرفاتكم ومتقلبكم في معايشكم ومتاجركم، ويعلم حيث تستقرون في منازلكم أو متقلبكم في حياتكم ومثواكم في القبور. أو متقلبكم في أعمالكم ومثواكم من الجنة والنار. ومثله حقيق بأن يخشى ويتقى، وأن يستغفر ويسترحم. وعن سفيان بن عيينة: أنه سئل عن فضل العلم فقال: ألم تسمع قوله حين بدأ به فقال فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ فأمر بالعمل بعد العلم وقال: اعْلَمُوا أَنَّمَا الْحَياةُ الدُّنْيا لَعِبٌ وَلَهْوٌ إلى قوله سابِقُوا إِلى مَغْفِرَةٍ مِنْ رَبِّكُمْ وقال: وَاعْلَمُوا أَنَّما أَمْوالُكُمْ وَأَوْلادُكُمْ فِتْنَةٌ ثم قال بعد فَاحْذَرُوهُمْ وقال: وَاعْلَمُوا أَنَّما غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ ثم أمر بالعمل بعد.","surah_id":47,"source_id":9},{"ayah_number":20,"ayah_text":"وَيَقُولُ الَّذِينَ آمَنُوا لَوْلا نُزِّلَتْ سُورَةٌ فَإِذا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتالُ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ فَأَوْلى لَهُمْ (20) طاعَةٌ وَقَوْلٌ مَعْرُوفٌ فَإِذا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكانَ خَيْراً لَهُمْ (21)","text":"\nكانوا يدعون الحرص على الجهاد ويتمنونه بألسنتهم ويقولون لَوْلا نُزِّلَتْ سُورَةٌ في معنى الجهاد فَإِذا أُنْزِلَتْ وأمروا فيها بما تمنوا وحرصوا عليه كاعوا وشق عليهم، وسقطوا في أيديهم، كقوله تعالى فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتالُ إِذا فَرِيقٌ مِنْهُمْ يَخْشَوْنَ النَّاسَ. مُحْكَمَةٌ مبينة غير متشابهة لا تحتمل وجها إلا وجوب القتال. وعن قتادة: كل سورة فيها ذكر القتال فهي محكمة، وهي أشدّ القرآن على المنافقين. وقيل لها «محكمة» لأنّ النسخ لا يرد عليها من قبل أنّ القتال قد نسخ ما كان من الصفح والمهادنة، وهو غير منسوخ إلى يوم القيامة. وقيل: هي المحدثة، لأنها حين يحدث نزولها لا يتناولها النسخ، ثم تنسخ بعد ذلك أو تبقى غير منسوخة.\n\nوفي قراءة عبد الله: سورة محدثة. وقرئ: فإذا نزلت سورة وذكر فيها القتال. على البناء للفاعل ونصب القتال الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ هم الذين كانوا على حرف غير ثابتى الأقدام نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ أى تشخص أبصارهم جبنا وهلعا وغيظا، كما ينظر من أصابته الغشية عند الموت فَأَوْلى لَهُمْ وعيد بمعنى: فويل لهم، وهو أفعل: من الولي وهو القرب. ومعناه الدعاء عليهم بأن يليهم المكروه طاعَةٌ وَقَوْلٌ مَعْرُوفٌ كلام مستأنف، أى: طاعة وقول معروف خير لهم. وقيل: هي حكاية قولهم، أى قالوا طاعة وقول معروف، بمعنى: أمرنا طاعة وقول معروف. وتشهد له قراءة أبىّ: يقولون طاعة وقول معروف فَإِذا عَزَمَ الْأَمْرُ أى جدّ. والعزم والجد لأصحاب الأمر. وإنما يسندان إلى الأمر إسنادا مجازيا. ومنه قوله تعالى إِنَّ ذلِكَ لَمِنْ عَزْمِ الْأُمُورِ. فَلَوْ صَدَقُوا اللَّهَ فيما زعموا من الحرص على الجهاد. أو: فلو صدقوا في إيمانهم وواطأت قلوبهم فيه ألسنتهم.","surah_id":47,"source_id":9},{"ayah_number":22,"ayah_text":"فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحامَكُمْ (22) أُولئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمى أَبْصارَهُمْ (23)","text":"عسيت وعسيتم: لغة أهل الحجاز. وأما بنو تميم فيقولون: عسى أن تفعل، وعسى أن تفعلوا، ولا يلحقون الضمائر: وقرأ نافع بكسر السين وهو غريب، وقد نقل الكلام من الغيبة إلى الخطاب على طريقة الالتفات، ليكون أبلغ في التوكيد. فإن قلت: ما معنى: فهل عسيتم ... أن تفسدوا في الأرض؟ قلت: معناه: هل يتوقع منكم الإفساد؟ فإن قلت: فكيف يصح هذا في كلام الله عز وعلا وهو عالم بما كان وما يكون؟ قلت: معناه إنكم- لما عهد منكم- أحقاء بأن يقول لكم كل من ذاقكم وعرف تمريضكم ورخاوة عقدكم في الإيمان: يا هؤلاء، ما ترون؟ هل يتوقع منكم إن توليتم أمور الناس وتأمرتم عليهم لما تبين منكم من الشواهد ولاح من المخايل أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحامَكُمْ تناحرا على الملك وتهالكا على الدنيا؟ وقيل: إن أعرضتم وتوليتم عن دين رسول الله صلى الله عليه وسلم وسنته أن ترجعوا إلى ما كنتم عليه في الجاهلية من الإفساد في الأرض: بالتغاور والتناهب، وقطع الأرحام:\n\nبمقاتلة بعض الأقارب بعضا ووأد البنات؟ وقرئ: وليتم . وفي قراءة على بن أبى طالب رضى الله عنه: توليتم، أى: إن تولاكم ولاة غشمة خرجتم معهم ومشيتم تحت لوائهم وأفسدتم بإفسادهم؟ وقرئ: وتقطعوا، وتقطعوا، من التقطيع والتقطع أُولئِكَ إشارة إلى المذكورين لَعَنَهُمُ اللَّهُ لإفسادهم وقطعهم الأرحام، فمنعهم ألطافه وخذلهم، حتى صموا عن استماع الموعظة، وعموا عن إبصار طريق الهدى. ويجوز أن يريد بالذين آمنوا: المؤمنين الخلص الثابتين، وأنهم يتشوفون إلى الوحى إذا أبطأ عليهم، فإذا أنزلت سورة في معنى الجهاد:\n\nرأيت المنافقين فيما بينهم يضجرون منها.","surah_id":47,"source_id":9},{"ayah_number":24,"ayah_text":"أَفَلا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلى قُلُوبٍ أَقْفالُها (24)","text":"أَفَلا يَتَدَبَّرُونَ الْقُرْآنَ ويتصفحونه وما فيه من المواعظ والزواجر ووعيد العصاة، حتى لا يجسروا على المعاصي، ثم قال أَمْ عَلى قُلُوبٍ أَقْفالُها وأم بمعنى بل وهمزة التقرير، للتسجيل عليهم بأن قلوبهم مقفلة لا يتوصل إليها ذكر. وعن قتادة: إذا والله يجدوا في القرآن زاجرا عن معصية الله لو تدبروه، ولكنهم أخذوا بالمتشابه فهلكوا. فإن قلت: لم نكرت القلوب وأضيفت الأقفال إليها؟ قلت: أما التنكير ففيه وجهان: أن يراد على قلوب قاسية مبهم أمرها في ذلك.\n\nأو يراد على بعض القلوب: وهي قلوب المنافقين. وأما إضافة الأقفال، فلأنه يريد الأقفال المختصة بها، وهي أقفال الكفر التي استغلقت فلا تنفتح. وقرئ: إقفالها، على المصدر.","surah_id":47,"source_id":9},{"ayah_number":25,"ayah_text":"إِنَّ الَّذِينَ ارْتَدُّوا عَلى أَدْبارِهِمْ مِنْ بَعْدِ ما تَبَيَّنَ لَهُمُ الْهُدَى الشَّيْطانُ سَوَّلَ لَهُمْ وَأَمْلى لَهُمْ (25) ذلِكَ بِأَنَّهُمْ قالُوا لِلَّذِينَ كَرِهُوا ما نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ وَاللَّهُ يَعْلَمُ إِسْرارَهُمْ (26) فَكَيْفَ إِذا تَوَفَّتْهُمُ الْمَلائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبارَهُمْ (27) ذلِكَ بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوانَهُ فَأَحْبَطَ أَعْمالَهُمْ (28)","text":"الشَّيْطانُ سَوَّلَ لَهُمْ جملة من مبتدإ وخبر وقعت خبرا لإنّ، كقولك: إنّ زيدا عمرو مرّ به. سوّل لهم: سهل لهم ركوب العظائم، من السول وهو الاسترخاء، وقد اشتقه من السؤل من لا علم له بالتصريف والاشتقاق جميعا وَأَمْلى لَهُمْ ومدّ لهم في الآمال والأمانى. وقرئ وأملى لهم، يعنى: إنّ الشيطان يغويهم وأنا أنظرهم، كقوله تعالى أَنَّما نُمْلِي لَهُمْ وقرئ: وأملى لهم على البناء للمفعول، أى: أمهلوا ومدّ في عمرهم. وقرئ: سوّل لهم ، ومعناه: كيد الشيطان زين لهم على تقدير حذف المضاف. فإن قلت: من هؤلاء؟ قلت: اليهود كفروا بمحمد صلى الله عليه وسلم من بعد ما تبين لهم الهدى، وهو نعته في التوراة. وقيل: هم المنافقون.\n\nالذين قالوا القائلون: اليهود. والذين كرهوا ما نزل الله: المنافقون. وقيل عكسه، وأنه قول المنافقين لقريظة والنضير: لئن أخرجتم لنخرجنّ معكم. وقيل بَعْضِ الْأَمْرِ: التكذيب برسول الله صلى الله عليه وسلم، أو بلا إله إلا الله، أو ترك القتال معه. وقيل: هو قول أحد الفريقين للمشركين: سنطيعكم في التظافر على عداوة رسول الله صلى الله عليه وسلم والقعود عن الجهاد معه. ومعنى فِي بَعْضِ الْأَمْرِ في بعض ما تأمرون به. أو في بعض الأمر الذي يهمكم وَاللَّهُ يَعْلَمُ إِسْرارَهُمْ وقرئ: إسرارهم على المصدر، قالوا ذلك سرا فيما بينهم، فأفشاه الله عليهم. فكيف يعملون وما حيلتهم حينئذ؟ وقرئ: توفاهم، ويحتمل أن يكون ماضيا، ومضارعا قد حذفت إحدى تاءيه، كقوله تعالى إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلائِكَةُ وعن ابن عباس رضى الله عنهما: لا يتوفى أحد على معصية الله إلا يضرب من الملائكة في وجهه ودبره ذلِكَ إشارة إلى التوفي الموصوف ما أَسْخَطَ اللَّهَ من كتمان نعت رسول الله صلى الله عليه وسلم. ورِضْوانَهُ الإيمان برسول الله.","surah_id":47,"source_id":9},{"ayah_number":29,"ayah_text":"أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ أَنْ لَنْ يُخْرِجَ اللَّهُ أَضْغانَهُمْ (29) وَلَوْ نَشاءُ لَأَرَيْناكَهُمْ فَلَعَرَفْتَهُمْ بِسِيماهُمْ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ وَاللَّهُ يَعْلَمُ أَعْمالَكُمْ (30)","text":"أَضْغانَهُمْ أحقادهم وإخراجها: إبرازها لرسول الله صلى الله عليه وسلم وللمؤمنين، وإظهارهم على نفاقهم وعداوتهم لهم، وكانت صدورهم تغلى حنقا عليهم لَأَرَيْناكَهُمْ لعرفناكهم ودللناك عليهم. حتى تعرفهم بأعيانهم لا يخفون عليك بِسِيماهُمْ بعلامتهم: وهو أن يسمعهم الله تعالى بعلامة تعلمون بها. وعن أنس رضى الله عنه: ما خفى على رسول الله صلى الله عليه وسلم بعد هذه الآية شيء من المنافقين: كان يعرفهم بسيماهم، ولقد كنا في بعض الغزوات وفيها تسعة من المنافقين يشكوهم الناس، فناموا ذات ليلة وأصبحوا وعلى جبهة كل واحد منهم مكتوب: هذا منافق . فإن قلت: أى فرق بين اللامين في فَلَعَرَفْتَهُمْ ولَتَعْرِفَنَّهُمْ؟ قلت: الأولى هي الداخلة في جواب «لو» كالتي في لَأَرَيْناكَهُمْ كررت في المعطوف، وأما اللام في وَلَتَعْرِفَنَّهُمْ فواقعة مع النون في جواب قسم محذوف فِي لَحْنِ الْقَوْلِ في نحوه وأسلوبه. وعن ابن عباس: هو قولهم: مالنا إن أطعنا من الثواب؟ ولا يقولون: ما علينا إن عصينا من العقاب. وقيل: اللحن: أن تلحن بكلامك، أى: تميله إلى نحو من الأنحاء ليفطن له صاحبك كالتعريض والتورية. قال:\n\nولقد لحنت لكم لكيما تفقهوا ... واللّحن يعرفه ذوو الألباب وقيل للمخطئ: لاحن، لأنه يعدل بالكلام عن الصواب.","surah_id":47,"source_id":9},{"ayah_number":31,"ayah_text":"وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَا أَخْبارَكُمْ (31)","text":"أَخْبارَكُمْ ما يحكى عنكم وما يخبر به عن أعمالكم، ليعلم حسنها من قبيحها، لأن الخبر على حسب المخبر عنه: إن حسنا فحسن، وإن قبيحا فقبيح، وقرأ يعقوب: ونبلو، بسكون الواو على معنى: ونحن نبلو أخباركم. وقرئ: وليبلونكم ويعلم، ويبلو بالياء. وعن الفضيل: أنه كان إذا قرأها بكى وقال: اللهم لا تبلنا، فإنك إن بلوتنا فضحتنا وهتكت أستارنا وعذبتنا.","surah_id":47,"source_id":9},{"ayah_number":32,"ayah_text":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ ما تَبَيَّنَ لَهُمُ الْهُدى لَنْ يَضُرُّوا اللَّهَ شَيْئاً وَسَيُحْبِطُ أَعْمالَهُمْ (32)","text":"وَسَيُحْبِطُ أَعْمالَهُمْ التي عملوها في دينهم يرجون بها الثواب، لأنها مع كفرهم برسول الله صلى الله عليه وسلم باطلة، وهم قريظة والنضير. أو سيحبط أعمالهم التي عملوها، والمكايد التي نصبوها في مشاقة الرسول، أى: سيبطلها فلا يصلون منها إلى أغراضهم، بل يستنصرون بها ولا يثمر لهم إلا القتل والجلاء عن أوطانهم. وقيل هم رؤساء قريش، والمطعمون يوم بدر.","surah_id":47,"source_id":9},{"ayah_number":33,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلا تُبْطِلُوا أَعْمالَكُمْ (33)","text":"وَلا تُبْطِلُوا أَعْمالَكُمْ أى لا تحبطوا الطاعات بالكبائر ، كقوله تعالى لا تَرْفَعُوا أَصْواتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ إلى أن قال أَنْ تَحْبَطَ أَعْمالُكُمْ وعن أبى العالية: كان أصحاب رسول الله صلى الله عليه وسلم يرون أنه لا يضر مع الإيمان ذنب، كما لا ينفع مع الشرك عمل، حتى نزلت وَلا تُبْطِلُوا أَعْمالَكُمْ فكانوا يخافون الكبائر على أعمالهم. وعن حذيفة:\n\nفخافوا أن تحبط الكبائر أعمالهم. وعن ابن عمر: كنا ترى أنه ليس شيء من حسناتنا إلا مقبولا، حتى نزل وَلا تُبْطِلُوا أَعْمالَكُمْ فقلنا: ما هذا الذي يبطل أعمالنا؟ فقلنا: الكبائر الموجبات والفواحش، حتى نزل إِنَّ اللَّهَ لا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ ما دُونَ ذلِكَ لِمَنْ يَشاءُ فكففنا عن القول في ذلك، فكنا نخاف على من أصاب الكبائر ونرجو لمن لم يصبها . وعن قتادة رحمه الله: رحم الله عبدا لم يحبط عمله الصالح بعمله السيئ. وقيل: لا تبطلوها بمعصيتهما. وعن ابن عباس رضى الله عنهما: لا تبطلوها بالرياء والسمعة، وعنه: بالشك والنفاق: وقيل:\n\nبالعجب، فإنّ العجب يأكل الحسنات كما تأكل النار الحطب. وقيل: ولا تبطلوا صدقاتكم بالمنّ والأذى.","surah_id":47,"source_id":9},{"ayah_number":34,"ayah_text":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ ثُمَّ ماتُوا وَهُمْ كُفَّارٌ فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ (34)","text":"ثُمَّ ماتُوا وَهُمْ كُفَّارٌ قيل، هم أصحاب القليب، والظاهر العموم.","surah_id":47,"source_id":9},{"ayah_number":35,"ayah_text":"فَلا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنْتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَنْ يَتِرَكُمْ أَعْمالَكُمْ (35)","text":"فَلا تَهِنُوا ولا تضعفوا ولا تذلوا للعدوّ وَلا تَدْعُوا إِلَى السَّلْمِ وقرئ: السلم وهما المسالمة وَأَنْتُمُ الْأَعْلَوْنَ أى الأغلبون الأقهرون وَاللَّهُ مَعَكُمْ أى ناصركم، وعن قتادة: لا تكونوا أوّل الطائفتين ضرعت إلى صاحبتها بالموادعة. وقرئ: ولا تدّعوا، من ادّعى القوم وتداعوا: إذا دعوا. نحو قولك: ارتموا الصيد وتراموه. وتدعوا: مجزوم لدخوله في حكم النهى. أو منصوب لإضمار إن. ونحو قوله تعالى وَأَنْتُمُ الْأَعْلَوْنَ: قوله تعالى إِنَّكَ أَنْتَ الْأَعْلى. وَلَنْ يَتِرَكُمْ من وترت الرجل إذا قتلت له قتيلا من ولد أو أخ أو حميم، أو حربته، وحقيقته: أفردته من قريبه أو ماله، من الوتر وهو الفرد فشبه إضاعة عمل العامل وتعطيل ثوابه بوتر الواتر، وهو من فصيح الكلام. ومنه قوله عليه الصلاة والسلام: «من فاتته صلاة العصر، فكأنما وتر أهله وماله» أى أفرد عنهما قتلا ونهبا.","surah_id":47,"source_id":9},{"ayah_number":36,"ayah_text":"إِنَّمَا الْحَياةُ الدُّنْيا لَعِبٌ وَلَهْوٌ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلا يَسْئَلْكُمْ أَمْوالَكُمْ (36) إِنْ يَسْئَلْكُمُوها فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغانَكُمْ (37) ها أَنْتُمْ هؤُلاءِ تُدْعَوْنَ لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ فَمِنْكُمْ مَنْ يَبْخَلُ وَمَنْ يَبْخَلْ فَإِنَّما يَبْخَلُ عَنْ نَفْسِهِ وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَراءُ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ ثُمَّ لا يَكُونُوا أَمْثالَكُمْ (38)","text":"يُؤْتِكُمْ أُجُورَكُمْ ثواب إيمانكم وتقواكم وَلا يَسْئَلْكُمْ أى ولا يسألكم جميعها، إنما يقتصر منكم على ربع العشر، ثم قال إِنْ يَسْئَلْكُمُوها فَيُحْفِكُمْ أى يجهدكم ويطلبه كله، والإحفاء:\n\nالمبالغة وبلوغ الغاية في كل شيء، يقال: أحفاه في المسألة إذا لم يترك شيئا من الإلحاح.\n\nوأحفى شاربه: إذا استأصله تَبْخَلُوا وَيُخْرِجْ أَضْغانَكُمْ أى تضطغنون على رسول الله صلى الله عليه وسلم ، وتضيق صدوركم لذلك، وأظهرتم كراهتكم ومقتكم لدين يذهب بأموالكم، والضمير في يُخْرِجْ لله عز وجل، أى يضغنكم بطلب أموالكم. أو للبخل، لأنه سبب الاضطغان.\n\nوقرئ: نخرج. بالنون. ويخرج، بالياء والتاء مع فتحهما ورفع أضغانكم هؤُلاءِ موصول بمعنى الذين صلته تُدْعَوْنَ أى أنتم الذين تدعون. أو أنتم يا مخاطبون هؤلاء الموصوفون، ثم استأنف وصفهم، كأنهم قالوا: وما وصفنا؟ فقيل: تدعون لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ قيل:\n\nهي النفقة في الغزو. وقيل: الزكاة، كأنه قيل: الدليل على أنه لو أحفاكم لبخلتم وكرهتم العطاء واضطغنتم أنكم تدعون إلى أداء ربع العشر، فمنكم ناس يبخلون به، ثم قال وَمَنْ يَبْخَلْ بالصدقة وأداء الفريضة. فلا يتعداه ضرر بخله، وإنما يَبْخَلُ عَنْ نَفْسِهِ يقال بخلت عليه وعنه، وكذلك ضننت عليه وعنه. ثم أخبر أنه لا يأمر بذلك ولا يدعو اليه لحاجته إليه، فهو الغنى الذي تستحيل عليه الحاجات، ولكن لحاجتكم وفقركم إلى الثواب وَإِنْ تَتَوَلَّوْا معطوف على:\n\nوإن تؤمنوا وتتقوا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ يخفق قوما سواكم على خلاف صفتكم راغبين في الإيمان والتقوى، غير متولين عنهما، كقوله تعالى وَيَأْتِ بِخَلْقٍ جَدِيدٍ وقيل: هم الملائكة.\n\nوقيل: الأنصار. وعن ابن عباس: كندة والنخع. وعن الحسن: العجم وعن عكرمة: فارس والروم. وسئل رسول الله صلى الله عليه وسلم عن القوم وكان سلمان إلى جنبه، فضرب على فخذه وقال: «هذا وقومه، والذي نفسي بيده، لو كان الإيمان منوطا بالثريا لتناوله رجال من فارس» وعن رسول الله صلى الله عليه وسلم «من قرأ سورة محمد صلى الله عليه وسلم كان حقا على الله أن يسقيه من أنهار الجنة»","surah_id":47,"source_id":9}]