[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، وآياتها 9 [نزلت بعد القيامة] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":104,"source_id":9},{"ayah_number":1,"ayah_text":"وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ (1) الَّذِي جَمَعَ مالاً وَعَدَّدَهُ (2) يَحْسَبُ أَنَّ مالَهُ أَخْلَدَهُ (3) كَلاَّ لَيُنْبَذَنَّ فِي الْحُطَمَةِ (4) وَما أَدْراكَ مَا الْحُطَمَةُ (5) نارُ اللَّهِ الْمُوقَدَةُ (6) الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ (7) إِنَّها عَلَيْهِمْ مُؤْصَدَةٌ (8) فِي عَمَدٍ مُمَدَّدَةٍ (9)","text":"الهمز: الكسر، كالهزم. واللمز: الطعن. يقال: لمزه ولهزه طعنه، والمراد: الكسر من أعراض الناس والغض منهم، واغتيابهم، والطعن فيهم وبناء «فعلة» يدل على أنّ ذلك عادة منه قد ضرى بها. ونحوهما: اللعنة والضحكة. قال:\n\nوإن أغيّب فأنت الهامز اللّمزه\n\nوقرئ: ويل للهمزة اللمزة. وقرئ: ويل لكل همزة لمزة، بسكون الميم: وهو المسخرة الذي يأتى بالأوابد والأضاحيك فيضحك منه ويشتم. وقيل: نزلت في الأخنس بن شريق وكانت عادته الغيبة والوقيعة. وقيل: في أمية بن خلف. وقيل: في الوليد بن المغيرة واغتيابه لرسول الله صلى الله عليه وسلم وغضه منه. ويجوز أن يكون السبب خاصا والوعيد عاما، ليتناول كل من باشر ذلك القبيح، وليكون جاريا مجرى التعريض بالوارد فيه، فإنّ ذلك أزجر له وأنكى فيه الَّذِي بدل من كل. أو نصب على الذم. وقرئ: جمع بالتشديد، وهو مطابق لعدده. وقيل عَدَّدَهُ جعله عدة لحوادث الدهر. وقرئ: وعدده أى جمع المال وضبط عدده وأحصاه. أو جمع ماله وقومه الذين ينصرونه، من قولك: فلان ذو عدد وعدد: إذا كان له عدد وافر من الأنصار وما يصلحهم. وقيل وَعَدَّدَهُ معناه: وعدّه على فك الإدغام، نحو: ضننوا أَخْلَدَهُ وخلده بمعنى، أى طوّل المال أمله، ومناه الأمانى البعيدة، حتى أصبح لفرط غفلته وطول أمله يحسب أنّ المال تركه خالدا في الدنيا لا يموت. أو يعمل من تشييد البنيان الموثق بالصخر والآجر وغرس الأشجار وعمارة الأرض: عمل من يظن أن ماله أبقاه حيا. أو هو تعريض بالعمل الصالح. وأنه هو الذي أخلد صاحبه في النعيم، فأما المال فما أخلد أحدا فيه. وروى أنه كان للأخنس أربعة آلاف دينار. وقيل: عشرة آلاف. وعن الحسن: أنه عاد موسرا\n\n فقال: ما تقول في ألوف لم أفتد بها من لئيم، ولا تفضلت على كريم؟ قال: ولكن لماذا؟\n\nقال: لنبوة الزمان، وجفوة السلطان، ونوائب الدهر، ومخافة الفقر. قال: إذن تدعه لمن لا يحمدك، وترد على من لا يعذرك كَلَّا ردع له عن حسبانه. وقرئ: لينبذان، أى: هو وماله. ولينبذن، بضم الذال، أى: هو وأنصاره. ولينبذنه فِي الْحُطَمَةِ في النار التي من شأنها أن تحطم كل ما يلقى فيها. ويقال للرجل الأكول: إنه الحطمة. وقرئ: الحاطمة، يعنى أنها تدخل في أجوافهم حتى تصل إلى صدورهم وتطلع على أفئدتهم، وهي أوساط القلوب، ولا شيء في بدن الإنسان ألطف من الفؤاد، ولا أشد تألما منه بأدنى أذى يمسه، فكيف إذا اطلعت عليه نار جهنم واستولت عليه. ويجوز أن يخص الأفئدة لأنها مواطن الكفر والعقائد الفاسدة والنيات الخبيثة. ومعنى اطلاع النار عليها: أنها تعلوها وتغلبها وتشتمل عليها. أو تطالع على سبيل المجاز معادن موجبها مُؤْصَدَةٌ مطبقا. قال:\n\nتحنّ إلى أجبال مكّة ناقتي ... ومن دونها أبواب صنعاء مؤصدة\n\nوقرئ: في عمد، بضمتين. وعمد، بسكون الميم. وعمد. بفتحتين. والمعنى: أنه يؤكد يأسهم من الخروج وتيقنهم بحبس الأبد، فتؤصد عليهم الأبواب وتمدد على الأبواب العمد، استيثاقا في استيثاق. ويجوز أن يكون المعنى: أنها عليهم مؤصدة، موثقين في عمد ممدّدة مثل المقاطر التي تقطر فيها اللصوص. اللهم أجرنا من النار يا خير مستجار.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة الهمزة أعطاه الله عشر حسنات بعدد من استهزا بمحمد وأصحابه».","surah_id":104,"source_id":9}]