[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، وهي ثلاثون آية [نزلت بعد الطور] وتسمى: الواقية، والمنجية، لأنها تقى وتنجي قارئها من عذاب القبر بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":67,"source_id":9},{"ayah_number":1,"ayah_text":"تَبارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلى كُلِّ شَيْءٍ قَدِيرٌ (1) الَّذِي خَلَقَ الْمَوْتَ وَالْحَياةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلاً وَهُوَ الْعَزِيزُ الْغَفُورُ (2) الَّذِي خَلَقَ سَبْعَ سَماواتٍ طِباقاً ما تَرى فِي خَلْقِ الرَّحْمنِ مِنْ تَفاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرى مِنْ فُطُورٍ (3) ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خاسِئاً وَهُوَ حَسِيرٌ (4)","text":"تَبارَكَ تعالى وتعاظم عن صفات المخلوقين الَّذِي بِيَدِهِ الْمُلْكُ على كل موجود وَهُوَ عَلى كُلِّ ما لم يوجد مما يدخل تحت القدرة قَدِيرٌ وذكر اليد مجاز عن الإحاطة بالملك والاستيلاء عليه. والحياة: ما يصح بوجوده الإحساس. وقيل: ما يوجب كون الشيء حيا، وهو الذي يصح منه أن يعلم ويقدر. والموت عدم ذلك فيه، ومعنى خلق الموت والحياة: إيجاد ذلك المصحح وإعدامه. والمعنى: خلق موتكم وحياتكم أيها المكلفون لِيَبْلُوَكُمْ وسمى علم الواقع منهم باختيارهم «بلوى» وهي الخبرة استعارة من فعل المختبر. ونحوه قوله تعالى وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ. فإن قلت: من أين تعلق قوله أَيُّكُمْ أَحْسَنُ عَمَلًا بفعل البلوى ؟ قلت: من حيث أنه تضمن معنى العلم، فكأنه قيل: ليعلمكم أيكم أحسن عملا، وإذا قلت: علمته أزيد أحسن عملا أم هو؟ كانت هذه الجملة واقعة موقع الثاني من مفعوليه، كما تقول:\n\nعلمته هو أحسن عملا. فإن قلت: أتسمى هذا تعليقا؟ قلت: لا، إنما التعليق أن توقع بعده ما يسدّ مسدّ المفعولين جميعا، كقولك: علمت أيهما عمرو، وعلمت أزيد منطلق. ألا ترى أنه لا فصل بعد سبق أحد المفعولين بين أن يقع ما بعده مصدرا بحرف الاستفهام وغير مصدر به، ولو كان تعليقا لا فترقت الحالتان كما افترقتا في قولك: علمت أزيد منطلق. وعلمت زيدا منطلقا. أَحْسَنُ عَمَلًا. قيل: أخلصه وأصوبه، لأنه إذا كان خالصا غير صواب لم يقبل، وكذلك إذا كان صوابا غير خالص، فالخالص: أن يكون لوجه الله تعالى، والصواب: أن يكون على السنة. وعن النبي صلى الله عليه وسلم أنه تلاها، فلما بلغ قوله أَيُّكُمْ أَحْسَنُ عَمَلًا قال: «أيكم أحسن عقلا وأورع عن محارم الله وأسرع في طاعة الله» يعنى: أيكم أتم عقلا عن الله وفهما لأغراضه، والمراد: أنه أعطاكم الحياة التي تقدرون بها على العمل وتستمكنون منه، وسلط عليكم الموت الذي هو داعيكم إلى اختيار العمل الحسن على القبيح، لأن وراءه البعث والجزاء الذي لا بد منه. وقدم الموت على الحياة، لأنّ أقوى الناس داعيا إلى العمل من نصب موته بين عينيه فقدم لأنه فيما يرجع إلى الغرض المسوق له الآية أهم وَهُوَ الْعَزِيزُ الغالب الذي لا يعجزه من أساء العمل الْغَفُورُ لمن تاب من أهل الإساءة طِباقاً مطابقة بعضها فوق بعض، من طابق النعل: إذا خصفها طبقا على طبق، وهذا وصف بالمصدر. أو على ذات طباق، أو على: طوبقت طباقا مِنْ تَفاوُتٍ وقرئ: من تفوت. ومعنى البناءين واحد، كقولهم:\n\nتظاهروا من نسائهم. وتظهروا. وتعاهدته وتعهدته، أى: من اختلاف واضطراب في الخلقة ولا تناقض، إنما هي مستوية مستقيمة. وحقيقة التفاوت: عدم التناسب، كأن بعض الشيء يفوت بعضا ولا يلائمه. ومنه قولهم: خلق متفاوت. وفي نقيضه: متناصف. فإن قلت:\n\nكيف موقع هذه الجملة مما قبلها؟ قلت: هي صفة مشايعة لقوله طِباقاً وأصلها: ما ترى فيهنّ من تفاوت، فوضع مكان الضمير قوله خَلْقِ الرَّحْمنِ تعظيما لخلقهنّ، وتنبيها على سبب سلامتهنّ من التفاوت: وهو أنه خلق الرحمن، وأنه بباهر قدرته هو الذي يخلق مثل ذلك الخلق المتناسب، والخطاب في ما ترى للرسول أو لكل مخاطب. وقوله تعالى فَارْجِعِ الْبَصَرَ متعلق به على معنى التسبيب، أخبره بأنه لا تفاوت في خلقهنّ، ثم قال فَارْجِعِ الْبَصَرَ حتى يصح عندك ما أخبرت به بالمعاينة، ولا تبقى معك شبهة فيه هَلْ تَرى مِنْ فُطُورٍ من صدوع وشقوق: جمع فطر وهو الشق. يقال: فطره فانفطر. ومنه: فطر ناب البعير، كما يقال: شق وبزل. ومعناه:\n\nشق اللحم فطلع. وأمره بتكرير البصر فيهنّ متصفحا ومتتبعا يلتمس عيبا وخللا يَنْقَلِبْ إِلَيْكَ أى إن رجعت البصر وكررت النظر لم يرجع إليك بصرك بما التمسته من رؤية الخلل وإدراك العيب، بل يرجع إليك بالخسوء والحسور، أى: بالبعد عن إصابة الملتمس. كأنه يطرد عن ذلك طردا بالصغار والقماءة . وبالإعياء والكلال لطول الإجالة والبرديد. فإن قلت: كيف ينقلب البصر خاسئا حسيرا برجعه كرّتين اثنتين؟ قلت: معنى التثنية التكرير بكثرة ، كقولك:\n\nلبيك وسعديك، تريد إجابات كثيرة بعضها في أثر بعض، وقولهم في المثل: دهدرّين سعد القين من ذلك. أى: باطلا بعد باطل. فإن قلت: فما معنى ثم ارجع؟ قلت: أمره يرجع البصر، ثم أمره بأن لا يقتنع بالرجعة الأولى وبالنظرة الحمقاء، وأن يتوقف بعدها ويجم بصره، ثم يعاود ويعاود، إلى أن يحسر بصره من طول المعاودة، فإنه لا يعثر على شيء من فطور.","surah_id":67,"source_id":9},{"ayah_number":5,"ayah_text":"وَلَقَدْ زَيَّنَّا السَّماءَ الدُّنْيا بِمَصابِيحَ وَجَعَلْناها رُجُوماً لِلشَّياطِينِ وَأَعْتَدْنا لَهُمْ عَذابَ السَّعِيرِ (5)","text":"الدُّنْيا القربى، لأنها أقرب السماوات إلى الناس، ومعناها: السماء الدنيا منكم. والمصابيح السرج، سميت بها الكواكب، والناس يزينون مساجدهم ودورهم بأثقاب المصابيح ، فقيل:\n\nولقد زينا سقف الدار التي اجتمعتم فيها بِمَصابِيحَ أى بأى مصابيح لا توازيها مصابيحكم إضاءة، وضممنا إلى ذلك منافع أخر: أنا جَعَلْناها رُجُوماً أعدائكم: لِلشَّياطِينِ الذين يخرجونكم من النور إلى الظلمات وتهتدون بها في ظلمات البر والبحر. قال قتادة: خلق الله النجوم لثلاث:\n\nزينة للسماء، ورجوما للشياطين، وعلامات يهتدى بها. فمن تأوّل فيها غير ذلك فقد تكلف ما لا علم له به وعن محمد بن كعب: في السماء والله ما لأحد من أهل الأرض في السماء نجم، ولكنهم يبتغون الكهانة ويتخذون النجوم علة. والرجوم: جمع رجم: وهو مصدر سمى به ما يرجم به.\n\nومعنى كونها مراجم للشياطين: أنّ الشهب التي تنقض لرمي المسترقة منهم منفصلة من نار الكواكب، لا أنهم يرجمون بالكواكب أنفسها، لأنها قارة في الفلك على حالها. وما ذاك إلا كقبس يؤخذ من نار، والنار ثابتة كاملة لا تنقص. وقيل: من الشياطين المرجومة من يقتله الشهاب. ومنهم من يخبله. وقيل: معناه وجعلناها ظنونا ورجوما بالغيب لشياطين الإنس وهم النجامون وَأَعْتَدْنا لَهُمْ عَذابَ السَّعِيرِ في الآخرة بعد عذاب الإحراق بالشهب في الدنيا.","surah_id":67,"source_id":9},{"ayah_number":6,"ayah_text":"وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ عَذابُ جَهَنَّمَ وَبِئْسَ الْمَصِيرُ (6) إِذا أُلْقُوا فِيها سَمِعُوا لَها شَهِيقاً وَهِيَ تَفُورُ (7) تَكادُ تَمَيَّزُ مِنَ الْغَيْظِ كُلَّما أُلْقِيَ فِيها فَوْجٌ سَأَلَهُمْ خَزَنَتُها أَلَمْ يَأْتِكُمْ نَذِيرٌ (8) قالُوا بَلى قَدْ جاءَنا نَذِيرٌ فَكَذَّبْنا وَقُلْنا ما نَزَّلَ اللَّهُ مِنْ شَيْءٍ إِنْ أَنْتُمْ إِلاَّ فِي ضَلالٍ كَبِيرٍ (9) وَقالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ ما كُنَّا فِي أَصْحابِ السَّعِيرِ (10) فَاعْتَرَفُوا بِذَنْبِهِمْ فَسُحْقاً لِأَصْحابِ السَّعِيرِ (11) إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ (12)","text":"وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ أى: ولكل من كفر بالله من الشياطين وغيرهم عَذابُ جَهَنَّمَ ليس الشياطين المرجومين مخصوصين بذلك. وقرئ عذاب جهنم بالنصب عطفا على عذاب السعير إِذا أُلْقُوا فِيها أى طرحوا كما يطرح الحطب في النار العظيمة، ويرمى به. ومثله قوله تعالى حَصَبُ جَهَنَّمَ. سَمِعُوا لَها شَهِيقاً إمّا لأهلها ممن تقدم طرحهم فيها. أو من أنفسهم، كقوله لَهُمْ فِيها زَفِيرٌ وَشَهِيقٌ وإما للنار تشبيها لحسيسها» المنكر الفظيع بالشهيق وَهِيَ تَفُورُ تغلى بهم غليان المرجل بما فيه. وجعلت كالمغتاظة عليهم لشدة غليانها بهم، ويقولون: فلان يتميز غيظا ويتقصف غضبا، وغضب فطارت منه شقة في الأرض وشقة في السماء: إذا وصفوه بالإفراط فيه. ويجوز أن يراد: غيظ الزبانية أَلَمْ يَأْتِكُمْ نَذِيرٌ توبيخ يزدادون به عذابا إلى عذابهم وحسرة إلى حسرتهم. وخزنتها: مالك وأعوانه من الزبانية قالُوا بَلى اعتراف منهم بعدل الله، وإقرار بأن الله عز وعلا أزاح عللهم ببعثة الرسل وإنذارهم ما وقعوا فيه، وأنهم لم يؤتوا من قدره كما تزعم المجبرة ، وإنما أتوا من قبل أنفسهم، واختيارهم خلاف ما اختار الله وأمر به وأوعد على ضده. فإن قلت: إِنْ أَنْتُمْ إِلَّا فِي ضَلالٍ كَبِيرٍ من المخاطبون به؟ قلت: هو من جملة قول الكفار وخطابهم للمنذرين، على أنّ النذير بمعنى الإنذار. والمعنى: ألم يأتكم أهل نذير. أو وصف منذروهم لغلوهم في الإنذار، كأنهم ليسوا إلا إنذارا، وكذلك قَدْ جاءَنا نَذِيرٌ ونظيره قوله تعالى نَّا رَسُولُ رَبِّ الْعالَمِينَ أى حاملا رسالته. ويجوز أن يكون من كلام الخزنة للكفار على إرادة القول: أرادوا حكاية ما كانوا عليه من ضلالهم في الدنيا. أو أرادوا بالضلال: الهلاك. أو سموا عقاب الضلال باسمه. أو من كلام الرسل لهم حكوه للخزنة، أى قالوا لنا هذا فلم نقبله لَوْ كُنَّا نَسْمَعُ الإنذار سماع طالبين للحق . أو نعقله عقل متأمّلين. وقيل: إنما جمع بين السمع والعقل، لأنّ مدار التكليف على أدلة السمع والعقل. ومن بدع التفاسير: أنّ المراد لو كنا على مذهب أصحاب الحديث أو على مذهب أصحاب الرأى، كأنّ هذه الآية نزلت بعد ظهور هذين المذهبين، وكأن سائر أصحاب المذاهب والمجتهدين قد أنزل الله وعيدهم، وكأن من كان من هؤلاء فهو من من الناجين لا محالة، وعدّة المبشرين من الصحابة: عشرة، لم يضم إليهم حادي عشر، وكأن من يجوز على الصراط أكثرهم لم يسمعوا باسم هذين الفريقين بِذَنْبِهِمْ بكفرهم في تكذيبهم الرسل فَسُحْقاً قرئ بالتخفيف والتثقيل، أى: فبعدا لهم، اعترفوا أو جحدوا، فإنّ ذلك لا ينفعهم.","surah_id":67,"source_id":9},{"ayah_number":13,"ayah_text":"وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ إِنَّهُ عَلِيمٌ بِذاتِ الصُّدُورِ (13) أَلا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ (14)","text":"ظاهره الأمر بأحد الأمرين: الإسرار والإجهار. ومعناه: ليستو عندكم إسراركم وإجهاركم في علم الله بهما، ثم أنه علله ب إِنَّهُ عَلِيمٌ بِذاتِ الصُّدُورِ أى بضمائرها قبل أن تترجم الألسنة عنها، فكيف لا يعلم ما تكلم به. ثم أنكر أن لا يحيط علما بالمضمر والمسر والمجهر مَنْ خَلَقَ الأشياء ، وحاله أنه اللطيف الخبير، المتوصل علمه إلى ما ظهر من خلقه وما بطن. ويجوز أن يكون مَنْ خَلَقَ منصوبا بمعنى: ألا يعلم مخلوقه وهذه حاله. وروى أنّ المشركين كانوا يتكلمون فيما بينهم بأشياء، فيظهر الله رسوله عليها، فيقولون: أسروا قولكم لئلا يسمعه إله محمد، فنبه الله على جهلهم. فإن قلت: قدرت في أَلا يَعْلَمُ مفعولا على معنى:\n\nألا يعلم ذلك المذكور مما أضمر في القلب وأظهر باللسان من خلق، فهلا جعلته مثل قولهم: هو يعطى ويمنع، وهلا كان المعنى: ألا يكون عالما من هو خالق، لأنّ الخلق لا يصح إلا مع العلم؟\n\nقلت: أبت ذلك الحال التي هي قوله وَهُوَ اللَّطِيفُ الْخَبِيرُ لأنك لو قلت: ألا يكون عالما من هو خالق وهو اللطيف الخبير: لم يكن معنى صحيحا، لأنّ ألا يعلم معتمد على الحال.\n\nوالشيء لا يوقت بنفسه، فلا يقال: ألا يعلم وهو عالم، ولكن ألا يعلم كذا وهو عالم بكل شيء.","surah_id":67,"source_id":9},{"ayah_number":15,"ayah_text":"هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولاً فَامْشُوا فِي مَناكِبِها وَكُلُوا مِنْ رِزْقِهِ وَإِلَيْهِ النُّشُورُ (15)","text":"المشي في مناكبها: مثل لفرط التذليل ومجاوزته الغاية، لأنّ المنكبين وملتقاهما من الغارب أرق شيء من البعير وأنباه عن أن يطأه الراكب بقدمه ويعتمد عليه، فإذا جعلها في الذل بحيث يمشى في مناكبها لم يترك . وقيل: مناكبها جبالها. قال الزجاج: معناه سهل لكم السلوك في جبالها، فإذا أمكنكم السلوك في جبالها، فهو أبلغ التذليل. وقيل جوانبها. والمعنى: وإليه نشوركم، فهو مسائلكم عن شكر ما أنعم به عليكم.","surah_id":67,"source_id":9},{"ayah_number":16,"ayah_text":"أَأَمِنْتُمْ مَنْ فِي السَّماءِ أَنْ يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذا هِيَ تَمُورُ (16) أَمْ أَمِنْتُمْ مَنْ فِي السَّماءِ أَنْ يُرْسِلَ عَلَيْكُمْ حاصِباً فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ (17) وَلَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَكَيْفَ كانَ نَكِيرِ (18) أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صافَّاتٍ وَيَقْبِضْنَ ما يُمْسِكُهُنَّ إِلاَّ الرَّحْمنُ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ (19)","text":"مَنْ فِي السَّماءِ فيه وجهان: أحدهما من ملكوته في السماء، لأنها مسكن ملائكته وثم عرشه وكرسيه واللوح المحفوظ، ومنها تنزل قضاياه وكتبه وأوامره ونواهيه. والثاني: أنهم كانوا يعتقدون التشبيه، وأنه في السماء، وأنّ الرحمة والعذاب ينزلان منه، وكانوا يدعونه من جهتها، فقيل لهم على حسب اعتقادهم: أأمنتم من تزعمون أنه في السماء، وهو متعال عن المكان أن يعذبكم بخسف أو بحاصب، كما تقول لبعض المشبهة: أما تخاف من فوق العرش أن يعاقبك بما تفعل، إذا رأيته يركب بعض المعاصي فَسَتَعْلَمُونَ قرئ بالتاء والياء كَيْفَ نَذِيرِ أى إذا رأيتم المنذر به علمتم كيف إنذارى حين لا ينفعكم العلم صافَّاتٍ باسطات أجنحتهن في الجوّ عند طيرانها، لأنهن إذا بسطنها صففن قوادمها صفا وَيَقْبِضْنَ ويضممنها إذا ضربن بها جنوبهن. فإن قلت: لم قيل: ويقبضن، ولم يقل: وقابضات؟ قلت: لأن الأصل في الطيران هو صف الأجنحة، لأنّ الطيران في الهواء كالسباحة في الماء، والأصل في السباحة مدّ الأطراف وبسطها. وأما القبض فطارئ على البسط للاستظهار به على التحرك، فجيء بما هو طار غير أصل بلفظ الفعل، على معنى أنهن صافات، ويكون منهن القبض تارة كما يكون من السابح ما يُمْسِكُهُنَّ إِلَّا الرَّحْمنُ بقدرته وبما دبر لهن من القوادم والخوافي ، وبنى الأجسام على شكل وخصائص قد تأتى منها الجري في الجو إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ يعلم كيف يخلق وكيف يدبر العجائب.","surah_id":67,"source_id":9},{"ayah_number":20,"ayah_text":"أَمَّنْ هذَا الَّذِي هُوَ جُنْدٌ لَكُمْ يَنْصُرُكُمْ مِنْ دُونِ الرَّحْمنِ إِنِ الْكافِرُونَ إِلاَّ فِي غُرُورٍ (20) أَمَّنْ هذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ بَلْ لَجُّوا فِي عُتُوٍّ وَنُفُورٍ (21)","text":"أَمَّنْ يشار إليه من الجموع ويقال هذَا الَّذِي هُوَ جُنْدٌ لَكُمْ يَنْصُرُكُمْ مِنْ دُونِ الله إن أرسل عليكم عذابه أَمَّنْ يشار إليه ويقال هذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ وهذا على التقدير. ويجوز أن يكون إشارة إلى جميع الأوثان لاعتقادهم أنهم يحفظون من النوائب ويرزقون ببركة آلهتهم، فكأنهم الجند الناصر والرازق. ونحوه قوله تعالى أَمْ لَهُمْ آلِهَةٌ تَمْنَعُهُمْ مِنْ دُونِنا. بَلْ لَجُّوا فِي عُتُوٍّ وَنُفُورٍ بل تمادوا في عناد وشراد عن الحق لثقله عليهم فلم يتبعوه.","surah_id":67,"source_id":9},{"ayah_number":22,"ayah_text":"أَفَمَنْ يَمْشِي مُكِبًّا عَلى وَجْهِهِ أَهْدى أَمَّنْ يَمْشِي سَوِيًّا عَلى صِراطٍ مُسْتَقِيمٍ (22) قُلْ هُوَ الَّذِي أَنْشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصارَ وَالْأَفْئِدَةَ قَلِيلاً ما تَشْكُرُونَ (23) قُلْ هُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ (24)","text":"يجعل «أكب» مطاوع «كبه» يقال: كببته فأكب، من الغرائب والشواذ. ونحوه:\n\nقشعت الريح السحاب فأقشع، وما هو كذلك، ولا شيء من بناء أفعل مطاوعا، ولا يتقن نحو هذا إلا حملة كتاب سيبويه، وإنما «أكب» من باب «انفض، وألأم» ومعناه: دخل في الكب، وصار ذاكب، وكذلك أقشع السحاب: دخل في القشع. ومطاوع كب وقشع:\n\nانكب وانقشع. فإن قلت: ما معنى يَمْشِي مُكِبًّا عَلى وَجْهِهِ؟ وكيف قابل يَمْشِي سَوِيًّا عَلى صِراطٍ مُسْتَقِيمٍ؟ قلت: معناه: يمشى معتسفا في مكان معتاد غير مستوفيه انخفاض وارتفاع، فيعثر كل ساعة فيخر على وجهه منكبا، فحاله نقيض حال من يمشى سويا، أى:\n\nقائما سالما من العثور والخرور. أو مستوى الجهة قليل الانحراف خلاف المعتسف الذي ينحرف هكذا وهكذا على طريق مستو. ويجوز أن يراد الأعمى الذي لا يهتدى إلى الطريق فيعتسف، فلا يزال ينكب على وجهه، وأنه ليس كالرجل السوي الصحيح البصر الماشي في الطريق المهتدى له، وهو مثل للمؤمن والكافر. وعن قتادة: الكافر أكب على معاصى الله تعالى فحشره الله يوم القيامة على وجهه. وعن الكلبي: عنى به أبو جهل بن هشام. وبالسوىّ: رسول الله صلى الله تعالى عليه وسلم، وقيل: حمزة بن عبد المطلب.\n","surah_id":67,"source_id":9},{"ayah_number":25,"ayah_text":"وَيَقُولُونَ مَتى هذَا الْوَعْدُ إِنْ كُنْتُمْ صادِقِينَ (25) قُلْ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَإِنَّما أَنَا نَذِيرٌ مُبِينٌ (26) فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَقِيلَ هذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ (27)","text":"فَلَمَّا رَأَوْهُ الضمير للوعد. والزلفة: القرب، وانتصابها على الحال أو الظرف، أى:\n\nرأوه ذا زلفة أو مكانا ذا زلفة سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا أى ساءت رؤية الوعد وجوههم:\n\nبأن عليها الكآبة وغشيها الكسوف والقترة، وكلحوا، وكما يكون وجه من يقاد إلى القتل أو يعرض على بعض العذاب وَقِيلَ القائلون: الزبانية تَدَّعُونَ تفتعلون من الدعاء، أى: تطلبون وتستعجلون به. وقيل: هو من الدعوى، أى: كنتم بسببه تدعون أنكم لا تبعثون.\n\nوقرئ: تدعون. وعن بعض الزهاد: أنه تلاها في أول الليل في صلاته، فبقى يكررها وهو يبكى إلى أن نودي لصلاة الفجر، ولعمري إنها لوقاذة لمن تصور تلك الحالة وتأملها.","surah_id":67,"source_id":9},{"ayah_number":28,"ayah_text":"قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَنْ مَعِيَ أَوْ رَحِمَنا فَمَنْ يُجِيرُ الْكافِرِينَ مِنْ عَذابٍ أَلِيمٍ (28)","text":"كان كفار مكة يدعون على رسول الله صلى الله عليه وسلم وعلى المؤمنين بالهلاك، فأمر بأن يقول لهم: نحن مؤمنون متربصون لإحدى الحسنيين: إما أن نهلك كما تتمنون فننقلب إلى الجنة، أو نرحم بالنصرة والإدالة للإسلام كما نرجو، فأنتم ما تصنعون؟ من يجيركم- وأنتم كافرون- من عذاب النار؟ لا بدّ لكم منه، يعنى: إنكم تطلبون لنا الهلاك الذي هو استعجال للفوز والسعادة، وأنتم في أمر هو الهلاك الذي لإهلاك بعده، وأنتم غافلون لا تطلبون الخلاص منه. أو إن أهلكنا الله بالموت فمن يجيركم بعد موت هداتكم، والآخذين بحجزكم من النار، وإن رحمنا بالإمهال والغلبة عليكم وقتلكم فمن يجيركم، فإنّ المقتول على أيدينا هالك. أو إن أهلكنا الله في الآخرة بذنوبنا ونحن مسلمون، فمن يجير الكافرين وهم أولى بالهلاك لكفرهم، وإن رحمنا بالإيمان فمن يجير من لا إيمان له.","surah_id":67,"source_id":9},{"ayah_number":29,"ayah_text":"قُلْ هُوَ الرَّحْمنُ آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنا فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلالٍ مُبِينٍ (29)","text":"فإن قلت: لم أخر مفعول آمنا وقدم مفعول توكلنا؟ قلت: لوقوع آمنا تعريضا بالكافرين حين ورد عقيب ذكرهم، كأنه قيل: آمنا ولم نكفر كما كفرتم، ثم قال: وعليه توكلنا خصوصا لم نتكل على ما أنتم متكلون عليه من رجالكم وأموالكم.","surah_id":67,"source_id":9},{"ayah_number":30,"ayah_text":"قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ ماؤُكُمْ غَوْراً فَمَنْ يَأْتِيكُمْ بِماءٍ مَعِينٍ (30)","text":"غَوْراً غائرا ذاهبا في الأرض. وعن الكلبي لا تناله الدلاء، وهو وصف بالمصدر كعدل ورضا. وعن بعض الشطار أنها تليت عنده فقال: تجيء به الفئوس والمعاول، فذهب ماء عينيه، نعوذ بالله من الجرأة على الله وعلى آياته.\n\nعن رسول الله صلى الله عليه وسلم «من قرأ سورة الملك فكأنما أحيا ليلة القدر» .","surah_id":67,"source_id":9}]