[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، وآياتها 44 [نزلت بعد الحاقة] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":70,"source_id":9},{"ayah_number":1,"ayah_text":"سَأَلَ سائِلٌ بِعَذابٍ واقِعٍ (1) لِلْكافِرينَ لَيْسَ لَهُ دافِعٌ (2) مِنَ اللَّهِ ذِي الْمَعارِجِ (3) تَعْرُجُ الْمَلائِكَةُ وَالرُّوحُ إِلَيْهِ فِي يَوْمٍ كانَ مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ (4) فَاصْبِرْ صَبْراً جَمِيلاً (5) إِنَّهُمْ يَرَوْنَهُ بَعِيداً (6) وَنَراهُ قَرِيباً (7) يَوْمَ تَكُونُ السَّماءُ كَالْمُهْلِ (8) وَتَكُونُ الْجِبالُ كَالْعِهْنِ (9) وَلا يَسْئَلُ حَمِيمٌ حَمِيماً (10) يُبَصَّرُونَهُمْ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِي مِنْ عَذابِ يَوْمِئِذٍ بِبَنِيهِ (11) وَصاحِبَتِهِ وَأَخِيهِ (12) وَفَصِيلَتِهِ الَّتِي تُؤْوِيهِ (13) وَمَنْ فِي الْأَرْضِ جَمِيعاً ثُمَّ يُنْجِيهِ (14) كَلاَّ إِنَّها لَظى (15) نَزَّاعَةً لِلشَّوى (16) تَدْعُوا مَنْ أَدْبَرَ وَتَوَلَّى (17) وَجَمَعَ فَأَوْعى (18)","text":"ضمن سَأَلَ معنى دعا، فعدّى تعديته، كأنه قيل: دعا داع بِعَذابٍ واقِعٍ من قولك:\n\nدعا بكذا. إذا استدعى وطلبه. ومنه قوله تعالى يَدْعُونَ فِيها بِكُلِّ فاكِهَةٍ وعن ابن عباس رضى الله عنهما: هو النضر بن الحرث: قال إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم. وقيل: هو رسول الله صلى الله عليه وسلم، استعجل بعذاب للكافرين. وقرئ. سال سائل، وهو على وجهين: إما أن يكون من السؤال وهي لغة قريش، يقولون: سلت تسأل، وهما يتسايلان، وأن يكون من السيلان. ويؤيده قراءة ابن عباس: سال سيل، والسيل: مصدر في معنى السائل، كالغور بمعنى الغائر. والمعنى: اندفع عليهم وادى عذاب فذهب بهم وأهلكهم. وعن قتادة: سأل سائل عن عذاب الله على من ينزل وبمن يقع؟ فنزلت، وسأل على هذا الوجه مضمن معنى: عنى واهتم. فإن قلت: بم يتصل قوله لِلْكافِرينَ؟ قلت: هو على القول الأوّل متصل بعذاب صفة له، أى: بعذاب واقع كائن للكافرين، أو بالفعل، أى: دعا للكافرين بعذاب واقع. أو بواقع، أى: بعذاب نازل لأجلهم، وعلى الثاني: هو كلام مبتدأ جواب للسائل، أى: هو للكافرين. فإن قلت:\n\nفقوله مِنَ اللَّهِ بم يتصل؟ قلت: يتصل بواقع، أى واقع من عنده، أو بدافع، بمعنى:\n\nليس له دافع من جهته إذا جاء وقته وأوجبت الحكمة وقوعه ذِي الْمَعارِجِ ذى المصاعد جمع معرج، ثم وصف المصاعد وبعد مداها في العلو والارتفاع فقال: تَعْرُجُ الْمَلائِكَةُ وَالرُّوحُ إِلَيْهِ إلى عرشه وحيث تهبط منه أوامره فِي يَوْمٍ كانَ مِقْدارُهُ كمقدار مدة خَمْسِينَ أَلْفَ سَنَةٍ مما يعد الناس. والروح. جبريل عليه السلام، أفرده لتميزه بفضله. وقيل: الروح خلق هم حفظة على الملائكة، كما أنّ الملائكة حفظة على الناس. فإن قلت. بم يتعلق قوله فَاصْبِرْ؟ قلت: بسأل سائل، لأنّ استعجال النصر بالعذاب إنما كان على وجه الاستهزاء برسول الله صلى الله عليه وسلم والتكذيب بالوحي، وكان ذلك مما يضجر رسول الله صلى الله عليه وسلم، فأمر بالصبر عليه، وكذلك من سأل عن العذاب لمن هو، فإنما سأل على طريق التعنت، وكان من كفار مكة. ومن قرأ: سال سائل، أو سيل، فمعناه: جاء العذاب لقرب وقوعه، فاصبر فقد شارفت الانتقام، وقد جعل فِي يَوْمٍ من صلة واقِعٍ أى: يقع في يوم طويل مقداره خمسون ألف سنة من سنيكم، وهو يوم القيامة: إما أن يكون استطالة له لشدّته على الكفار، وإما لأنه على الحقيقة كذلك. قيل: فيه خمسون موطنا كل موطن ألف سنة، وما قدر ذلك على المؤمن إلا كما بين الظهر والعصر. الضمير في يَرَوْنَهُ للعذاب الواقع، أو ليوم القيامة فيمن علق فِي يَوْمٍ بواقع، أى: يستبعدونه على جهة الإحالة وَنحن نَراهُ قَرِيباً هينا في قدرتنا غير بعيد علينا ولا متعذر، فالمراد بالبعيد: البعيد من الإمكان، وبالقريب:\n\nالقريب منه. نصب يَوْمَ تَكُونُ بقريبا، أى: يمكن ولا يتعذر في ذلك اليوم. أو بإضمار يقع، لدلالة واقِعٍ عليه. أو يوم تكون السماء كالمهل. كان كيت وكيت. أو هو بدل عن فِي يَوْمٍ فيمن علقه بواقع كَالْمُهْلِ كدردىّ الزيت. وعن ابن مسعود: كالفضة المذابة في تلوّنها كَالْعِهْنِ كالصوف المصبوغ ألوانا، لأنّ الجبال جدد بيض وحمر مختلف ألوانها وغرابيب سود، فإذا بست وطيرت في الجو: أشبهت العهن المنفوش إذا طيرته الريح وَلا يَسْئَلُ حَمِيمٌ حَمِيماً أى لا يسأله بكيف حالك ولا يكلمه، لأن بكل أحد ما يشغله عن المساءلة يُبَصَّرُونَهُمْ أى يبصر الأحماء الأحماء، فلا يخفون عليهم، فما يمنعهم من المساءلة أنّ\n\n بعضهم لا يبصر بعضا، وإنما يمنعهم التشاغل: وقرئ: يبصرونهم. وقرئ: ولا يسئل، على البناء للمفعول، أى: لا يقال الحميم أين حميمك ولا يطلب منه، لأنهم يبصرونهم فلا يحتاجون إلى السؤال والطلب. فإن قلت: ما موقع يبصرونهم؟ قلت: هو كلام مستأنف، كأنه لما قال وَلا يَسْئَلُ حَمِيمٌ حَمِيماً قيل: لعله لا يبصره، فقيل: يبصرونهم، ولكنهم لتشاغلهم لم يتمكنوا من تساؤلهم. فإن قلت: لم جمع الضميران في يُبَصَّرُونَهُمْ وهما للحميمين؟ قلت: المعنى على العموم لكل حميمين لا لحميمين اثنين. ويجوز أن يكون يُبَصَّرُونَهُمْ صفة، أى: حميما مبصرين معرّفين إياهم. قرئ: يومئذ، بالجرّ والفتح على البناء للإضافة إلى غير متمكن، ومن عذاب يومئذ، بتنوين عَذابِ ونصب يَوْمِئِذٍ وانتصابه بعذاب، لأنه في معنى تعذيب وَفَصِيلَتِهِ عشيرته الأدنون الذين فصل عنهم تُؤْوِيهِ تضمه انتماء إليها، أو لياذا بها في النوائب يُنْجِيهِ عطف على يفتدى، أى: يودّ لو يفتدى، ثم لو ينجيه الافتداء. أو من في الأرض. وثم: لاستبعاد الإنجاء، يعنى: تمنى لو كان هؤلاء جميعا تحت يده وبذلهم في فداء نفسه، ثم ينجيه ذلك وهيهات أن ينجيه كَلَّا ردّ للمجرم عن الودادة، وتنبيه على أنه لا ينفعه الافتداء ولا ينجيه من العذاب، ثم قال إِنَّها والضمير للنار، ولم يجر لها ذكر، لأنّ ذكر العذاب دل عليها. ويجوز أن يكون ضميرا مبهما ترجم عنه الخبر، أو ضمير القصة.\n\nولَظى علم للنار، منقول من اللظى: بمعنى اللهب. ويجوز أن يراد اللهب. ونَزَّاعَةً خبر بعد خبر لأنّ، أو خبر للظى إن كانت الهاء ضمير القصة، أو صفة له إن أردت اللهب، والتأنيث لأنه في معنى النار. أو رفع على التهويل، أى: هي نزاعة. وقرئ نزاعة، بالنصب على الحال المؤكدة، أو على أنها متلظية نزاعة، أو على الاختصاص للتهويل. والشوى: الأطراف. أو جمع شواة:\n\nوهي جلدة الرأس تنزعها نزعا فتبتكها ثم تعاد تَدْعُوا مجاز عن إحضارهم، كأنها تدعوهم فتحضرهم. ونحوه قول ذى الرمّة:\n\n...... تدعو أنفه الرّبب\n\n وقوله:\n\nليالي اللهو يطبينى فأتبعه\n\nوقول أبى النجم:\n\nتقول للرّائد أعشبت أنزل\n\nوقيل: تقول لهم: إلىّ إلىّ يا كافر يا منافق. وقيل: تدعو المنافقين والكافرين بلسان فصيح.\n\nثم تلتقطهم التقاط الحب، فيجوز أن يخلق الله فيها كلاما كما يخلقه في جلودهم وأيديهم وأرجلهم، وكما خلقه في الشجرة ويجوز أن يكون دعاء الزبانية. وقيل: تدعو تهلك، من قول العرب:\n\nدعاك الله، أى: أهلكك. قال دعاك الله من رجل بأفعى مَنْ أَدْبَرَ عن الحق وَتَوَلَّى عنه وَجَمَعَ المال فجعله في وعاء وكنزه ولم يؤدّ الزكاة والحقوق الواجبة فيه، وتشاغل به عن الدين، وزهى باقتنائه وتكبر.","surah_id":70,"source_id":9},{"ayah_number":19,"ayah_text":"إِنَّ الْإِنْسانَ خُلِقَ هَلُوعاً (19) إِذا مَسَّهُ الشَّرُّ جَزُوعاً (20) وَإِذا مَسَّهُ الْخَيْرُ مَنُوعاً (21) إِلاَّ الْمُصَلِّينَ (22) الَّذِينَ هُمْ عَلى صَلاتِهِمْ دائِمُونَ (23) وَالَّذِينَ فِي أَمْوالِهِمْ حَقٌّ مَعْلُومٌ (24) لِلسَّائِلِ وَالْمَحْرُومِ (25) وَالَّذِينَ يُصَدِّقُونَ بِيَوْمِ الدِّينِ (26) وَالَّذِينَ هُمْ مِنْ عَذابِ رَبِّهِمْ مُشْفِقُونَ (27) إِنَّ عَذابَ رَبِّهِمْ غَيْرُ مَأْمُونٍ (28) وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حافِظُونَ (29) إِلاَّ عَلى أَزْواجِهِمْ أَوْ ما مَلَكَتْ أَيْمانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ (30) فَمَنِ ابْتَغى وَراءَ ذلِكَ فَأُولئِكَ هُمُ العادُونَ (31) وَالَّذِينَ هُمْ لِأَماناتِهِمْ وَعَهْدِهِمْ راعُونَ (32) وَالَّذِينَ هُمْ بِشَهاداتِهِمْ قائِمُونَ (33) وَالَّذِينَ هُمْ عَلى صَلاتِهِمْ يُحافِظُونَ (34) أُولئِكَ فِي جَنَّاتٍ مُكْرَمُونَ (35)","text":"أريد بالإنسان الناس، فلذلك استثنى منه إلا المصلين. والهلع: سرعة الجزع عند مسّ المكروه وسرعة المنع عند مسّ الخير، من قولهم: ناقة هلواع سريعة السير. وعن أحمد بن يحيى قال لي محمد بن عبد الله بن طاهر: ما الهلع؟ فقلت: قد فسره الله، ولا يكون تفسير أبين من تفسيره، وهو الذي إذا ناله شر أظهر شدّة الجزع، وإذا ناله خير بخل به ومنعه الناس.\n\nوالخير: المال والغنى، والشرّ: الفقر. أو الصحة والمرض: إذا صحّ الغنى منع المعروف وشحّ بماله، وإذا مرض جزع وأخذ يوصى. والمعنى: إن الإنسان لإيثاره الجزع والمنع وتمكنهما منه ورسوخهما فيه، كأنه مجبول عليهما مطبوع ، وكأنه أمر خلقي وضروري غير اختيارى، كقوله تعالى خُلِقَ الْإِنْسانُ مِنْ عَجَلٍ والدليل عليه أنه حين كان في البطن والمهد لم يكن به هلع، ولأنه ذمّ والله لا يذمّ فعله، والدليل عليه: استثناء المؤمنين الذين جاهدوا أنفسهم وحملوها على المكاره وظلّفوها عن الشهوات، حتى لم يكونوا جازعين ولا مانعين. وعن النبي صلى الله عليه وسلم «شرّ ما أعطى ابن آدم شحّ هالع وجبن خالع» فإن قلت: كيف قال عَلى صَلاتِهِمْ دائِمُونَ ثم على صلاتهم يحافظون؟ قلت: معنى دوامهم عليها أن يواظبوا على أدائها لا يخلون بها ولا يشتغلون عنها بشيء من الشواغل، كما روى عن النبي صلى الله عليه\n\n وسلم «أفضل العمل أدومه وإن قلّ» وقول عائشة: كان عمله ديمة . ومحافظتهم عليها:\n\nأن يراعوا إسباغ الوضوء لها ومواقيتها ويقيموا أركانها ويكملوها بسنتها وآدابها، ويحفظوها من الإحباط باقتراف المآثم، فالدوام يرجع إلى أنفس الصلوات والمحافظة إلى أحوالها حَقٌّ مَعْلُومٌ هو الزكاة، لأنها مقدرة معلومة، أو صدقة يوظفها الرجل على نفسه يؤديها في أوقات معلومة. السائل: الذي يسأل وَالْمَحْرُومِ الذي يتعفف عن السؤال فيحسب غنيا فيحرم يُصَدِّقُونَ بِيَوْمِ الدِّينِ تصديقا بأعمالهم واستعدادهم له، ويشفقون من عذاب ربهم.\n\nواعترض بقوله إِنَّ عَذابَ رَبِّهِمْ غَيْرُ مَأْمُونٍ أى لا ينبغي لأحد وان بالغ في الطاعة والاجتهاد أن يأمنه. وينبغي أن يكون مترجحا بين الخوف والرجاء. قرئ: بشهادتهم وبشهاداتهم. والشهادة من جملة الأمانات. وخصها من بينها إبانة لفضلها، لأنّ في إقامتها إحياء الحقوق وتصحيحها. وفي زيها: تضييعها وإبطالها.","surah_id":70,"source_id":9},{"ayah_number":36,"ayah_text":"فَمالِ الَّذِينَ كَفَرُوا قِبَلَكَ مُهْطِعِينَ (36) عَنِ الْيَمِينِ وَعَنِ الشِّمالِ عِزِينَ (37) أَيَطْمَعُ كُلُّ امْرِئٍ مِنْهُمْ أَنْ يُدْخَلَ جَنَّةَ نَعِيمٍ (38) كَلاَّ إِنَّا خَلَقْناهُمْ مِمَّا يَعْلَمُونَ (39) فَلا أُقْسِمُ بِرَبِّ الْمَشارِقِ وَالْمَغارِبِ إِنَّا لَقادِرُونَ (40) عَلى أَنْ نُبَدِّلَ خَيْراً مِنْهُمْ وَما نَحْنُ بِمَسْبُوقِينَ (41) فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّى يُلاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ (42) يَوْمَ يَخْرُجُونَ مِنَ الْأَجْداثِ سِراعاً كَأَنَّهُمْ إِلى نُصُبٍ يُوفِضُونَ (43) خاشِعَةً أَبْصارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ذلِكَ الْيَوْمُ الَّذِي كانُوا يُوعَدُونَ (44)","text":"كان المشركون يحتفون حول النبي صلى الله عليه وسلم حلقا حلقا وفرقا فرقا، يستمعون ويستهزءون بكلامه، ويقولون: إن دخل هؤلاء الجنة كما يقول محمد فلندخلنها قبلهم، فنزلت مُهْطِعِينَ مسرعين نحوك، مادّى أعناقهم إليك، مقبلين بأبصارهم عليك عِزِينَ فرقا شتى جمع عزة، وأصلها عزوة، كأن كل فرقة تعتزى إلى غير من تعتزى إليه الأخرى فهم مفترقون. قال الكميت:\n\nونحن وجندل باغ تركنا ... كتائب جندل شتّى عزينا\n\nوقيل: كان المستهزءون خمسة أرهط كَلَّا ردع لهم عن طمعهم في دخول الجنة، ثم علل ذلك بقوله إِنَّا خَلَقْناهُمْ مِمَّا يَعْلَمُونَ إلى آخر السورة، وهو كلام دال على إنكارهم البعث، فكأنه قال: كلا إنهم منكرون للبعث والجزاء، فمن أين يطمعون في دخول الجنة؟ فإن قلت:\n\nمن أى وجه دل هذا الكلام على إنكار البعث؟ قلت: من حيث أنه احتجاج عليهم بالنشأة الأولى، كالاحتجاج بها عليهم في مواضع من التنزيل، وذلك قوله خَلَقْناهُمْ مِمَّا يَعْلَمُونَ أى من النطف، وبالقدرة على أن يهلكهم ويبدل ناسا خيرا منهم، وأنه ليس بمسبوق على ما يريد تكوينه لا يعجزه شيء، والغرض أن من قدر على ذلك لم تعجزه الإعادة. ويجوز أن يراد:\n\nإنا خلقناهم مما يعلمون، أى: من النطفة المذرة، وهي منصبهم الذي لا منصب أوضع منه.\n\nولذلك أبهم وأخفى: إشعارا بأنه منصب يستحيا من ذكره، فمن أين يتشرفون ويدعون التقدم ويقولون: لندخلن الجنة قبلهم. وقيل: معناه إنا خلقناهم من نطفة كما خلقنا بنى آدم كلهم، ومن حكمنا أن لا يدخل أحد منهم الجنة إلا بالإيمان والعمل الصالح، فلم يطمع أن يدخلها من ليس له إيمان وعمل. وقرئ: برب المشرق والمغرب. ويخرجون، ويخرجون. ومن الأجداث سراعا، بالإظهار والإدغام. ونصب، ونصب: وهو كل ما نصب فعبد من دون الله يُوفِضُونَ يسرعون إلى الداعي مستبقين كما كانوا يستبقون إلى أنصابهم.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة سأل سائل أعطاه الله ثواب الذين هم لأماناتهم وعهدهم راعون».","surah_id":70,"source_id":9}]