[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، وآياتها 11 [نزلت بعد قريش] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":101,"source_id":9},{"ayah_number":1,"ayah_text":"الْقارِعَةُ (1) مَا الْقارِعَةُ (2) وَما أَدْراكَ مَا الْقارِعَةُ (3) يَوْمَ يَكُونُ النَّاسُ كَالْفَراشِ الْمَبْثُوثِ (4) وَتَكُونُ الْجِبالُ كَالْعِهْنِ الْمَنْفُوشِ (5) فَأَمَّا مَنْ ثَقُلَتْ مَوازِينُهُ (6) فَهُوَ فِي عِيشَةٍ راضِيَةٍ (7) وَأَمَّا مَنْ خَفَّتْ مَوازِينُهُ (8) فَأُمُّهُ هاوِيَةٌ (9) وَما أَدْراكَ ما هِيَهْ (10) نارٌ حامِيَةٌ (11)","text":"الظرف نصب بمضمر دلت عليه القارعة، أى: تقرع يَوْمَ يَكُونُ النَّاسُ كَالْفَراشِ الْمَبْثُوثِ شبههم بالفراش في الكثرة والانتشار والضعف والذلة، والتطاير إلى الداعي من كل جانب، كما يتطاير الفراش إلى النار. قال جرير:\n\nإنّ الفرزدق ما علمت وقومه ... مثل الفراش غشين نار المصطلى وفي أمثالهم: أضعف من فراشة وأذل وأجهل. وسمى فراشا: لتفرّشه وانتشاره. وشبه الجبال بالعهن وهو الصوف المصبغ ألوانا، لأنها ألوان، وبالمنفوش منه، لتفرق أجزائها.\n\nوقرأ ابن مسعود: كالصوف. الموازين: جمع موزون وهو العمل الذي له وزن وخطر عند الله.\n\nأو جمع ميزان. وثقلها: رجحانها. ومنه حديث أبى بكر لعمر رضى الله عنهما في وصيته له:\n\n«وإنما ثقلت موازين من ثقلت موازينهم يوم القيامة باتباعهم الحق وثقلها في الدنيا، وحق لميزان لا توضع فيه إلا الحسنات أن يثقل، وإنما خفت موازين من خفت موازينه لاتباعهم الباطل وخفتها في الدنيا، وحق لميزان لا توضع فيه إلا السيئات أن يخف » فَأُمُّهُ هاوِيَةٌ من قولهم إذا دعوا على الرجل بالهلكة : هوت أمّه، لأنه إذا هوى أى سقط وهلك، فقد هوت أمّه ثكلا وحزنا قال:\n\nهوت أمّه ما يبعث الصّبح غاديا ... وماذا يردّ اللّيل حين يئوب\n\nفكأنه قيل. وأما من خفت موازينه فقد هلك. وقيل هاوِيَةٌ من أسماء النار، وكأنها النار العميقة لهوى أهل النار فيها مهوى بعيدا، كما روى «يهوى فيها سبعين خريفا » أى فمأواه النار. وقيل للمأوى: أمّ، على التشبيه، لأنّ الأمّ مأوى الولد ومفزعه. وعن قتادة: فأمّه هاوية، أى فأمّ رأسه هاوية في قعر جهنم، لأنه يطرح فيها منكوسا هِيَهْ ضمير الداهية التي دلّ عليها قوله فَأُمُّهُ هاوِيَةٌ في التفسير الأوّل. أو ضمير هاوية والهاء للسكت، وإذا وصل القارئ حذفها. وقيل: حقه أن لا يدرج لئلا يسقطها الإدراج، لأنها ثابتة في المصحف.\n\nوقد أجيز إثباتها مع الوصل.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة القارعة ثقل الله بها ميزانه يوم القيامة »","surah_id":101,"source_id":9}]