[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية [إلا الآيات 10 و 11 و 20 فمدنية] وآياتها 19 وقيل 20 [نزلت بعد القلم] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":73,"source_id":9},{"ayah_number":1,"ayah_text":"يا أَيُّهَا الْمُزَّمِّلُ (1) قُمِ اللَّيْلَ إِلاَّ قَلِيلاً (2) نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلاً (3) أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلاً (4)","text":"الْمُزَّمِّلُ المتزمّل، وهو الذي تزمّل في ثيابه: أى تلفف بها، بإدغام التاء في الزاى:\n\nونحوه: المدثر في المتدثر. وقرئ: المتزمّل على الأصل والمزمل بتخفيف الزاى وفتح الميم وكسرها. على أنه اسم فاعل أو مفعول، من زمله، وهو الذي زمله غيره أو زمل نفسه وكان رسول الله صلى الله عليه وسلم نائما بالليل متزمّلا في قطيفة، فنبه ونودي بما يهجن إليه الحالة التي كان عليها من التزمل في قطيفته واستعداده للاستثقال في النوم، كما يفعل من لا يهمه أمر ولا يعنيه شأن. ألا ترى إلى قول ذى الرمّة:\n\nوكائن تخطّت ناقتي من مفازة ... ومن نائم عن ليلها متزمّل\n\n يريد: الكسلان المتقاعس الذي لا ينهض في معاظم الأمور وكفايات الخطوب، ولا يحمل نفسه المشاق والمتاعب، ونحوه:\n\nفأنت به حوش الفؤاد سبطّنا ... سهدا إذا ما نام ليل الهوجل\n\nوفي أمثالهم:\n\nأوردها سعد وسعد مشتمل ... ما هكذا تورد يا سعد الإبل\n\n فذمه بالاشتمال بكسائه، وجعل ذلك خلاف الجلد والكبس، وأمر بأن يختار على الهجود التهجد، وعلى التزمل التشمر، والتخفف للعبادة والمجاهدة في الله، لا جرم أنّ رسول الله صلى الله عليه وسلم قد تشمر لذلك مع أصحابه حق التشمر، وأقبلوا على إحياء لياليهم، ورفضوا له الرقاد والدعة، وتجاهدوا فيه حتى انتفخت أقدامهم واصفرت ألوانهم، وظهرت السيمى في وجوههم وترامى أمرهم إلى حد رحمهم له ربهم، فخفف عنهم. وقيل: كان متزملا في مرط لعائشة يصلى، فهو على هذا ليس بتهجين، بل هو ثناء عليه وتحسين لحاله التي كان عليها، وأمر بأن يدوم على ذلك ويواظب عليه. وعن عائشة رضى الله عنها: أنها سئلت ما كان تزميله؟\n\nقالت: كان مرطا طوله أربع عشرة ذراعا نصفه علىّ وأنا نائمة ونصفه عليه وهو يصلى، فسئلت:\n\nما كان؟ قالت: والله ما كان خزا ولا قزا ولا مرعزى ولا إبريسما ولا صوفا: كان سداه شعرا ولحمته وبرا . وقيل: دخل على خديجة، وقد جئث فرقا أول ما أتاه جبريل وبوادره ترعد، فقال: زملوني زملوني، وحسب أنه عرض له، فبينا هو على ذلك إذ ناداه جبريل: يا أيها المزمل . وعن عكرمة: أنّ المعنى: يا أيها الذي زمل أمرا عظيما، أى: حمله. والزمل:\n\nالحمل. وازدمله: احتمله. وقرئ: قم الليل بضم الميم وفتحها. قال عثمان بن جنى: الغرض بهذه الحركة التبلغ بها هربا من التقاء الساكنين، فبأى الحركات تحرّك فقد وقع الغرض نِصْفَهُ بدل من الليل. وإلا قليلا: استثناء من النصف، كأنه قال: قم أقل من نصف الليل. والضمير في منه وعليه للنصف، والمعنى: التخيير بين أمرين، بين أن يقوم أقل من نصف الليل على البت، وبين أن يختار أحد الأمرين وهما النقصان من النصف والزيادة عليه. وإن شئت جعلت\n\n نصفه بدلا من قليلا، وكان تخييرا بين ثلاث: بين قيام النصف بتمامه، وبين قيام الناقص منه وبين قيام الزائد عليه، وإنما وصف النصف بالقلة بالنسبة إلى الكل، وإن شئت قلت: لما كان معنى قُمِ اللَّيْلَ إِلَّا قَلِيلًا نِصْفَهُ إذا أبدلت النصف من الليل، قم أقل من نصف الليل، رجع الضمير في منه وعليه إلى الأقل من النصف، فكأنه قيل: قم أقل من نصف الليل. أو:\n\nقم أنقص من ذلك الأقل أو أزيد منه قليلا، فيكون التخيير فيما وراء النصف بينه وبين الثلث.\n\nويجوز إذا أبدلت نصفه من قليلا وفسرته به أن تجعل قليلا الثاني بمعنى نصف النصف: وهو الربع، كأنه قيل. أو انقص منه قليلا نصفه. وتجعل المزيد على هذا القليل، أعنى الربع، نصف الربع كأنه قيل: أو زد عليه قليلا نصفه. ويجوز أن تجعل الزيادة لكونها مطلقة تتمة الثلث، فيكون تخييرا بين النصف والثلث والربع. فإن قلت: أكان القيام فرضا أم نفلا؟ قلت: عن عائشة رضى الله عنها أنّ الله جعله تطوّعا بعد أن كان فريضة. وقيل: كان فرضا قبل أن تفرض الصلوات الخمس، ثم نسخ بهنّ إلا ما تطوّعوا به. وعن الحسن: كان قيام ثلث الليل فريضة، وكانوا على ذلك سنة. وقيل: كان واجبا، وإنما وقع التخيير في المقدار، ثم نسخ بعد عشر سنين. وعن الكلبي: كان يقوم الرجل حتى يصبح مخافة أن لا يحفظ ما بين النصف والثلث والثلثين، ومنهم من قال: كان نفلا بدليل التخيير في المقدار، ولقوله تعالى وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نافِلَةً لَكَ.\n\nترتيل القرآن: قراءته على ترسل وتؤدة بتبيين الحروف وإشباع الحركات، حتى يجيء المتلوّ منه شبيها بالثغر المرتل: وهو المفلج المشبه بنور الأقحوان، وألا يهذه هذا ولا يسرده سردا ، كما قال عمر رضى الله عنه: شر السير الحقحقة. وشر القراءة الهذرمة، حتى يشبه المتلو في تتابعه الثغر الألص . وسئلت عائشة رضى الله عنها عن قراءة رسول الله صلى الله عليه وسلم؟ فقالت: لا كسردكم هذا، لو أراد السامع أن يعد حروفه لعدها. وتَرْتِيلًا تأكيد في إيجاب الأمر به، وأنه ما لا بد منه للقارئ.","surah_id":73,"source_id":9},{"ayah_number":5,"ayah_text":"إِنَّا سَنُلْقِي عَلَيْكَ قَوْلاً ثَقِيلاً (5)","text":"هذه الآية اعتراض، ويعنى بالقول الثقيل: القرآن وما فيه من الأوامر والنواهي التي هي تكاليف شاقة ثقيلة على المكلفين، خاصة على رسول الله صلى الله عليه وسلم لأنه متحملها بنفسه ومحملها أمته، فهي أثقل عليه وأبهظ له، وأراد بهذا الاعتراض: أن ما كلفه من قيام الليل من جملة التكاليف الثقيلة الصعبة التي ورد بها القرآن، لأنّ الليل وقت السبات والراحة والهدوء فلا بد لمن أحياه من مضادة لطبعه ومجاهدة لنفسه. وعن ابن عباس رضى الله عنه: كان إذا نزل عليه الوحى ثقل عليه وتربد له جلده. وعن عائشة رضى الله عنها: رأيته ينزل عليه الوحى في اليوم الشديد البرد فيفصم عنه وإنّ جبينه ليرفض عرقا . وعن الحسن: ثقيل في الميزان. وقيل:\n\nثقيل على المنافقين. وقيل: كلام له وزن ورجحان ليس بالسفساف.","surah_id":73,"source_id":9},{"ayah_number":6,"ayah_text":"إِنَّ ناشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئاً وَأَقْوَمُ قِيلاً (6)","text":"ناشِئَةَ اللَّيْلِ النفس الناشئة بالليل، التي تنشأ من مضجعها إلى العبادة ، أى: تنهض وترتفع، من نشأت السحابة: إذا ارتفعت. ونشأ من مكانه ونشز: إذا نهض، قال:\n\nنشأنا إلى خوص برى نيّها السّرى ... وألصق منها مشرفات القماحد\n\nوقيام الليل، على أنّ الناشئة مصدر من نشأ إذا قام ونهض على فاعلة: كالعاقبة. ويدل عليه ما روى عن عبيد بن عمير: قلت لعائشة: رجل قام من أوّل الليل، أتقولين له قام ناشئة؟\n\nقالت لا، إنما الناشئة القيام بعد النوم. ففسرت الناشئة بالقيام عن المضجع أو العبادة التي تنشأ بالليل، أى: تحدث، وترتفع. وقيل: هي ساعات الليل كلها، لأنها تحدث واحدة بعد أخرى. وقيل:\n\nالساعات الأول منه. وعن على بن الحسين رضى الله عنهما أنه كان يصلى بين المغرب والعشاء ويقول: أما سمعتم قول الله تعالى إِنَّ ناشِئَةَ اللَّيْلِ هذه ناشئة الليل هِيَ أَشَدُّ وَطْئاً هي خاصة دون ناشئة النهار، أشدّ مواطأة يواطئ قلبها لسانها: إن أردت النفس. أو يواطئ فيها قلب القائم لسانه: إن أردت القيام أو العبادة أو الساعات. أو أشدّ موافقة لما يراد من الخشوع والإخلاص. وعن الحسن: أشدّ موافقة بين السر والعلانية، لانقطاع رؤية الخلائق. وقرئ:\n\nأشدّ وطأ بالفتح والكسر. والمعنى: أشد ثبات قدم وأبعد من الزلل. أو أثقل وأغلظ على المصلى من صلاة النهار، من قوله عليه السلام «اللهم اشدد وطأتك على مضر» وَأَقْوَمُ قِيلًا وأسد مقالا وأثبت قراءة لهدوّ الأصوات. وعن أنس رضى الله عنه أنه قرأ: وأصوب قيلا، فقيل له: يا أبا حمزة، إنما هي: وأقوم، فقال: إنّ أقوم وأصوب وأهيأ واحد. وروى أبو زيد الأنصارى عن أبى سرار الغنوي أنه كان يقرأ: فحاسوا، محاء غير معجمة، فقيل له:\n\nإنما هو فَجاسُوا بالجيم، فقال: وجاسوا وحاسوا واحد.","surah_id":73,"source_id":9},{"ayah_number":7,"ayah_text":"إِنَّ لَكَ فِي النَّهارِ سَبْحاً طَوِيلاً (7)","text":"سَبْحاً تصرفا وتقلبا في مهماتك وشواغلك، ولا تفرغ إلا بالليل، فعليك بمناجاة الله التي تقتضي فراغ البال وانتفاء الشواغل. وأما القراءة بالخاء. فاستعارة من سبخ الصوف:\n\nوهو نفشه ونشر أجزائه، لانتشار الهم وتفرّق القلب بالشواغل: كلفه قيام الليل، ثم ذكر الحكمة فيما كلفه منه: وهو أن الليل أعون على المواطأة وأشد للقراءة، لهدوّ الرجل وخفوت الصوت: وأنه أجمع للقلب وأضم لنشر الهم من النهار، لأنه وقت تفرق الهموم وتوزع الخواطر والتقلب في حوائج المعاش والمعاد. وقيل: فراغا وسعة لنومك وتصرفك في حوائجك. وقيل:\n\nإن فاتك من الليل شيء فلك في النهار فراغ تقدر على تداركه فيه.","surah_id":73,"source_id":9},{"ayah_number":8,"ayah_text":"وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلاً (8) رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لا إِلهَ إِلاَّ هُوَ فَاتَّخِذْهُ وَكِيلاً (9) وَاصْبِرْ عَلى ما يَقُولُونَ وَاهْجُرْهُمْ هَجْراً جَمِيلاً (10)","text":"وَاذْكُرِ اسْمَ رَبِّكَ ودم على ذكره في ليلك ونهارك، واحرص عليه. وذكر الله يتناول كل ما كان من ذكر طيب: تسبيح، وتهليل، وتكبير، وتمجيد، وتوحيد، وصلاة، وتلاوة قرآن، ودراسة علم، وغير ذلك مما كان رسول الله صلى الله عليه وسلم يستغرق به ساعة ليله ونهاره وَتَبَتَّلْ إِلَيْهِ وانقطع إليه. فإن قلت: كيف قيل تَبْتِيلًا مكان تبتلا؟ قلت: لأن معنى تبتل بتل نفسه، فجيء به على معناه مراعاة لحق الفواصل رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ قرئ مرفوعا على المدح، ومجرورا على البدل من ربك. وعن ابن عباس: على القسم بإضمار حرف القسم، كقولك: الله لأفعلنّ، وجوابه لا إِلهَ إِلَّا هُوَ كما تقول: والله لا أحد في الدار إلا زيد. وقرأ ابن عباس: رب المشارق والمغارب فَاتَّخِذْهُ وَكِيلًا مسبب على التهليلة، لأنه هو وحده هو الذي يجب لتوحده بالربوبية أن توكل إليه الأمور. وقيل وَكِيلًا: كفيلا بما وعدك من النصر والإظهار. الهجر الجميل: أن يجانبهم بقلبه وهواه، ويخالفهم مع حسن المخالقة والمداراة والإغضاء وترك المكافأة. وعن أبى الدرداء رضى الله عنه: إنا لنكشر في وجوه قوم ونضحك إليهم، وإن قلوبنا لتقليهم . وقيل: هو منسوخ بآية السيف.","surah_id":73,"source_id":9},{"ayah_number":11,"ayah_text":"وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلاً (11) إِنَّ لَدَيْنا أَنْكالاً وَجَحِيماً (12) وَطَعاماً ذا غُصَّةٍ وَعَذاباً أَلِيماً (13) يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبالُ وَكانَتِ الْجِبالُ كَثِيباً مَهِيلاً (14)","text":"إذا عرف الرجل من صاحبه أنه مستهم بخطب يريد أن يكفاه، أو بعدوّ يشتهى أن ينتقم له منه وهو مضطلع بذلك مقتدر عليه قال: ذرني وإياه، أى: لا تحتاج إلى الظفر بمرادك ومشتهاك، إلا أن تخلى بيني وبينه بأن تكل أمره إلىّ وتستكفينيه، فإنّ فىّ ما يفرغ بالك ويجلى همك، وليس ثم منع حتى يطلب إليه أن يذره وإياه إلا ترك الاستكفاء والتفويض، كأنه إذا لم يكل أمره إليه، فكأنه منعه منه، فإذا وكله إليه فقد أزال المنع وتركه وإياه، وفيه دليل على الوثوق بأنه يتمكن من الوفاء بأقصى ما تدور حوله أمنية المخاطب وبما يزيد عليه. النعمة- بالفتح- التنعم، وبالكسر: الإنعام، وبالضم: المسرة، يقال: نعم، ونعمة عين، وهم صناديد قريش، وكانوا أهل تنعم وترفه إِنَّ لَدَيْنا ما يضاد تنعمهم من أنكال: وهي القيود الثقال: عن الشعبي، إذا ارتفعوا استقلت بهم. الواحد: نكل ونكل. ومن جحيم: وهي النار الشديدة الحر والاتقاد. ومن طعام ذى غصة وهو الذي ينشب في الحلوق فلا يساغ يعنى الضريع وشجر الزقوم. ومن عذاب أليم من سائر العذاب فلا ترى موكولا إليه أمرهم موذورا بينه وبينهم ينتقم منهم بمثل ذلك الانتقام. وروى أنّ النبي صلى الله عليه وسلم قرأ هذه الآية فصعق . وعن الحسن: أنه أمسى صائما، فأتى بطعام، فعرضت له هذه الآية، فقال: ارفعه، ووضع عنده الليلة الثانية، فعرضت له، فقال: ارفعه، وكذلك الليلة الثالثة، فأخبر ثابت البناني ويزيد الضبي ويحيى البكاء، فجاءوا فلم يزالوا به حتى شرب شربة من سويق يَوْمَ تَرْجُفُ منصوب بما في لدينا. والرجفة: الزلزلة والزعزعة الشديدة. والكثيب: الرمل المجتمع من كثب الشيء إذا جمعه، كأنه فعيل بمعنى مفعول في أصله. ومنه الكثبة من اللبن، قالت الضائنة: أجز جفالا وأحلب كثبا عجالا، أى: كانت مثل رمل مجتمع هيل هيلا، أى: نثر وأسيل.","surah_id":73,"source_id":9},{"ayah_number":15,"ayah_text":"إِنَّا أَرْسَلْنا إِلَيْكُمْ رَسُولاً شاهِداً عَلَيْكُمْ كَما أَرْسَلْنا إِلى فِرْعَوْنَ رَسُولاً (15) فَعَصى فِرْعَوْنُ الرَّسُولَ فَأَخَذْناهُ أَخْذاً وَبِيلاً (16)","text":"الخطاب لأهل مكة شاهِداً عَلَيْكُمْ يشهد عليكم يوم القيامة بكفركم وتكذيبكم. فإن قلت:\n\nلم نكر الرسول ثم عرف؟ قلت: لأنه أراد: أرسلنا إلى فرعون بعض الرسل، فلما أعاده وهو معهود بالذكر أدخل لام التعريف إشارة إلى المذكور بعينه وَبِيلًا ثقيلا غليظا، من قولهم:\n\nكلأ وبيل وخم لا يستمرأ لثقله. والوبيل: العصا الضخمة. ومنه الوابل للمطر العظيم.","surah_id":73,"source_id":9},{"ayah_number":17,"ayah_text":"فَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْماً يَجْعَلُ الْوِلْدانَ شِيباً (17) السَّماءُ مُنْفَطِرٌ بِهِ كانَ وَعْدُهُ مَفْعُولاً (18)","text":"يَوْماً مفعول به، أى: فكيف تقون أنفسكم يوم القيامة وهو له، إن بقيتم على الكفر.\n\nولم تؤمنوا وتعملوا صالحا. ويجوز أن يكون ظرفا، أى: فكيف لكم بالتقوى في يوم القيامة إن كفرتم في الدنيا. ويجوز أن ينتصب بكفرتم على تأويل جحدتم، أى فكيف تتقون الله وتخشونه إن جحدتم يوم القيامة والجزاء: لأن تقوى الله خوف عقابه يَجْعَلُ الْوِلْدانَ شِيباً مثل في الشدة يقال في اليوم الشديد: يوم يشيب نواصي الأطفال. والأصل فيه: أنّ الهموم والأحزان إذا تفاقمت على الإنسان. أسرع فيه الشيب. قال أبو الطيب:\n\nوالهمّ يخترم الجسيم نحافة ... ويشيب ناصية الصّبىّ ويهرم وقد مرّ بى في بعض الكتب أن رجلا أمسى فاحم الشعر كحنك الغراب، وأصبح وهو أبيض الرأس واللحية كالثغامة، فقال: أريت القيامة والجنة والنار في المنام، ورأيت الناس يقادون في السلاسل إلى النار، فمن هول ذلك أصبحت كما ترون.\n\nويجوز أن يوصف اليوم بالطول. وأنّ الأطفال يبلغون فيه أوان الشيخوخة والشيب السَّماءُ مُنْفَطِرٌ بِهِ وصف لليوم بالشدّة أيضا. وأنّ السماء على عظمها وإحكامها تنفطر فيه، فما ظنك بغيرها من الخلائق. وقرئ: منفطر ومتفطر. والمعنى: ذات انفطار. أو على تأويل السماء بالسقف. أو على تأويل السماء شيء منفطر، والباء في بِهِ مثلها في قولك: فطرت العود بالقدوم فانفطر به، يعنى: أنها تنفطر بشدة ذلك اليوم وهو له كما ينفطر الشيء بما يفطر به. ويجوز أن يراد السماء مثقلة به إثقالا يؤدّى إلى انفطارها لعظمه عليها وخشيتها من وقوعه، كقوله ثَقُلَتْ فِي السَّماواتِ وَالْأَرْضِ. وَعْدُهُ من إضافة المصدر إلى المفعول، والضمير لليوم. ويجوز أن يكون مضافا إلى الفاعل وهو الله عز وعلا، ولم يجر له ذكر لسكونه معلوما.","surah_id":73,"source_id":9},{"ayah_number":19,"ayah_text":"إِنَّ هذِهِ تَذْكِرَةٌ فَمَنْ شاءَ اتَّخَذَ إِلى رَبِّهِ سَبِيلاً (19)","text":"إِنَّ هذِهِ الآيات الناطقة بالوعيد الشديد تَذْكِرَةٌ موعظة فَمَنْ شاءَ اتعظ بها.\n\nواتخذ سبيلا إلى الله بالتقوى والخشية. ومعنى اتخاذ السبيل إليه: التقرّب والتوسل بالطاعة.","surah_id":73,"source_id":9},{"ayah_number":20,"ayah_text":"إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنى مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطائِفَةٌ مِنَ الَّذِينَ مَعَكَ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهارَ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتابَ عَلَيْكُمْ فَاقْرَؤُا ما تَيَسَّرَ مِنَ الْقُرْآنِ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضى وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ وَآخَرُونَ يُقاتِلُونَ فِي سَبِيلِ اللَّهِ فَاقْرَؤُا ما تَيَسَّرَ مِنْهُ وَأَقِيمُوا الصَّلاةَ وَآتُوا الزَّكاةَ وَأَقْرِضُوا اللَّهَ قَرْضاً حَسَناً وَما تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْراً وَأَعْظَمَ أَجْراً وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (20)","text":"أَدْنى مِنْ ثُلُثَيِ اللَّيْلِ أقل منهما، وإنما استعير الأدنى وهو الأقرب للأقل، لأن المسافة بين الشيئين إذا دنت: قل ما بينهما من الأحياز، وإذا بعدت كثر ذلك. وقرئ: ونصفه وثلثه بالنصب على أنك تقوم أقل من الثلثين، وتقوم النصف والثلث: وهو مطابق لما مرّ في أوّل السورة: من التخيير بين قيام النصف بتمامه وبين قيام الناقص منه- وهو الثلث- وبين قيام الزائد عليه- وهو الأدنى من الثلثين. وقرئ: ونصفه، وثلثه: بالجرّ، أى: تقوم أقل من الثلثين وأقل من النصف والثلث، وهو مطابق للتخيير بين النصف: وهو أدنى من الثلثين.\n\nوالثلث: وهو أدنى من النصف. والربع: وهو أدنى من الثلث، وهو الوجه الأخير وَطائِفَةٌ مِنَ الَّذِينَ مَعَكَ ويقوم ذلك جماعة من أصحابك وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهارَ ولا يقدر على تقدير الليل والنهار ومعرفة مقادير ساعاتهما إلا الله وحده، وتقديم اسمه عز وجل مبتدأ مبنيا عليه يقدّر: هو الدال على معنى الاختصاص بالتقدير، والمعنى: أنكم لا تقدرون عليه، والضمير في لَنْ تُحْصُوهُ لمصدر يقدّر، أى علم أنه لا يصح منكم ضبط الأوقات ولا يتأتى حسابها بالتعديل والتسوية، إلا أن تأخذوا بالأوسع للاحتياط: وذلك شاق عليكم بالغ منكم فَتابَ عَلَيْكُمْ عبارة عن الترخيص في ترك القيام المقدّر، كقوله فَتابَ عَلَيْكُمْ وَعَفا عَنْكُمْ فَالْآنَ بَاشِرُوهُنَّ والمعنى: أنه رفع التبعة في تركه عنكم، كما يرفع التبعة عن التائب. وعبر عن الصلاة بالقراءة، لأنها بعض أركانها، كما عبر عنها بالقيام والركوع والسجود. يريد: فصلوا ما تيسر عليكم، ولم يتعذر من صلاة الليل، وهذا ناسخ للأوّل، ثم نسخا جميعا بالصلوات الخمس. وقيل هي قراءة القرآن بعينها، قيل: يقرأ مائة آية. ومن قرأ مائة آية في ليلة لم يحاجه القرآن، وقيل:\n\nمن قرأ مائة آية كتب من القانتين. وقيل: خمسين آية. وقد بين الحكمة في النسخ. وهي تعذر القيام على المرضى، والضاربين في الأرض للتجارة، والمجاهدين في سبيل الله. وقيل: سوّى الله بين المجاهدين والمسافرين لكسب الحلال. وعن عبد الله بن مسعود رضى الله عنه: أيما رجل جلب شيأ إلى مدينة من مدائن المسلمين صابرا محتسبا، فباعه بسعر يومه: كان عند الله من الشهداء . وعن عبد الله بن عمر: ما خلق الله موتة أموتها بعد القتل في سبيل الله أحب إلىّ من أن أموت بين شعبتى رحل: أضرب في الأرض أبتغى من فضل الله . وعَلِمَ استئناف على تقدير السؤال عن وجه النسخ وَأَقِيمُوا الصَّلاةَ يعنى المفروضة والزكاة الواجبة وقيل: زكاة الفطر، لأنه لم يكن بمكة زكاة. وإنما وجبت بعد ذلك، ومن فسرها بالزكاة الواجبة جعل آخر السورة مدنيا وَأَقْرِضُوا اللَّهَ قَرْضاً حَسَناً يجوز أن يريد: سائر الصدقات وأن يريد: أداء الزكاة على أحسن وجه: من إخراج أطيب المال وأعوده على الفقراء، ومراعاة النية وابتغاء وجه الله، والصرف إلى المستحق، وأن يريد: كل شيء يفعل من الخيز مما يتعلق بالنفس والمال خَيْراً ثانى مفعولي وجد. وهو فصل. وجاز وإن لم يقع بين معرفتين، لأنّ أفعل من أشبه في امتناعه من حرف التعريف المعرفة. وقرأ أبو السمال: هو خير وأعظم أجرا، بالرفع على الابتداء والخبر:\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة المزمّل دفع الله عنه العسر في الدنيا والآخرة».","surah_id":73,"source_id":9}]