[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية، إلا آية 17 فمدنية وآياتها 60 [نزلت بعد الانشقاق] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":30,"source_id":9},{"ayah_number":1,"ayah_text":"الم (1) غُلِبَتِ الرُّومُ (2) فِي أَدْنَى الْأَرْضِ وَهُمْ مِنْ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ (3) فِي بِضْعِ سِنِينَ لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ (4) بِنَصْرِ اللَّهِ يَنْصُرُ مَنْ يَشاءُ وَهُوَ الْعَزِيزُ الرَّحِيمُ (5)","text":"القراءة المشهورة الكثيرة غُلِبَتِ بضم الغين. وسيغلبون بفتح الياء. والأرض: أرض العرب، لأن الأرض المعهودة عند العرب أرضهم. والمعنى: غلبوا في أدنى أرض العرب منهم وهي أطراف الشام. أو أراد أرضهم، على إنابة اللام مناب المضاف إليه، أى: في أدنى أرضهم إلى عدوّهم. قال مجاهد: هي أرض الجزيرة، وهي أدنى أرض الروم إلى فارس. وعن ابن عباس رضى الله عنهما: الأردن وفلسطين. وقرئ: في أدانى الأرض. والبضع ما بين الثلاث إلى العشر عن الأصمعى. وقيل: احتربت الروم وفارس بين أذرعات وبصرى، فغلبت فارس الروم، فبلغ الخبر مكة فشق على النبي صلى الله عليه وسلم والمسلمين ، لأن فارس مجوس لا كتاب لهم والروم أهل الكتاب، وفرح المشركون وشمتوا وقالوا: أنتم والنصارى أهل الكتاب، ونحن وفارس أميون، وقد ظهر إخواننا على إخوانكم، ولنظهرنّ نحن عليكم، فنزلت. فقال لهم أبو بكر رضى الله عنه: لا يقرّر الله أعينكم، فو الله لتظهرنّ الروم على فارس بعد بضع سنين فقال له أبى بن خلف. كذبت يا أبا فصيل، اجعل بيننا أجلا أنا حبك عليه. والمناحبة: المراهنة فناحبه على عشر قلائص من كل واحد منهما، وجعلا الأجل ثلاث سنين، فأخبر أبو بكر رضى الله عنه رسول الله صلى الله عليه وسلم فقال: البضع ما بين الثلاث إلى التسع، فزايده في الخطر ومادّه في الأجل. فجعلاها مائة قلوص إلى تسع سنين. ومات أبىّ من جرح رسول الله، وظهرت الروم على فارس يوم الحديبية، وذلك عند رأس سبع سنين. وقيل: كان النصر يوم بدر للفريقين، فأخذ أبو بكر الخطر من ذرية أبى، وجاء به إلى رسول الله صلى الله عليه وسلم فقال: تصدّق به. وهذه الآية من الآيات البينة الشاهدة على صحة النبوّة، وأن القرآن من عند الله لأنها إنباء عن علم الغيب الذي لا يعلمه إلا الله. وقرئ: غلبهم، بسكون اللام. والغلب والغلب.\n\nمصدران كالجلب والجلب، والحلب والحلب. وقرئ: غلبت الروم، بالفتح. وسيغلبون، بالضم. ومعناه أن الروم غلبوا على ريف الشام وسيغلبهم المسلمون في بضع سنين. وعند انقضاء هذه المدّة أخذ المسلمون في جهاد الروم، وإضافة غلبهم تختلف باختلاف القراءتين، فهي في إحداهما إضافة المصدر إلى المفعول. وفي الثانية إضافته إلى الفاعل. ومثالهما مُحَرَّمٌ عَلَيْكُمْ إِخْراجُهُمْ، وَلَنْ يُخْلِفَ اللَّهُ وَعْدَهُ. فإن قلت: كيف صحت المناحبة وإنما هي قمار؟ قلت: عن قتادة رحمه الله أنه كان ذلك قبل تحريم القمار. ومن مذهب أبى حنيفة ومحمد: أن العقود الفاسدة من عقود الربا وغيرها جائزة في دار الحرب بين المسلمين والكفار. وقد احتجا على صحة ذلك بما عقده أبو بكر بينه وبين أبىّ بن خلف مِنْ قَبْلُ وَمِنْ بَعْدُ أى في أوّل الوقتين وفي آخرهما حين غلبوا وحين يغلبون، كأنه قيل: من قبل كونهم غالبين، وهو وقت كونهم مغلوبين. ومن بعد كونهم مغلوبين، وهو وقت كونهم غالبين، يعنى أن كونهم مغلوبين أوّلا وغالبين آخرا ليس إلا بأمر الله وقضائه وَتِلْكَ الْأَيَّامُ نُداوِلُها بَيْنَ النَّاسِ وقرئ: من قبل ومن بعد، على الجرّ من غير تقدير مضاف إليه واقتطاعه. كأنه قيل: قبلا وبعدا، بمعنى أوّلا وآخرا وَيَوْمَئِذٍ ويوم تغلب الروم على فارس ويحل ما وعده الله عزّ وجل من غلبتهم يَفْرَحُ الْمُؤْمِنُونَ بِنَصْرِ اللَّهِ وتغليبه من له كتاب على من لا كتاب له. وغيظ من شمت بهم من كفار مكة. وقيل:\n\nنصر الله: هو إظهار صدق المؤمنين فيما أخبروا به المشركين من غلبة الروم وقيل نصر الله. أنه ولى بعض الظالمين بعضا وفرق بين كلمهم، حتى تفانوا وتناقصوا، وفل هؤلاء شوكة هؤلاء وفي ذلك قوّة للإسلام. وعن أبى سعيد الخدري: وافق ذلك يوم بدر، وفي هذا اليوم نصر المؤمنون وَهُوَ الْعَزِيزُ الرَّحِيمُ ينصر عليكم تارة وينصركم أخرى. ","surah_id":30,"source_id":9},{"ayah_number":6,"ayah_text":"وَعْدَ اللَّهِ لا يُخْلِفُ اللَّهُ وَعْدَهُ وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (6) يَعْلَمُونَ ظاهِراً مِنَ الْحَياةِ الدُّنْيا وَهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ (7)","text":"وَعْدَ اللَّهِ مصدر مؤكد، كقولك: لك علىّ ألف درهم عرفا، لأنّ معناه: أعترف لك بها اعترافا، ووعد الله ذلك وعدا، لأنّ ما سبقه في معنى وعد. ذمّهم الله عزّ وجل بأنهم عقلاء في أمور الدنيا، بله في أمر الدين، وذلك أنهم كانوا أصحاب تجارات ومكاسب. وعن الحسن.\n\nبلغ من حذق أحدهم أنه يأخذ الدرهم فينقره بإصبعه، فيعلم أرديء هو أم جيد. وقوله يَعْلَمُونَ بدل من قوله لا يَعْلَمُونَ وفي هذا الإبدال من النكتة أنه أبدله منه، وجعله بحيث يقوم مقامه ويسدّ مسدّه، ليعلمك أنه لا فرق بين عدم العلم الذي هو الجهل، وبين وجود العلم الذي لا يتجاوز الدنيا. وقوله ظاهِراً مِنَ الْحَياةِ الدُّنْيا يفيد أن للدنيا ظاهرا وباطنا، فظاهرها ما يعرفه الجهال من التمتع بزخارفها والتنعم بملاذها. وباطنها وحقيقتها أنها مجاز إلى الآخرة: يتزود منها إليها بالطاعة والأعمال الصالحة. وفي تنكير الظاهر: أنهم لا يعلمون إلا ظاهرا واحدا من جملة الظواهر. و «هم» الثانية يجوز أن يكون مبتدأ. وغافِلُونَ خبره، والجملة خبر «هم» الأولى، وأن يكون تكريرا للأولى، وغافلون خبر الأولى. وأية كانت فذكرها مناد على أنهم معدن الغفلة عن الآخرة ومقرّها ومعلمها، وأنها منهم تنبع وإليهم ترجع.","surah_id":30,"source_id":9},{"ayah_number":8,"ayah_text":"أَوَلَمْ يَتَفَكَّرُوا فِي أَنْفُسِهِمْ ما خَلَقَ اللَّهُ السَّماواتِ وَالْأَرْضَ وَما بَيْنَهُما إِلاَّ بِالْحَقِّ وَأَجَلٍ مُسَمًّى وَإِنَّ كَثِيراً مِنَ النَّاسِ بِلِقاءِ رَبِّهِمْ لَكافِرُونَ (8)","text":"\nفِي أَنْفُسِهِمْ يحتمل أن يكون ظرفا، كأنه قيل: أو لم يحدثوا التفكر في أنفسهم، أى:\n\nفي قلوبهم الفارغة من الفكر، والتفكر لا يكون إلا في القلوب، ولكنه زيادة تصوير لحال المتفكرين، كقولك: اعتقده في قلبك وأضمره في نفسك، وأن يكون صلة للتفكر، كقولك:\n\nتفكر في الأمر وأجال فيه فكره. وما خَلَقَ متعلق بالقول المحذوف، معناه: أو لم يتفكروا فيقولوا هذا القول. وقيل: معناه: فيعلموا، لأنّ في الكلام دليلا عليه إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى\n\n أى ما خلقها باطلا وعبثا بغير غرض صحيح وحكمة بالغة، ولا لتبقى خالدة: وإنما خلقها مقرونة بالحق مصحوبة بالحكمة، وبتقدير أجل مسمى لا بد لها من أن تنتهي إليه، وهو قيام الساعة ووقت الحساب والثواب والعقاب. ألا ترى إلى قوله تعالى أَفَحَسِبْتُمْ أَنَّما خَلَقْناكُمْ عَبَثاً وَأَنَّكُمْ إِلَيْنا لا تُرْجَعُونَ كيف سمى تركهم غير راجعين إليه عبثا. والباء في قوله إِلَّا بِالْحَقِّ مثلها في قولك: دخلت عليه بثياب السفر، واشترى الفرس بسرجه ولجامه، تريد: اشتراه وهو ملتبس بالسرج واللجام، غير منفك عنهما. وكذلك المعنى ما خلقها إلا وهي ملتبسة بالحق مقترنة به، فإن قلت: إذا جعلت فِي أَنْفُسِهِمْ صلة للتفكر، فما معناه؟ قلت: معناه: أو لم يتفكروا في أنفسهم التي هي أقرب إليهم من غيرها من المخلوقات، وهم أعلم وأخبر بأحوالها منهم بأحوال ما عداها، فتدبروا ما أودعها الله ظاهرا وباطنا من غرائب الحكم الدالة على التدبير دون الإهمال وأنه لا بد لها من انتهاء إلى وقت يجازيها فيه الحكم الذي دبر أمرها على الإحسان إحسانا وعلى الإساءة مثلها، حتى يعلموا عند ذلك أن سائر الخلائق كذلك أمرها جار على الحكمة والتدبير وأنه لا بد لها من الانتهاء إلى ذلك الوقت، والمراد بلقاء ربهم: الأجل المسمى.","surah_id":30,"source_id":9},{"ayah_number":9,"ayah_text":"أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كانَ عاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ كانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثارُوا الْأَرْضَ وَعَمَرُوها أَكْثَرَ مِمَّا عَمَرُوها وَجاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّناتِ فَما كانَ اللَّهُ لِيَظْلِمَهُمْ وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ (9)","text":"أَوَلَمْ يَسِيرُوا تقرير لسيرهم في البلاد ونظرهم إلى آثار المدمّرين من عاد وثمود وغيرهم من الأمم العاتية، ثم أخذ يصف لهم أحوالهم وأنهم كانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَأَثارُوا الْأَرْضَ وحرثوها قال الله تعالى لا ذَلُولٌ تُثِيرُ الْأَرْضَ وقيل لبقر الحرث: المثيرة. وقالوا: سمى ثورا لإثارته الأرض وبقرة، لأنها تبقرها أى تشقها وَعَمَرُوها يعنى أولئك المدمّرون أَكْثَرَ مِمَّا عَمَرُوها من عمارة أهل مكة. وأهل مكة: أهل واد غير ذى زرع، ما لهم إثارة الأرض أصلا، ولا عمارة لها رأسا فما هو إلا تهكم بهم، وبضعف حالهم في دنياهم، لأنّ معظم ما يستظهر به أهل الدنيا ويتباهون به أمر الدهقنة ، وهم أيضا ضعاف القوى، فقوله كانُوا أَشَدَّ مِنْهُمْ قُوَّةً أى عاد وثمود وأضرابهم من هذا القبيل، كقوله أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وإن كان هذا أبلغ، لأنه خالق القوى والقدر. فما كان تدميره إياهم ظلما لهم، لأنّ حاله منافية للظلم، ولكنهم ظلموا أنفسهم حيث عملوا ما أوجب تدميرهم.","surah_id":30,"source_id":9},{"ayah_number":10,"ayah_text":"ثُمَّ كانَ عاقِبَةَ الَّذِينَ أَساؤُا السُّواى أَنْ كَذَّبُوا بِآياتِ اللَّهِ وَكانُوا بِها يَسْتَهْزِؤُنَ (10)","text":"قرئ عاقبة بالنصب والرفع. والسُّواى تأنيث الأسوأ وهو الأقبح، كما أنّ الحسنى تأنيث الأحسن. والمعنى: أنهم عوقبوا في الدنيا بالدمار، ثم كانت عاقبتهم سوأى إلا أنه وضع المظهر موضع المضمر، أى: العقوبة التي هي أسوأ العقوبات في الآخرة، وهي جهنم التي أعدّت للكافرين. وأَنْ كَذَّبُوا بمعنى لأن كذبوا. ويجوز أن يكون أن بمعنى: أى، لأنه إذا كان تفسير الإساءة التكذيب والاستهزاء كانت في معنى القول، نحو: نادى. وكتب، وما أشبه ذلك. ووجه آخر: وهو أن يكون أَساؤُا السُّواى بمعنى اقترفوا الخطيئة التي هي أسوأ الخطايا، وأَنْ كَذَّبُوا عطف بيان لها، وخبر كان محذوف كما يحذف جواب لما ولو، إرادة الإبهام.","surah_id":30,"source_id":9},{"ayah_number":11,"ayah_text":"اللَّهُ يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ ثُمَّ إِلَيْهِ تُرْجَعُونَ (11)","text":"ثُمَّ إِلَيْهِ تُرْجَعُونَ أى إلى ثوابه وعقابه. وقرئ بالتاء والياء.","surah_id":30,"source_id":9},{"ayah_number":12,"ayah_text":"وَيَوْمَ تَقُومُ السَّاعَةُ يُبْلِسُ الْمُجْرِمُونَ (12) وَلَمْ يَكُنْ لَهُمْ مِنْ شُرَكائِهِمْ شُفَعاءُ وَكانُوا بِشُرَكائِهِمْ كافِرِينَ (13)","text":"الإبلاس: أى يبقى بائسا ساكنا متحيرا. يقال: ناظرته فأبلس، إذا لم ينبس ويئس من أن يحتجّ. ومنه الناقة المبلاس: التي لا ترغو. وقرئ: يبلس، بفتح اللام، من أبلسه إذا أسكته مِنْ شُرَكائِهِمْ من الذين عبدوهم من دون الله وَكانُوا بِشُرَكائِهِمْ كافِرِينَ أى يكفرون بإلهيتهم ويجحدونها. أو وكانوا في الدنيا كافرين بسببهم. وكتب «شفعواء» في المصحف بواو قبل الألف، كما كتب «علمؤا بنى إسرائيل» وكذلك كتبت «السوأى» بألف قبل الياء إثباتا للهمزة على صورة الحرف الذي منه حركتها.","surah_id":30,"source_id":9},{"ayah_number":14,"ayah_text":"وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ (14) فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ (15) وَأَمَّا الَّذِينَ كَفَرُوا وَكَذَّبُوا بِآياتِنا وَلِقاءِ الْآخِرَةِ فَأُولئِكَ فِي الْعَذابِ مُحْضَرُونَ (16)","text":"الضمير في يَتَفَرَّقُونَ للمسلمين والكافرين، لدلالة ما بعده عليه. وعن الحسن رضى الله عنه:\n\nهو تفرّق المسلمين والكافرين: هؤلاء في عليين، وهؤلاء في أسفل السافلين- وعن قتادة رضى الله عنه: فرقة لا اجتماع بعدها فِي رَوْضَةٍ في بستان، وهي الجنة. والتنكير لإبهام أمرها وتفخيمه. والروضة عند العرب: كل أرض ذات نبات وماء. وفي أمثالهم: أحسن من بيضة في روضة، يريدون: بيضة النعامة يُحْبَرُونَ يسرون. يقال: حبره إذا سرّه سرورا تهلل له وجهه وظهر فيه أثره. ثم اختلفت فيه الأقاويل لاحتماله وجوه جميع المسارّ، فعن مجاهد رضى الله عنه:\n\nيكرمون. وعن قتادة: ينعمون. وعن ابن كيسان: يحلون. وعن أبى بكر بن عياش: التيجان على رءوسهم. وعن وكيع: السماع في الجنة. وعن النبىّ صلى الله عليه وسلم: أنه ذكر الجنة وما فيها من النعيم ، وفي آخر القوم أعرابىّ فقال: يا رسول الله، هل في الجنة من سماع؟\n\nقال: «نعم يا أعرابى، إنّ في الجنة لنهرا حافتاه الأبكار من كل بيضاء خوصانية، يتغنين بأصوات لم تسمع الخلائق بمثلها قط، فذلك أفضل نعيم الجنة» قال الراوي: فسألت أبا الدرداء، بم يتغنين؟ قال: بالتسبيح. وروى «إنّ في الجنة لأشجارا عليها أجراس من فضة» فإذا أراد أهل الجنة السماع بعث الله ريحا من تحت العرش فتقع في تلك الأشجار، فتحرّك تلك الأجراس بأصوات لو سمعها أهل الدنيا لماتوا طربا » مُحْضَرُونَ لا يغيبون عنه ولا يخفف عنهم، كقوله:\n\nوَما هُمْ بِخارِجِينَ مِنْها، لا يُفَتَّرُ عَنْهُمْ.","surah_id":30,"source_id":9},{"ayah_number":17,"ayah_text":"فَسُبْحانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ (17) وَلَهُ الْحَمْدُ فِي السَّماواتِ وَالْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ (18) يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَيُحْيِ الْأَرْضَ بَعْدَ مَوْتِها وَكَذلِكَ تُخْرَجُونَ (19)","text":"لما ذكر الوعد والوعيد، أتبعه ذكر ما يوصل إلى الوعد وينجى من الوعيد. والمراد بالتسبيح ظاهره الذي هو تنزيه الله من السوء والثناء عليه بالخير في هذه الأوقات لما يتجدّد فيها من نعمة الله الظاهرة. وقيل: الصلاة. وقيل لابن عباس رضى الله عنهما: هل تجد الصلوات الخمس في القرآن؟ قال: نعم، وتلا هذه الآية تُمْسُونَ صلاتا المغرب والعشاء تُصْبِحُونَ صلاة الفجر وَعَشِيًّا صلاة العصر. وتُظْهِرُونَ صلاة الظهر. وقوله وَعَشِيًّا متصل بقوله حِينَ تُمْسُونَ وقوله وَلَهُ الْحَمْدُ فِي السَّماواتِ وَالْأَرْضِ اعتراض بينهما. ومعناه: إنّ على المميزين كلهم من أهل السماوات والأرض أن يحمدوه. فإن قلت: لم ذهب الحسن رحمه الله إلى أنّ هذه الآية مدنية؟ قلت: لأنه كان يقول: فرضت الصلوات الخمس بالمدينة وكان الواجب بمكة ركعتين في غير وقت معلوم. والقول الأكثر أنّ الخمس إنما فرضت بمكة. وعن عائشة رضى الله عنها: فرضت الصلاة ركعتين فلما قدم رسول الله صلى الله عليه وسلم المدينة أقرّت صلاة السفر، وزيد في صلاة الحضر. وعن رسول الله صلى الله عليه وسلم «من سره أن يكال له بالقفيز الأوفى فليقل: فسبحان الله حين تمسون وحين تصبحون ... الآية » وعنه عليه السلام «من قال حين يصبح فَسُبْحانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ- إلى قوله- وَكَذلِكَ تُخْرَجُونَ أدرك ما فاته في يومه. ومن قالها حين يمسى أدرك ما فاته في ليلته » وفي قراءة عكرمة:\n\nحينا تمسون وحينا تصبحون. والمعنى: تمسون فيه وتصبحون فيه، كقوله يَوْماً لا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئاً بمعنى فيه الْحَيَّ مِنَ الْمَيِّتِ الطائر من البيضة، والْمَيِّتَ مِنَ الْحَيِ البيضة من الطائر. وإحياء الأرض: إخراج النبات منها وَكَذلِكَ تُخْرَجُونَ ومثل ذلك الإخراج تخرجون من القبور وتبعثون. والمعنى: أنّ الإبداء والإعادة متساويان في قدرة من هو قادر على الطرد والعكس من إخراج الميت من الحىّ وإخراج الحي من الميت وإحياء الميت وإماتة الحي. وقرئ: الميت، بالتشديد . وتخرجون، بفتح التاء.","surah_id":30,"source_id":9},{"ayah_number":20,"ayah_text":"وَمِنْ آياتِهِ أَنْ خَلَقَكُمْ مِنْ تُرابٍ ثُمَّ إِذا أَنْتُمْ بَشَرٌ تَنْتَشِرُونَ (20) وَمِنْ آياتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْواجاً لِتَسْكُنُوا إِلَيْها وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ (21)","text":"خَلَقَكُمْ مِنْ تُرابٍ لأنه خلق أصلهم منه. وإِذا للمفاجأة. وتقديره: ثم فاجأتم وقت كونكم بشرا منتشرين في الأرض، كقوله وَبَثَّ مِنْهُما رِجالًا كَثِيراً وَنِساءً. مِنْ أَنْفُسِكُمْ أَزْواجاً لأن حوّاء خلقت من ضلع آدم عليه السلام، والنساء بعدها خلقن من أصلاب الرجال. أو من شكل أنفسكم وجنسها، لا من جنس آخر، وذلك لما بين الاثنين من جنس واحد من الألف والسكون، وما بين الجنسين المختلفين من التنافر وَجَعَلَ بَيْنَكُمْ التوادّ والتراحم بعصمة الزواج، بعد أن لم تكن بينكم سابقة معرفة، ولا لقاء، ولا سبب يوجب التعاطف من قرابة أو رحم وعن الحسن رضى الله عنه: المودة كناية عن الجماع، والرحمة عن الولد، كما قال وَرَحْمَةً مِنَّا وقال: ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ. ويقال: سكن إليه، إذا مال إليه، كقولهم: انقطع إليه، واطمأن إليه- ومنه السكن. وهو الإلف المسكون إليه. فعل بمعنى مفعول. وقيل: إن المودة والرحمة من قبل الله وإن الفرك من قبل الشيطان .","surah_id":30,"source_id":9},{"ayah_number":22,"ayah_text":"وَمِنْ آياتِهِ خَلْقُ السَّماواتِ وَالْأَرْضِ وَاخْتِلافُ أَلْسِنَتِكُمْ وَأَلْوانِكُمْ إِنَّ فِي ذلِكَ لَآياتٍ لِلْعالِمِينَ (22)","text":"الألسنة: اللغات. أو أجناس النطق وأشكاله. خالف عزّ وعلا بين هذه الأشياء حتى لا تكاد تسمع منطقين متفقين في همس واحد، ولا جهارة، ولا حدّة، ولا رخاوة، ولا فصاحة، ولا لكنة، ولا نظم، ولا أسلوب، ولا غير ذلك من صفات النطق وأحواله، وكذلك الصور وتخطيطها، والألوان وتنويعها، ولاختلاف ذلك وقع التعارف، وإلا فلو اتفقت وتشاكلت وكانت ضربا واحدا لوقع التجاهل والالتباس، ولتعطلت مصالح كثيرة، وربما رأيت توأمين يشتبهان في الحلية، فيعروك الخطأ في التمييز بينهما، وتعرف حكمة الله في المخالفة بين الحلىّ وفي ذلك آية بينة حيث ولدوا من أب واحد، وفرّعوا من أصل فذ، وهم على الكثرة التي لا يعلمها إلا الله مختلفون متفاوتون. وقرئ: للعالمين بفتح اللام وكسرها، ويشهد للكسر قوله تعالى وَما يَعْقِلُها إِلَّا الْعالِمُونَ.","surah_id":30,"source_id":9},{"ayah_number":23,"ayah_text":"وَمِنْ آياتِهِ مَنامُكُمْ بِاللَّيْلِ وَالنَّهارِ وَابْتِغاؤُكُمْ مِنْ فَضْلِهِ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَسْمَعُونَ (23)","text":"هذا من باب اللفّ وترتيبه: ومن آياته منامكم وابتغاؤكم من فضله بالليل والنهار، إلا أنه فصل بين القرينين الأوّلين بالقرينين الآخرين. لأنهما زمانان. والزمان والواقع فيه كشيء واحد، مع إعانة اللفّ على الاتحاد. ويجوز أن يراد: منامكم في الزمانين، وابتغاءكم فيهما، والظاهر هو الأول لتكرّره في القرآن، وأسدّ المعاني ما دل عليه القرآن يسمعونه بالآذان الواعية.","surah_id":30,"source_id":9},{"ayah_number":24,"ayah_text":"وَمِنْ آياتِهِ يُرِيكُمُ الْبَرْقَ خَوْفاً وَطَمَعاً وَيُنَزِّلُ مِنَ السَّماءِ ماءً فَيُحْيِي بِهِ الْأَرْضَ بَعْدَ مَوْتِها إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ (24)","text":"في يُرِيكُمُ وجهان: إضماران، وإنزال الفعل منزلة المصدر، وبهما فسر المثل: تسمع بالمعيدي خير من أن تراه. وقول القائل:\n\nوقالوا ما تشاء فقلت ألهو ... إلى الإصباح آثر ذى أثير\n\nخَوْفاً من الصاعقة أو من الإخلاف وَطَمَعاً في الغيث. وقيل: خوفا للمسافر، وطمعا للحاضر، وهما منصوبان على المفعول له. فإن قلت: من حق المفعول له أن يكون فعلا لفاعل الفعل المعلل، والخوف والطمع ليسا كذلك. قلت: فيه وجهان، أحدهما: أن المفعولين فاعلون في المعنى، لأنهم راءون، فكأنه قيل: يجعلكم رائين البرق خوفا وطمعا. والثاني: أن يكون على تقدير حذف المضاف، أى: إرادة خوف وإرادة طمع ، فحذف المضاف وأقيم المضاف  إليه مقامه. ويجوز أن يكونا حالين، أى: خائفين وطامعين. وقرئ: ينزل بالتشديد .","surah_id":30,"source_id":9},{"ayah_number":25,"ayah_text":"وَمِنْ آياتِهِ أَنْ تَقُومَ السَّماءُ وَالْأَرْضُ بِأَمْرِهِ ثُمَّ إِذا دَعاكُمْ دَعْوَةً مِنَ الْأَرْضِ إِذا أَنْتُمْ تَخْرُجُونَ (25) وَلَهُ مَنْ فِي السَّماواتِ وَالْأَرْضِ كُلٌّ لَهُ قانِتُونَ (26)","text":"\nوَمِنْ آياتِهِ قيام السماوات والأرض واستمساكهما بغير عمد بِأَمْرِهِ أى بقوله:\n\nكونا قائمتين. والمراد بإقامته لهما: إرادته لكونهما على صفة القيام دون الزوال. وقوله إِذا دَعاكُمْ بمنزلة قوله: يريكم، في إيقاع الجملة موقع المفرد على المعنى، كأنه قال: ومن آياته قيام السماوات والأرض، ثم خروج الموتى من القبور إذا دعاهم دعوة واحدة: يا أهل القبور اخرجوا.\n\nوالمراد سرعة وجود ذلك من غير توقف ولا تلبث، كما يجيب الداعي المطاع مدعوّه، كما قال القائل:\n\nدعوت كليبا دعوة فكأنّما ... دعوت به ابن الطّود أو هو أسرع\n\nيريد بابن الطود: الصدى، أو الحجر إذا تدهدى، وإنما عطف هذا على قيام السماوات والأرض بثم، بيانا لعظم ما يكون من ذلك الأمر واقتداره على مثله، وهو أن يقول: يا أهل القبور، قوموا، فلا تبقى نسمة من الأوّلين والآخرين إلا قامت تنظر» كما قال تعالى ثُمَّ نُفِخَ فِيهِ أُخْرى فَإِذا هُمْ قِيامٌ يَنْظُرُونَ. قولك: دعوته من مكان كذا، كما يجوز أن يكون مكانك يجوز أن يكون مكان صاحبك، تقول: دعوت زيدا من أعلى الجبل فنزل علىّ، ودعوته من أسفل الوادي فطلع إلىّ. فإن قلت: بم تعلق مِنَ الْأَرْضِ أبالفعل أم بالمصدر؟ قلت: هيهات، إذا جاء نهر الله بطل نهر معقل. فإن قلت: ما الفرق بين إذا وإذا؟ قلت: الأولى للشرط، والثانية للمفاجأة، وهي تنوب مناب الفاء في جواب الشرط. وقرئ: تخرجون، بضم التاء وفتحها قانِتُونَ منقادون لوجود أفعاله فيهم لا يمتنعون عليه.","surah_id":30,"source_id":9},{"ayah_number":27,"ayah_text":"وَهُوَ الَّذِي يَبْدَؤُا الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ وَلَهُ الْمَثَلُ الْأَعْلى فِي السَّماواتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (27)","text":"\nوَهُوَ أَهْوَنُ عَلَيْهِ فيما يجب عندكم وينقاس على أصولكم ويقتضيه معقولكم، لأنّ من أعاد منكم صنعة شيء كانت أسهل عليه وأهون من إنشائها، وتعتذرون للصانع إذا خطئ في بعض ما ينشئه بقولكم: أوّل الغزو أخرق، وتسمون الماهر في صناعته معاودا، تعنون أنه عاودها كرّة بعد أخرى، حتى مرن عليها وهانت عليه. فإن قلت: لم ذكر الضمير في قوله وَهُوَ أَهْوَنُ عَلَيْهِ والمراد به الإعادة؟ قلت: معناه: وأن يعيده أهون عليه. فإن قلت: لم أخرت الصلة في قوله وَهُوَ أَهْوَنُ عَلَيْهِ وقدّمت في قوله هُوَ عَلَيَّ هَيِّنٌ ؟ قلت: هناك قصد الاختصاص وهو محزه، فقيل: هو علىّ هين، وإن كان مستصعبا عندكم أن يولد بين هم وعاقر، وأما هاهنا فلا معنى للاختصاص، كيف والأمر مبنى على ما يعقلون من أنّ الإعادة أسهل من الابتداء، فلو قدمت الصلة لتغير المعنى. فإن قلت: ما بال الإعادة استعظمت في قوله ثُمَّ إِذا دَعاكُمْ حتى كأنها فضلت على قيام السماوات والأرض بأمره ، ثم هوّنت بعد ذلك؟ قلت:\n\n الإعادة في نفسها عظيمة، ولكنها هوّنت بالقياس إلى الإنشاء. وقيل الضمير في عليه للخلق.\n\nومعناه: أنّ البعث أهون على الخلق من الإنشاء، لأن تكوينه في حدّ الاستحكام، والتمام أهون عليه وأقل تعبا وكبدا، من أن يتنقل في أحوال ويندرج فيها إلى أن يبلغ ذلك الحدّ. وقيل:\n\nالأهون بمعنى الهين. ووجه آخر: وهو أن الإنشاء من قبيل التفضل الذي يتخير فيه الفاعل بين أن يفعله وأن لا يفعله، والإعادة من قبيل الواجب الذي لا بدّ له من فعله، لأنها لجزاء الأعمال وجزاؤها واجب ، والأفعال: إما محال والمحال ممتنع أصلا خارج عن المقدور، وأما ما يصرف الحكيم عن فعله صارف وهو القبيح، وهو رديف المحال، لأنّ الصارف يمنع وجود الفعل كما تمنعه الإحالة. وإما تفضل والتفضل حالة بين بين، للفاعل أن يفعله وأن لا يفعله. وإما واجب لا بدّ من فعله، ولا سبيل إلى الإخلال به، فكان الواجب أبعد الأفعال من الامتناع وأقربها من الحصول. فلما كانت الإعادة من قبيل الواجب، كانت أبعد الأفعال من الامتناع.\n\nوإذا كانت أبعدها من الامتناع، كانت أدخلها في التأنى والتسهل، فكانت أهون منها . وإذا كانت أهون منها كانت أهون من الإنشاء وَلَهُ الْمَثَلُ الْأَعْلى أى الوصف الأعلى الذي ليس لغيره مثله قد عرف به. ووصف في السماوات والأرض على ألسنة الخلائق وألسنة الدلائل، وهو أنه القادر الذي لا يعجز عن شيء من إنشاء وإعادة وغيرهما من المقدورات، ويدل عليه قوله تعالى وَهُوَ الْعَزِيزُ الْحَكِيمُ أى القاهر لكل مقدور، الحكيم الذي يجرى كل فعل على قضايا حكمته وعلمه. وعن مجاهد: المثل الأعلى: قول لا إله إلا الله، ومعناه: وله الوصف الأعلى الذي هو الوصف بالوحدانية. ويعضده قوله تعالى ضَرَبَ لَكُمْ مَثَلًا مِنْ أَنْفُسِكُمْ وقال الزجاج: وله المثل الأعلى في السماوات والأرض، أى: قوله تعالى وَهُوَ أَهْوَنُ عَلَيْهِ قد ضربه لكم مثلا فيما يصعب ويسهل. يريد: التفسير الأوّل.","surah_id":30,"source_id":9},{"ayah_number":28,"ayah_text":"ضَرَبَ لَكُمْ مَثَلاً مِنْ أَنْفُسِكُمْ هَلْ لَكُمْ مِنْ ما مَلَكَتْ أَيْمانُكُمْ مِنْ شُرَكاءَ فِي ما رَزَقْناكُمْ فَأَنْتُمْ فِيهِ سَواءٌ تَخافُونَهُمْ كَخِيفَتِكُمْ أَنْفُسَكُمْ كَذلِكَ نُفَصِّلُ الْآياتِ لِقَوْمٍ يَعْقِلُونَ (28)","text":"\nفإن قلت: أى فرق بين الأولى والثانية والثالثة في قوله تعالى مِنْ أَنْفُسِكُمْ، مِمَّا مَلَكَتْ أَيْمانُكُمْ، مِنْ شُرَكاءَ؟ قلت: الأولى للابتداء، كأنه قال: أخذ مثلا وانتزعه من أقرب.\n\nشيء منكم وهي أنفسكم ولم يبعد، والثانية للتبعيض، والثالثة مزيدة لتأكيد الاستفهام الجاري مجرى النفي. ومعناه: هل ترضون لأنفسكم- وعبيدكم أمثالكم بشر كبشر وعبيد كعبيد- أن يشارككم بعضهم فِي ما رَزَقْناكُمْ من الأموال وغيرها تكونون أنتم وهم فيه على السواء، من غير تفصلة بين حرّ وعبد: تهابون أن تستبدوا بتصرف دونهم، وأن تفتاتوا بتدبير عليهم كما يهاب بعضكم بعضا من الأحرار، فإذا لم ترضوا بذلك لأنفسكم، فكيف ترضون لرب الأرباب ومالك الأحرار والعبيد أن تجعلوا بعض عبيده له شركاء؟ كَذلِكَ أى مثل هذا التفصيل نُفَصِّلُ الْآياتِ أى نبينها لأن التمثيل مما يكشف المعاني ويوضحها، لأنه بمنزلة التصوير والتشكيل لها.\n\nألا ترى كيف صوّر الشرك بالصورة المشوّهة؟","surah_id":30,"source_id":9},{"ayah_number":29,"ayah_text":"بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْواءَهُمْ بِغَيْرِ عِلْمٍ فَمَنْ يَهْدِي مَنْ أَضَلَّ اللَّهُ وَما لَهُمْ مِنْ ناصِرِينَ (29)","text":"الَّذِينَ ظَلَمُوا أى أشركوا، كقوله تعالى: إنّ الشرك لظلم عظيم بِغَيْرِ عِلْمٍ أى اتبعوا أهواءهم جاهلين، لأنّ العالم إذا ركب هواه ربما ردعه علمه وكفه. وأما الجاهل فيهيم على وجهه كالبهيمة لا يكفه شيء مَنْ أَضَلَّ اللَّهُ من خذله ولم يلطف به، لعلمه أنه ممن لا لطف له، فمن يقدر على هداية مثله. وقوله وَما لَهُمْ مِنْ ناصِرِينَ دليل على أن المراد بالإضلال الخذلان.","surah_id":30,"source_id":9},{"ayah_number":30,"ayah_text":"فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْها لا تَبْدِيلَ لِخَلْقِ اللَّهِ ذلِكَ الدِّينُ الْقَيِّمُ وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (30) مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلاةَ وَلا تَكُونُوا مِنَ الْمُشْرِكِينَ (31) مِنَ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكانُوا شِيَعاً كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ (32)","text":"فَأَقِمْ وَجْهَكَ لِلدِّينِ فقوّم وجهك له وعدّله، غير ملتفت عنه يمينا ولا شمالا، وهو تمثيل لإقباله على الدين، واستقامته عليه، وثباته، واهتمامه بأسبابه، فإنّ من اهتم بالشيء عقد عليه طرفه، وسدّد إليه نظره، وقوّم له وجهه، مقبلا به عليه. وحَنِيفاً حال من المأمور. أو من الدين فِطْرَتَ اللَّهِ أى الزموا فطرة الله. أو عليكم فطرة الله. وإنما أضمرته على خطاب الجماعة لقوله مُنِيبِينَ إِلَيْهِ ومنيبين: حال من الضمير في: الزموا. وقوله وَاتَّقُوهُ وَأَقِيمُوا ... وَلا تَكُونُوا معطوف على هذا المضمر. والفطرة: الخلقة. ألا ترى إلى قوله لا تَبْدِيلَ لِخَلْقِ اللَّهِ والمعنى: أنه خلقهم قابلين للتوحيد ودين الإسلام، غير نائين عنه ولا منكرين له، لكونه مجاوبا للعقل، مساوقا للنظر الصحيح، حتى لو تركوا لما اختاروا عليه دينا آخر، ومن غوى منهم فبإغواء شياطين الإنس والجن. ومنه قوله صلى الله عليه وسلم «كل عبادي خلقت حنفاء فاجتالتهم الشياطين عن دينهم وأمروهم أن يشركوا بى غيرى » وقوله عليه السلام: كل مولود يولد على الفطرة حتى يكون أبواه هما اللذان يهوّدانه وينصرانه» لا تَبْدِيلَ لِخَلْقِ اللَّهِ أى ما ينبغي أن تبدّل تلك الفطرة أو تغير. فإن قلت: لم وحد الخطاب أولا، ثم جمع؟ قلت: خوطب رسول الله صلى الله عليه وسلم أولا، وخطاب الرسول خطاب لأمته مع ما فيه من التعظيم للإمام، ثم جمع بعد ذلك للبيان والتلخيص مِنَ الَّذِينَ بدل من المشركين فَرَّقُوا دِينَهُمْ تركوا دين الإسلام. وقرئ: فرّقوا دينهم بالتشديد، أى: جعلوه أديانا مختلفة لاختلاف أهوائهم وَكانُوا شِيَعاً فرقا، كل واحدة تشايع إمامها الذي أضلها كُلُّ حِزْبٍ منهم فرح بمذهبه مسرور، يحسب باطله حقا- ويجوز أن يكون مِنَ الَّذِينَ منقطعا مما قبله، ومعناه: من المفارقين دينهم كل حزب فرحين بما لديهم، ولكنه رفع فرحون على الوصف لكل، كقوله:\n\nوكل خليل غير هاضم نفسه","surah_id":30,"source_id":9},{"ayah_number":33,"ayah_text":"وَإِذا مَسَّ النَّاسَ ضُرٌّ دَعَوْا رَبَّهُمْ مُنِيبِينَ إِلَيْهِ ثُمَّ إِذا أَذاقَهُمْ مِنْهُ رَحْمَةً إِذا فَرِيقٌ مِنْهُمْ بِرَبِّهِمْ يُشْرِكُونَ (33) لِيَكْفُرُوا بِما آتَيْناهُمْ فَتَمَتَّعُوا فَسَوْفَ تَعْلَمُونَ (34)","text":"الضر: الشدّة من هزال أو مرض أو قحط أو غير ذلك. والرحمة: الخلاص من الشدّة.\n\nواللام في لِيَكْفُرُوا مجاز مثلها في لِيَكُونَ لَهُمْ عَدُوًّا. فَتَمَتَّعُوا نظير اعْمَلُوا ما شِئْتُمْ فَسَوْفَ تَعْلَمُونَ وبال تمتعكم. وقرأ ابن مسعود: وليتمتعوا.","surah_id":30,"source_id":9},{"ayah_number":35,"ayah_text":"أَمْ أَنْزَلْنا عَلَيْهِمْ سُلْطاناً فَهُوَ يَتَكَلَّمُ بِما كانُوا بِهِ يُشْرِكُونَ (35)","text":"السلطان: الحجة، وتكلمه. مجاز، كما تقول: كتابه ناطق بكذا، وهذا مما نطق به القرآن.\n\nومعناه: الدلالة والشهادة، كأنه قال: فهو يشهد بشركهم وبصحته. وما في بِما كانُوا مصدرية أى: بكونهم بالله يشركون. ويجوز أن تكون موصولة ويرجع الضمير إليها. ومعناه: فهو يتكلم بالأمر الذي يسببه يشركون. ويحتمل أن يكون المعنى: أم أنزلنا عليهم ذا سلطان، أى:\n\nملكا معه برهان فذلك الملك يتكلم بالبرهان الذي بسببه يشركون.\n","surah_id":30,"source_id":9},{"ayah_number":36,"ayah_text":"وَإِذا أَذَقْنَا النَّاسَ رَحْمَةً فَرِحُوا بِها وَإِنْ تُصِبْهُمْ سَيِّئَةٌ بِما قَدَّمَتْ أَيْدِيهِمْ إِذا هُمْ يَقْنَطُونَ (36)","text":"وَإِذا أَذَقْنَا النَّاسَ رَحْمَةً أى نعمة من مطر أو سعة أو صحة فَرِحُوا بِها وَإِنْ تُصِبْهُمْ سَيِّئَةٌ أى بلاء من جدب أو ضيق أو مرض- والسبب فيها شؤم معاصيهم- قنطوا من الرحمة.","surah_id":30,"source_id":9},{"ayah_number":37,"ayah_text":"أَوَلَمْ يَرَوْا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشاءُ وَيَقْدِرُ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يُؤْمِنُونَ (37)","text":"ثم أنكر عليهم بأنهم قد علموا أنه هو الباسط القابض، فما لهم يقنطون من رحمته، وما لهم لا يرجعون إليه تائبين من المعاصي التي عوقبوا بالشدّة من أجلها، حتى يعيد إليهم رحمته.","surah_id":30,"source_id":9},{"ayah_number":38,"ayah_text":"فَآتِ ذَا الْقُرْبى حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ ذلِكَ خَيْرٌ لِلَّذِينَ يُرِيدُونَ وَجْهَ اللَّهِ وَأُولئِكَ هُمُ الْمُفْلِحُونَ (38)","text":"حق ذى القربى: صلة الرحم. وحق المسكين وابن السبيل: نصيبهما من الصدقة المسماة لهما. وقد احتج أبو حنيفة رحمه الله بهذه الآية في وجوب النفقة للمحارم إذا كانوا محتاجين عاجزين عن الكسب. وعند الشافعي رحمه الله: لا نفقة بالقرابة إلا على الولد والوالدين: قاس سائر القرابات على ابن العم، لأنه لا ولاد بينهم. فإن قلت: كيف تعلق قوله فَآتِ ذَا الْقُرْبى بما قبله حتى جيء بالفاء؟ قلت: لما ذكر أنّ السيئة أصابتهم بما قدّمت أيديهم، أتبعه ذكر ما يجب أن يفعل وما يجب أن يترك يُرِيدُونَ وَجْهَ اللَّهِ يحتمل أن يراد بوجهه ذاته أو جهته وجانبه، أى: يقصدون بمعروفهم إياه خالصا وحقه، كقوله تعالى إِلَّا ابْتِغاءَ وَجْهِ رَبِّهِ الْأَعْلى أو يقصدون جهة التقرّب إلى الله لا جهة أخرى، والمعنيان متقاربان، ولكن الطريقة مختلفة.","surah_id":30,"source_id":9},{"ayah_number":39,"ayah_text":"وَما آتَيْتُمْ مِنْ رِباً لِيَرْبُوَا فِي أَمْوالِ النَّاسِ فَلا يَرْبُوا عِنْدَ اللَّهِ وَما آتَيْتُمْ مِنْ زَكاةٍ تُرِيدُونَ وَجْهَ اللَّهِ فَأُولئِكَ هُمُ الْمُضْعِفُونَ (39)","text":"هذه الآية في معنى قوله تعالى يَمْحَقُ اللَّهُ الرِّبا وَيُرْبِي الصَّدَقاتِ سواء بسواء، يريد: وما أعطيتم أكلة الربا مِنْ رِباً لِيَرْبُوَا فِي أموالهم: ليزيد ويزكو في أموالهم، فلا يزكو عند الله ولا يبارك فيه وَما آتَيْتُمْ مِنْ زَكاةٍ أى صدقة تبتغون به وجهه خالصا، لا تطلبون به مكافأة ولا رياء وسمعة فَأُولئِكَ هُمُ الْمُضْعِفُونَ ذوو الإضعاف من الحسنات. ونظير المضعف:\n\nالمقوي والموسر، لذي القوّة واليسار: وقرئ بفتح العين. وقيل: نزلت في ثقيف، وكانوا يربون. وقيل: المراد أن يهب الرجل للرجل أو يهدى له، ليعوّضه أكثر مما وهب أو أهدى، فليست تلك الزيادة بحرام، ولكن المعوّض لا يثاب على تلك الزيادة. وقالوا: الربا ربوان:\n\nفالحرام: كل قرض يؤخذ فيه أكثر منه: أو يجرّ منفعة. والذي ليس بحرام: أن يستدعى بهبته أو بهديته أكثر منها. وفي الحديث «المستغزر يثاب من هبته» وقرئ: وما أتيتم من ربا، بمعنى: وما غشيتموه أو رهقتموه من إعطاء ربا. وقرئ: لتربوا، أى: لتزيدوا في أموالهم، كقوله تعالى وَيُرْبِي الصَّدَقاتِ أى يزيدها. وقوله تعالى فَأُولئِكَ هُمُ الْمُضْعِفُونَ التفات حسن، كأنه قال لملائكته وخواص خلقه: فأولئك الذين يريدون وجه الله بصدقاتهم: هم المضعفون. فهو أمدح لهم من أن يقول: فأنتم المضعفون. والمعنى: المضعفون به، لأنه لا بد من ضمير يرجع إلى ما، ووجه آخر: وهو أن يكون تقديره: فمؤتوه أولئك هم المضعفون.\n\nوالحذف لما في الكلام من الدليل عليه، وهذا أسهل مأخذا، والأوّل أملأ بالفائدة.","surah_id":30,"source_id":9},{"ayah_number":40,"ayah_text":"اللَّهُ الَّذِي خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ هَلْ مِنْ شُرَكائِكُمْ مَنْ يَفْعَلُ مِنْ ذلِكُمْ مِنْ شَيْءٍ سُبْحانَهُ وَتَعالى عَمَّا يُشْرِكُونَ (40)","text":"اللَّهُ مبتدأ وخبره الَّذِي خَلَقَكُمْ أى الله هو فاعل هذه الأفعال الخاصة التي لا يقدر على شيء منها أحد غيره، ثم قال هَلْ مِنْ شُرَكائِكُمْ الذين اتخذتموهم أندادا له من الأصنام وغيرها مَنْ يَفْعَلُ شيئا قط من تلك الأفعال، حتى يصح ما ذهبتم إليه، ثم استبعد حاله من حال شركائهم. ويجوز أن يكون الَّذِي خَلَقَكُمْ صفة للمبتدإ، والخبر: هل من شركائكم، وقوله مِنْ ذلِكُمْ هو الذي ربط الجملة بالمبتدإ، لأن معناه: من أفعاله. ومن الأولى والثانية والثالثة: كل واحدة منهنّ مستقلة بتأكيد، لتعجيز شركائهم، وتجهيل عبدتهم.","surah_id":30,"source_id":9},{"ayah_number":41,"ayah_text":"ظَهَرَ الْفَسادُ فِي الْبَرِّ وَالْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ (41)","text":"\nالْفَسادُ فِي الْبَرِّ وَالْبَحْرِ نحو: الجدب، والقحط، وقلة الريع في الزراعات والريح في التجارات، ووقوع الموتان في الناس والدواب، وكثرة الحرق والغرق، وإخفاق الصيادين والغاصة، ومحق البركات من كل شيء، وقلة المنافع في الجملة وكثرة المضارّ. وعن ابن عباس:\n\nأجدبت الأرض وانقطعت مادّة البحر. وقالوا: إذا انقطع القطر عميت دواب البحر. وعن الحسن أنّ المراد بالبحر: مدن البحر وقراه التي على شاطئه. وعن عكرمة: العرب تسمى الأمصار البحار. وقرئ في البر والبحور بِما كَسَبَتْ أَيْدِي النَّاسِ بسبب معاصيهم وذنوبهم، كقوله تعالى وَما أَصابَكُمْ مِنْ مُصِيبَةٍ فَبِما كَسَبَتْ أَيْدِيكُمْ وعن ابن عباس ظَهَرَ الْفَسادُ فِي الْبَرِّ بقتل ابن آدم أخاه. وفي البحر بأن جلندى كان يأخذ كل سفينة غصبا: وعن قتادة: كان ذلك قبل البعث، فلما بعث رسول الله صلى الله عليه وسلم رجع راجعون عن الضلال والظلم. ويجوز أن يريد ظهور الشر والمعاصي بكسب الناس ذلك. فإن قلت: ما معنى قوله لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ؟ قلت أمّا على التفسير الأول فظاهر، وهو أنّ الله قد أفسد أسباب دنياهم ومحقها، ليذيقهم وبال بعض أعمالهم في الدنيا قبل أن يعاقبهم بجميعها في الآخرة، لعلهم يرجعون عما هم عليه. وأمّا على الثاني فاللام مجاز، على معنى أنّ ظهور الشرور بسببهم مما استوجبوا به أن يذيقهم الله وبال أعمالهم إرادة الرجوع، فكأنهم إنما أفسدوا وتسببوا لفشوّ المعاصي في الأرض لأجل ذلك. وقرئ: لنذيقهم، بالنون.","surah_id":30,"source_id":9},{"ayah_number":42,"ayah_text":"قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كانَ عاقِبَةُ الَّذِينَ مِنْ قَبْلُ كانَ أَكْثَرُهُمْ مُشْرِكِينَ (42)","text":"ثم أكد تسبب المعاصي لغضب الله ونكاله: حيث أمرهم بأن يسيروا في الأرض فينظروا كيف أهلك الله الأمم وأذاقهم سوء العاقبة لمعاصيهم، ودل بقوله كانَ أَكْثَرُهُمْ مُشْرِكِينَ على أنّ الشرك وحده لم يكن سبب تدميرهم، وأنّ ما دونه من المعاصي يكون سببا لذلك.","surah_id":30,"source_id":9},{"ayah_number":43,"ayah_text":"فَأَقِمْ وَجْهَكَ لِلدِّينِ الْقَيِّمِ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لا مَرَدَّ لَهُ مِنَ اللَّهِ يَوْمَئِذٍ يَصَّدَّعُونَ (43)","text":"القيم: البليغ الاستقامة «الذي لا يتأتى فيه عوج مِنَ اللَّهِ إمّا أن يتعلق بيأتى، فيكون المعنى: من قبل أن يأتى من الله يوم لا يردّه أحد، كقوله تعالى فَلا يَسْتَطِيعُونَ رَدَّها أو بمردّ، على معنى: لا يردّه هو بعد أن يجيء به، ولا ردّ له من جهته. والمردّ: مصدر بمعنى الردّ يَصَّدَّعُونَ يتصدّعون: أى: يتفرّقون، كقوله تعالى: وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ.","surah_id":30,"source_id":9},{"ayah_number":44,"ayah_text":"مَنْ كَفَرَ فَعَلَيْهِ كُفْرُهُ وَمَنْ عَمِلَ صالِحاً فَلِأَنْفُسِهِمْ يَمْهَدُونَ (44) لِيَجْزِيَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ مِنْ فَضْلِهِ إِنَّهُ لا يُحِبُّ الْكافِرِينَ (45)","text":"فَعَلَيْهِ كُفْرُهُ كلمة جامعة لما لا غاية وراءه من المضارّ، لأنّ من كان ضاره كفره، فقد أحاطت به كلّ مضرّة فَلِأَنْفُسِهِمْ يَمْهَدُونَ أى يسؤون لأنفسهم ما يسوّيه لنفسه الذي يمهد فراشه ويوطئه، لئلا يصيبه في مضجعه ما ينبيه عليه وينغض عليه مرقده: من نتوء أو قضض أو بعض ما يؤذى الراقد. ويجوز أن يريد: فعلى أنفسهم يشفقون، من قولهم في المشفق: أمّ فرشت فأنامت. وتقديم الظرف في الموضعين للدلالة على أنّ ضرر الكفر لا يعود إلا على الكافر لا يتعدّاه. ومنفعة الإيمان والعمل الصالح: ترجع إلى المؤمن لا تتجاوزه لِيَجْزِيَ متعلق بيمهدون تعليل له مِنْ فَضْلِهِ مما يتفضل عليهم بعد توفية الواجب من الثواب، وهذا يشبه الكناية، لأن الفضل تبع للثواب، فلا يكون إلا بعد حصول ما هو تبع له: أو أراد من عطائه وهو ثوابه، لأن الفضول والفواضل هي الأعطية عند العرب. وتكرير الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ وترك الضمير إلى الصريح لتقرير أنه لا يفلح عنده إلا المؤمن الصالح. وقوله إِنَّهُ لا يُحِبُّ الْكافِرِينَ تقرير بعده تقرير، على الطرد والعكس.","surah_id":30,"source_id":9},{"ayah_number":46,"ayah_text":"وَمِنْ آياتِهِ أَنْ يُرْسِلَ الرِّياحَ مُبَشِّراتٍ وَلِيُذِيقَكُمْ مِنْ رَحْمَتِهِ وَلِتَجْرِيَ الْفُلْكُ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ (46)","text":"الرِّياحَ هي الجنوب والشمال والصبا، وهي رياح الرحمة. وأما الدبور، فريح العذاب.\n\nومنه قوله صلى الله عليه وسلم «اللهمّ اجعلها رياحا ولا تجعلها ريحا » وقد عدد الأغراض في إرسالها، وأنه أرسلها للبشارة بالغيث ولإذاقة الرحمة، وهي نزول المطر وحصول الخصب الذي يتبعه، والروح الذي مع هبوب الريح وزكاء الأرض. قال رسول الله صلى الله عليه وسلم «إذا كثرت المؤتفكات زكت الأرض » وإزالة العفونة من الهواء، وتذرية الحبوب، وغير ذلك وَلِتَجْرِيَ الْفُلْكُ في البحر عند هبوبها. وإنما زاد بِأَمْرِهِ لأن الريح قد تهب ولا تكون مؤاتية ، فلا بد من إرساء السفن والاحتيال لحبسها، وربما عصفت فأغرقتها وَلِتَبْتَغُوا مِنْ فَضْلِهِ يريد تجارة البحر، ولتشكروا نعمة الله فيها. فإن قلت: بم يتعلق وليذيقكم؟ قلت:\n\nفيه وجهان: أن يكون معطوفا على مبشرات على المعنى، كأنه قيل: ليبشركم وليذيقكم. وأن يتعلق بمحذوف تقديره: وليذيقكم، وليكون كذا وكذا: أرسلناها.","surah_id":30,"source_id":9},{"ayah_number":47,"ayah_text":"وَلَقَدْ أَرْسَلْنا مِنْ قَبْلِكَ رُسُلاً إِلى قَوْمِهِمْ فَجاؤُهُمْ بِالْبَيِّناتِ فَانْتَقَمْنا مِنَ الَّذِينَ أَجْرَمُوا وَكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ (47)","text":"اختصر الطريق إلى الغرض بأن أدرج تحت ذكر الانتصار والنصر ذكر الفريقين، وقد أخلى الكلام أوّلا عن ذكرهما. وقوله كانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ تعظيم للمؤمنين، ورفع من شأنهم، وتأهيل لكرامة سنية، وإظهار لفضل سابقة ومزية، حيث جعلهم مستحقين على الله أن ينصرهم، مستوجبين عليه أن يظهرهم ويظفرهم، وقد يوقف على قًّا . ومعناه:\n\nوكان الانتقام منهم حقا، ثم يبتدأ: لَيْنا نَصْرُ الْمُؤْمِنِينَ وعن النبىّ صلى الله عليه وسلم «ما من امرئ مسلم يردّ عن عرض أخيه إلا كان حقا على الله أن يردّ عنه نار جهنم يوم القيامة ». ثم تلا قوله تعالى كانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ.","surah_id":30,"source_id":9},{"ayah_number":48,"ayah_text":"اللَّهُ الَّذِي يُرْسِلُ الرِّياحَ فَتُثِيرُ سَحاباً فَيَبْسُطُهُ فِي السَّماءِ كَيْفَ يَشاءُ وَيَجْعَلُهُ كِسَفاً فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلالِهِ فَإِذا أَصابَ بِهِ مَنْ يَشاءُ مِنْ عِبادِهِ إِذا هُمْ يَسْتَبْشِرُونَ (48) وَإِنْ كانُوا مِنْ قَبْلِ أَنْ يُنَزَّلَ عَلَيْهِمْ مِنْ قَبْلِهِ لَمُبْلِسِينَ (49)","text":"فَيَبْسُطُهُ متصلا تارة وَيَجْعَلُهُ كِسَفاً أى قطعا تارة فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلالِهِ في التارتين جميعا. والمراد بالسماء. سمت السماء وشقها، كقوله تعالى وَفَرْعُها فِي السَّماءِ، وبإصابة العباد: إصابة بلادهم وأراضيهم مِنْ قَبْلِهِ من باب التكرير والتوكيد، كقوله تعالى فَكانَ عاقِبَتَهُما أَنَّهُما فِي النَّارِ خالِدَيْنِ فِيها. ومعنى التوكيد فيه: الدلالة على أن عهدهم بالمطر قد تطاول وبعد، فاستحكم بأسهم وتمادى إبلاسهم فكان الاستبشار على قدر اغتمامهم بذلك.","surah_id":30,"source_id":9},{"ayah_number":50,"ayah_text":"فَانْظُرْ إِلى آثارِ رَحْمَتِ اللَّهِ كَيْفَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِها إِنَّ ذلِكَ لَمُحْيِ الْمَوْتى وَهُوَ عَلى كُلِّ شَيْءٍ قَدِيرٌ (50)","text":"قرئ: أثر وآثار، على الوحدة والجمع. وقرأ أبو حيوة وغيره: كيف تحيى، أى: الرحمة إِنَّ ذلِكَ يعنى إنّ ذلك القادر الذي يحيى الأرض بعد موتها، هو الذي يحيى الناس بعد موتهم وَهُوَ عَلى كُلِّ شَيْءٍ من المقدورات قادر، وهذا من جملة المقدورات بدليل الإنشاء.","surah_id":30,"source_id":9},{"ayah_number":51,"ayah_text":"وَلَئِنْ أَرْسَلْنا رِيحاً فَرَأَوْهُ مُصْفَرًّا لَظَلُّوا مِنْ بَعْدِهِ يَكْفُرُونَ (51) فَإِنَّكَ لا تُسْمِعُ الْمَوْتى وَلا تُسْمِعُ الصُّمَّ الدُّعاءَ إِذا وَلَّوْا مُدْبِرِينَ (52) وَما أَنْتَ بِهادِ الْعُمْيِ عَنْ ضَلالَتِهِمْ إِنْ تُسْمِعُ إِلاَّ مَنْ يُؤْمِنُ بِآياتِنا فَهُمْ مُسْلِمُونَ (53)","text":"فَرَأَوْهُ فرأوا أثر رحمة الله. لأنّ رحمة الله هي الغيث، وأثرها: النبات. ومن قرأ بالجمع: رجع الضمير إلى معناه لأنّ معنى آثار الرحمة النبات، واسم النبات يقع على القليل والكثير، لأنه مصدر سمى به ما ينبت. ولئن: هي اللام الموطئة للقسم، دخلت على حرف الشرط، ولَظَلُّوا جواب القسم سدّ مسدّ الجوابين، أعنى: جواب القسم وجواب الشرط، ومعناه: ليظلنّ ذمّهم الله تعالى بأنه إذا حبس عنهم القطر قنطوا من رحمته وضربوا أذقانهم على صدورهم مبلسين، فإذا أصابهم برحمته ورزقهم المطر: استبشروا وابتهجوا، فإذا أرسل ريحا فضرب زروعهم بالصفار، ضجوا وكفروا بنعمة الله. فهم في جمع هذه الأحوال على الصفة المذمومة، كان عليهم أن يتوكلوا على الله وفضله، فقنطوا. وأن يشكروا نعمته ويحمدوه عليها، فلم يزيدوا على الفرح والاستبشار. وأن يصبروا على بلائه، فكفروا. والريح التي اصفرّ لها النبات: يجوز أن تكون حرورا وحرجفا، فكلتاهما مما يصوح له النبات ويصبح هشيما. وقال: مصفرّا: لأنّ تلك صفرة حادثة. وقيل: فرأوا السحاب مصفرا، لأنه إذا كان كذلك لم يمطر.","surah_id":30,"source_id":9},{"ayah_number":54,"ayah_text":"اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفاً وَشَيْبَةً يَخْلُقُ ما يَشاءُ وَهُوَ الْعَلِيمُ الْقَدِيرُ (54)","text":"قرئ: بفتح الضاد وضمها، وهما لغتان، والضم أقوى في القراءة، لما روى ابن عمر رضى الله عنهما: قال: قرأتها على رسول الله صلى الله عليه وسلم من ضعف، فأقرأنى من ضعف .\n\nقوله خَلَقَكُمْ مِنْ ضَعْفٍ كقوله خُلِقَ الْإِنْسانُ مِنْ عَجَلٍ يعنى أنّ أساس أمركم وما عليه؟؟؟ بلتكم وبنيتكم الضعف وَخُلِقَ الْإِنْسانُ ضَعِيفاً أى ابتدأناكم في أوّل الأمر ضعافا، وذلك حال الطفولة والنشء حتى بلغتم وقت الاحتلام والشبيبة، وتلك حال القوّة إلى الاكتهال وبلوغ الاشدّ، ثم رددتم إلى أصل حالكم وهو الضعف بالشيخوخة والهرم. وقيل: من ضعف من؟؟؟ النطف، كقوله تعالى مِنْ ماءٍ مَهِينٍ وهذا الترديد في الأحوال المختلفة، والتغيير من هيئة إلى؟؟؟ الهيئة وصفة إلى صفة: أظهر دليل وأعدل شاهد على الصانع العليم القادر.","surah_id":30,"source_id":9},{"ayah_number":55,"ayah_text":"وَيَوْمَ تَقُومُ السَّاعَةُ يُقْسِمُ الْمُجْرِمُونَ ما لَبِثُوا غَيْرَ ساعَةٍ كَذلِكَ كانُوا يُؤْفَكُونَ (55)","text":"السَّاعَةُ القيامة، سميت بذلك لأنها تقوم في آخر ساعة من ساعات الدنيا. أو لأنها تقع؟؟؟ بغتة وبديهة. كما تقول: «في ساعة» لمن تستعجله، وجرت علما لها كالنجم للثريا، والكوكب للزهرة. وأرادوا: لبثهم في الدنيا، أو في القبور، أو فيما بين فناء الدنيا إلى البعث. وفي الحديث: «ما بين فناء الدنيا إلى وقت البعث أربعون» قالوا: لا نعلم أهى أربعون سنة أم أربعون ألف سنة؟ وذلك وقت يفنون فيه وينقطع عذابهم، وإنما يقدّرون وقت لبثهم بذلك على وجه استقصارهم له. أو ينسون أو يكذبون أو يخمنون كَذلِكَ كانُوا يُؤْفَكُونَ أى مثل ذلك الصرف كانوا يصرفون عن الصدق والتحقيق في الدنيا، وهكذا كانوا يبنون أمرهم على خلاف الحق. أو مثل ذلك الإفك كانوا يؤفكون في الاغترار بما تبين لهم الآن أنه ما كان إلا ساعة.","surah_id":30,"source_id":9},{"ayah_number":56,"ayah_text":"وَقالَ الَّذِينَ أُوتُوا الْعِلْمَ وَالْإِيمانَ لَقَدْ لَبِثْتُمْ فِي كِتابِ اللَّهِ إِلى يَوْمِ الْبَعْثِ فَهذا يَوْمُ الْبَعْثِ وَلكِنَّكُمْ كُنْتُمْ لا تَعْلَمُونَ (56) فَيَوْمَئِذٍ لا يَنْفَعُ الَّذِينَ ظَلَمُوا مَعْذِرَتُهُمْ وَلا هُمْ يُسْتَعْتَبُونَ (57)","text":"القائلون: هم الملائكة، والأنبياء، والمؤمنون فِي كِتابِ اللَّهِ في اللوح. أو في علم الله وقضائه. أو فيما كتبه، أى: أوجبه بحكمته. ردّوا ما قالوه وحلفوا عليه، وأطلعوهم على الحقيقة تم وصلوا ذلك بتقريعهم على إنكار البعث بقولهم فَهذا يَوْمُ الْبَعْثِ وَلكِنَّكُمْ كُنْتُمْ لا تَعْلَمُونَ أنه حق لتفريطكم في طلب الحق واتباعه. فإن قلت: ما هذه الفاء؟ وما حقيقتها؟ قلت: هي التي في قوله:\n\nفقد جئنا خراسانا\n\nوحقيقتها: أنها جواب شرط يدل عليه الكلام، كأنه قال: إن صح ما قلتم من أن خراسان أقصى ما يراد بنا فقد جئنا خراسان، وآن لنا أن نخلص، وكذلك إن كنتم منكرين البعث فهذا يوم البعث، أى فقد تبين بطلان قولكم. وقرأ الحسن يوم البعث، بالتحريك لا يَنْفَعُ قرئ بالياء والتاء يُسْتَعْتَبُونَ من قولك: استعتبني فلان فأعتبته. أى: استرضانى فأرضيته، وذلك إذا كنت جانيا عليه. وحقيقة أعتبته: أزلت عتبه. ألا ترى إلى قوله:\n\nغضبت تميم أن تقتّل عامر ... يوم النّسار فأعتبوا بالصّيلم\n\n كيف جعلهم غضابا، ثم قال: فأعتبوا، أى: أزيل غضبهم. والغضب في معنى العتب. والمعنى:\n\nلا يقال لهم أرضوا ربكم بتوبة وطاعة، ومثله قوله تعالى لا يُخْرَجُونَ مِنْها، وَلا هُمْ يُسْتَعْتَبُونَ.\n\nفإن قلت: كيف جعلوا غير مستعتبين في بعض الآيات، وغير معتبين في بعضها، وهو قوله وَإِنْ يَسْتَعْتِبُوا فَما هُمْ مِنَ الْمُعْتَبِينَ؟ قلت: أما كونهم غير مستعتبين: فهذا معناه. وأما كونهم غير معتبين، فمعناه: أنهم غير راضين بما هم فيه، فشبهت حالهم بحال قوم جنى عليهم، فهم عاتبون على الجاني غير راضين عنه، فإن يستعتبوا الله: أى يسألوه إزالة ما هم فيه، فما هم من المجابين إلى إزالته.","surah_id":30,"source_id":9},{"ayah_number":58,"ayah_text":"وَلَقَدْ ضَرَبْنا لِلنَّاسِ فِي هذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ وَلَئِنْ جِئْتَهُمْ بِآيَةٍ لَيَقُولَنَّ الَّذِينَ كَفَرُوا إِنْ أَنْتُمْ إِلاَّ مُبْطِلُونَ (58) كَذلِكَ يَطْبَعُ اللَّهُ عَلى قُلُوبِ الَّذِينَ لا يَعْلَمُونَ (59) فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَلا يَسْتَخِفَّنَّكَ الَّذِينَ لا يُوقِنُونَ (60)","text":"وَلَقَدْ وصفنا لهم كل صفة كأنها مثل في غرابتها، وقصصنا عليهم كل قصة عجيبة الشأن، كصفة المبعوثين يوم القيامة، وقصتهم، وما يقولون وما يقال لهم، وما لا ينفع من اعتذارهم ولا يسمع من استعتابهم، ولكنهم- لقسوة قلوبهم ومج أسماعهم حديث الآخرة- إذا جئتهم بآية من آيات القرآن، قالوا: جئتنا بزور وباطل، ثم قال: مثل ذلك الطبع يطبع الله على قلوب الجهلة. ومعنى طبع الله: منع الألطاف التي ينشرح لها الصدور حتى تقبل الحق، وإنما يمنعها من علم أنها لا تجدى عليه ولا تغنى عنه، كما يمنع الواعظ الموعظة من يتبين له أنّ الموعظة تلغو ولا تنجع فيه، فوقع ذلك كناية عن قسوة قلوبهم وركوب الصدإ والرين إياها، فكأنه قال: كذلك تقسو وتصدأ قلوب الجهلة، حتى يسموا المحقين مبطلين، وهم أعرق خلق الله في تلك الصفة فَاصْبِرْ على عداوتهم إِنَّ وَعْدَ اللَّهِ بنصرتك وإظهار دينك على الدين كله حَقٌّ لا بدّ من إنجازه والوفاء به، ولا يحملنك على الخفة والقلق جزعا مما يقولون ويفعلون فإنهم قوم شاكون ضالون لا يستبدع منهم ذلك. وقرئ بتخفيف النون. وقرأ ابن أبى إسحاق ويعقوب: ولا يستحقنك، أى: لا يفتننك فيملكوك ويكونوا أحق بك من المؤمنين.\n\nعن رسول الله صلى الله عليه وسلم «من قرأ سورة الروم كان له من الأجر عشر حسنات بعدد كل ملك سبح الله بين السماء والأرض وأدرك ما ضيع في يومه وليلته».","surah_id":30,"source_id":9}]