[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية [إلا آية 32 فمدنية] وآياتها 62 وقيل 61 آية [نزلت بعد الإخلاص] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":53,"source_id":9},{"ayah_number":1,"ayah_text":"وَالنَّجْمِ إِذا هَوى (1) ما ضَلَّ صاحِبُكُمْ وَما غَوى (2) وَما يَنْطِقُ عَنِ الْهَوى (3) إِنْ هُوَ إِلاَّ وَحْيٌ يُوحى (4) عَلَّمَهُ شَدِيدُ الْقُوى (5) ذُو مِرَّةٍ فَاسْتَوى (6) وَهُوَ بِالْأُفُقِ الْأَعْلى (7) ثُمَّ دَنا فَتَدَلَّى (8) فَكانَ قابَ قَوْسَيْنِ أَوْ أَدْنى (9) فَأَوْحى إِلى عَبْدِهِ ما أَوْحى (10) ما كَذَبَ الْفُؤادُ ما رَأى (11) أَفَتُمارُونَهُ عَلى ما يَرى (12) وَلَقَدْ رَآهُ نَزْلَةً أُخْرى (13) عِنْدَ سِدْرَةِ الْمُنْتَهى (14) عِنْدَها جَنَّةُ الْمَأْوى (15) إِذْ يَغْشَى السِّدْرَةَ ما يَغْشى (16) ما زاغَ الْبَصَرُ وَما طَغى (17) لَقَدْ رَأى مِنْ آياتِ رَبِّهِ الْكُبْرى (18)","text":"النجم: الثريا، وهو اسم غالب لها. قال:\n\nإذا طلع النّجم عشاء ... ابتغى الرّاعى كساء\n\n أو جنس النجوم. قال:\n\nفباتت تعد النّجم ... في مستحيرة\n\nيريد النجوم إِذا هَوى إذا غرب أو انتثر يوم القيامة. أو النجم الذي يرجم به إذا هوى:\n\nإذا انقض. أو النجم من نجوم القرآن، وقد نزل منجما في عشرين سنة، إذا هوى: إذا نزل.\n\nأو النبات إذا هوى: إذا سقط على الأرض. وعن عروة بن الزبير أنّ عتبة بن أبى لهب وكانت تحته بنت رسول الله صلى الله عليه وسلم أراد الخروج إلى الشام، فقال: لآتين محمدا فلأوذينه، فأتاه فقال: يا محمد، هو كافر بالنجم إذا هوى، وبالذي دنا فتدلى، ثم تفل في وجه رسول الله صلى الله عليه وسلم وردّ عليه ابنته وطلقها، فقال رسول الله صلى الله عليه وسلم: اللهم سلط عليه كلبا من كلابك، وكان أبو طالب حاضرا، فوجم لها وقال: ما كان أغناك يا ابن أخى عن هذه الدعوة! فرجع عتبة إلى أبيه فأخبره، ثم خرجوا إلى الشام فنزلوا منزلا، فأشرف عليهم راهب من الدير فقال لهم: إن هذه أرض مسبعة، فقال أبو لهب لأصحابه: أغيثونا يا معشر\n\n قريش هذه الليلة، فإنى أخاف على ابني دعوة محمد، فجمعوا جمالهم وأناخوها حولهم، وأحدقوا بعتبة، فجاء الأسد يتشمم وجوههم، حتى ضرب عتبة فقتله . وقال حسان:\n\nمن يرجع العام إلى أهله ... فما أكيل السّبع بالرّاجع\n\nما ضَلَّ صاحِبُكُمْ يعنى محمدا صلى الله عليه وسلم: والخطاب لقريش، وهو جواب القسم، والضلال: نقيض الهدى، والغى نقيض الرشد، أى: هو مهتد راشد وليس كما تزعمون من نسبتكم إياه إلى الضلال والغى، وما أتاكم به من القرآن ليس بمنطق يصدر عن هواه ورأيه، وإنما هو وحى من عند الله يوحى إليه. ويحتج بهذه الآية من لا يرى الاجتهاد للأنبياء، ويجاب بأنّ الله تعالى إذا سوّغ لهم الاجتهاد، كان الاجتهاد وما يستند إليه كله وحيا لا نطقا عن الهوى شَدِيدُ الْقُوى ملك شديد قواه، والإضافة غير حقيقية، لأنها إضافة الصفة المشبهة إلى فاعلها، وهو جبريل عليه السلام، ومن قوّته أنه اقتلع قرى قوم لوط من الماء الأسود، وحملها على جناحه، ورفعها إلى السماء ثم قلبها، وصاح صيحة بثمود فأصبحوا جاثمين، وكان هبوطه على الأنبياء وصعوده في أوحى من رجعة الطرف ، ورأى إبليس يكلم عيسى عليه السلام على بعض عقاب الأرض المقدّسة، فنفحه بجناحه نفحة فألقاه في أقصى جبل بالهند ذُو مِرَّةٍ ذو حصافة في عقله ورأيه ومتانة في دينه فَاسْتَوى فاستقام على صورة نفسه الحقيقية دون الصورة التي كان يتمثل بها كلما هبط بالوحي، وكان ينزل في صورة دحية، وذلك أنّ رسول الله صلى الله عليه وسلم أحب أن يراه في صورته التي جبل عليها، فاستوى له في الأفق الأعلى وهو أفق الشمس فملأ الأفق . وقيل: ما رآه أحد من الأنبياء في صورته الحقيقية غير محمد صلى الله عليه وسلم مرتين: مرة في الأرض، ومرة في السماء ثُمَّ دَنا من رسول الله صلى الله عليه وسلم فَتَدَلَّى فتعلق عليه في الهواء. ومنه: تدلت الثمرة، ودلى رجليه من السرير.\n\nوالدوالي: الثمر المعلق. قال:\n\nتدلّى عليها بين سب وخيطة\n\nويقال: هو مثل القرلى: إن رأى خيرا تدلى، وإن لم يره تولى قابَ قَوْسَيْنِ مقدار قوسين عربيتين: والقاب والقيب، والقاد والقيد، والقيس: المقدار. وقرأ زيد بن على: قاد. وقرئ:\n\nقيد، وقدر. وقد جاء التقدير بالقوس والرمح، والسوط، والذراع، والباع، والخطوة، والشبر، والفتر، والأصبع. ومنه «لا صلاة إلى أن ترتفع الشمس مقدار رمحين» . وفي الحديث «لقاب قوس أحدكم من الجنة وموضع قدّه خير من الدنيا وما فيها » والقدّ: السوط.\n\nويقال: بينهما خطوات يسيرة. وقال: وقد جعلتني من حزيمة أصبعا\n\nفإن قلت: كيف تقدير قوله فَكانَ قابَ قَوْسَيْنِ؟ قلت: تقديره فكان مقدار مسافة قربه مثل قاب قوسين ، فحذفت هذه المضافات كما قال أبو على في قوله:\n\nوقد جعلتني من حزيمة أصبعا\n\nأى: ذا مقدار مسافة أصبع أَوْ أَدْنى أى على تقديركم، كقوله تعالى أَوْ يَزِيدُونَ. إِلى عَبْدِهِ إلى عبد الله، وإن لم يجر لاسمه عزّ وجل ذكر، لأنه لا يلبس، كقوله عَلى ظَهْرِها. ما أَوْحى تفخيم للوحى الذي أوحى إليه: قيل أوحى إليه «إنّ الجنة محرّمة على الأنبياء حتى تدخلها وعلى الأمم حتى تدخلها أمتك» ما كَذَبَ فؤاد محمد صلى الله عليه وسلم ما رآه ببصره من صورة جبريل عليه السلام، أى: ما قال فؤاده لما رآه: لم أعرفك، ولو قال ذلك لكان كاذبا، لأنه عرفه، يعنى: أنه رآه بعينه وعرفه بقلبه، ولم يشك في أنّ ما رآه حق وقرئ: ما كذب، أى صدقه ولم يشك أنه جبريل عليه السلام بصورته أَفَتُمارُونَهُ من المراء وهو الملاحاة والمجادلة واشتقاقه من مرى الناقة، كأن كل واحد من المتجادلين يمرى ما عند صاحبه. وقرئ: أفتمرونه: أفتغلبونه في المراء، من ماريته فمريته، ولما فيه من معنى الغلبة عدّى بعلى، كما تقول: غلبته على كذا: وقيل: أفتمرونه: أفتجحدونه. وأنشدوا:\n\nلئن هجوت أخا صدق ومكرمة ... لقد مريت أخا ما كان يمريكا\n\n وقالوا: يقال مريته حقه إذا جحدته، وتعديته بعلى لا تصح إلا على مذهب التضمين نَزْلَةً أُخْرى مرة أخرى من النزول، نصبت النزلة نصب الظرف الذي هو مرة، لأنّ الفعلة اسم للمرّة من الفعل، فكانت في حكمها، أى: نزل عليه جبريل عليه السلام نزلة أخرى في صورة نفسه، فرآه عليها، وذلك ليلة المعراج. قيل في سدرة المنتهى: هي شجرة نبق في السماء السابعة عن يمين العرش: ثمرها كقلال هجر، وورقها كآذان الفيول، تنبع من أصلها الأنهار التي ذكرها الله في كتابه، يسير الراكب في ظلها سبعين عاما لا يقطعها.\n\nوالمنتهى: بمعنى موضع الانتهاء، أو الانتهاء، كأنها في منتهى الجنة وآخرها. وقيل: لم يجاوزها أحد، وإليها ينتهى علم الملائكة وغيرهم، ولا يعلم أحد ما وراءها. وقيل: تنتهي إليها أرواح الشهداء جَنَّةُ الْمَأْوى الجنة التي يصير إليها المتقون: عن الحسن. وقيل: تأوى إليها أرواح الشهداء.\n\nوقرأ على وابن الزبير وجماعة: جنة المأوى، أى ستره بظلاله ودخل فيه. وعن عائشة: أنها أنكرته وقالت: من قرأ به فأجنه الله ما يَغْشى تعظيم وتكثير لما يغشاها، فقد علم بهذه العبارة أن ما يغشاها من الخلائق الدالة على عظمة الله وجلاله: أشياء لا يكتنهها النعت ولا يحيط بها الوصف. وقد قيل: يغشاها الجم الغفير من الملائكة يعبدون الله عندها. وعن رسول الله صلى الله عليه وسلم: «رأيت على كل ورقة من ورقها ملكا قائما يسبح الله» . وعنه عليه السلام: يغشاها رفرف من طير خضر . وعن ابن مسعود وغيره: يغشاها فراش من ذهب ما زاغَ بصر رسول الله صلى الله عليه وسلم وَما طَغى أى أثبت ما رآه إثباتا مستيقنا صحيحا، من غير أن يزيغ بصره عنه أو يتجاوزه، أو ما عدل عن رؤية العجائب التي أمر برؤيتها ومكن منها، وما طغى: وما جاوز ما أمر برؤيته لَقَدْ رَأى والله لقد رأى مِنْ آياتِ رَبِّهِ الآيات التي هي كبراها وعظماها ، يعنى: حين رقى ربه إلى السماء فأرى عجائب الملكوت.","surah_id":53,"source_id":9},{"ayah_number":19,"ayah_text":"أَفَرَأَيْتُمُ اللاَّتَ وَالْعُزَّى (19) وَمَناةَ الثَّالِثَةَ الْأُخْرى (20) أَلَكُمُ الذَّكَرُ وَلَهُ الْأُنْثى (21) تِلْكَ إِذاً قِسْمَةٌ ضِيزى (22) إِنْ هِيَ إِلاَّ أَسْماءٌ سَمَّيْتُمُوها أَنْتُمْ وَآباؤُكُمْ ما أَنْزَلَ اللَّهُ بِها مِنْ سُلْطانٍ إِنْ يَتَّبِعُونَ إِلاَّ الظَّنَّ وَما تَهْوَى الْأَنْفُسُ وَلَقَدْ جاءَهُمْ مِنْ رَبِّهِمُ الْهُدى (23)","text":"اللَّاتَ وَالْعُزَّى وَمَناةَ أصنام كانت لهم، وهي مؤنثات، فاللات كانت لثقيف بالطائف.\n\nوقيل: كانت بنخلة تعبدها قريش، وهي فعلة من لوى، لأنهم كانوا يلوون عليها ويعكفون للعبادة. أو يلتوون عليها : أى يطوفون. وقرئ: اللات، بالتشديد. وزعموا أنه سمى برجل كان يلت عنده السمن بالزيت ويطعمه الحاج. وعن مجاهد: كان رجل يلت السويق بالطائف، وكانوا يعكفون على قبره، فجعلوه وثنا، والعزى كانت لغطفان وهي سمرة، وأصلها تأنيث الأعز، وبعث إليها رسول الله صلى الله عليه وسلم خالد بن الوليد فقطعها، فخرجت منها شيطانة ناشرة شعرها داعية ويلها، واضعة يدها على رأسها، فجعل يضربها بالسيف حتى قتلها وهو يقول:\n\nيا عزّ كفرانك لا سبحانك ... إنى رأيت الله قد أهانك ورجع فأخبر رسول الله صلى الله عليه وسلم فقال عليه السلام تلك العزى ولن تعبد أبدا . ومناة: صخرة كانت لهذيل وخزاعة. وعن ابن عباس رضى الله عنهما: لثقيف. وقرئ:\n\nومناءة، وكأنها سميت مناة لأنّ دماء النسائك كانت تمنى عندها، أى: تراق، ومناءة مفعلة من النوء، كأنهم كانوا يستمطرون عندها الأنواء تبركا بها. والأخرى ذمّ، وهي المتأخرة الوضيعة المقدار، كقوله تعالى قالَتْ أُخْراهُمْ لِأُولاهُمْ أى وضعاؤهم لرؤسائهم وأشرافهم.\n\nويجوز أن تكون الأوّلية والتقدّم عندهم للات والعزى. كانوا يقولون إنّ الملائكة وهذه الأصنام بنات الله، وكانوا يعبدونهم ويزعمون أنهم شفعاؤهم عند الله تعالى مع وأدهم البنات، فقيل لهم أَلَكُمُ الذَّكَرُ وَلَهُ الْأُنْثى ويجوز أن يراد: أنّ اللات والعزى ومناة إناث، وقد جعلتموهنّ لله شركاء، ومن شأنكم أن تحتقروا الإناث وتستنكفوا من أن يولدن لكم وينسبن إليكم، فكيف تجعلون هؤلاء الإناث أندادا لله وتسمونهنّ آلهة قِسْمَةٌ ضِيزى جائرة، من ضازه يضيزه إذا ضامه، والأصل: ضوزى . ففعل بها ما فعل ببيض، لتسلم الياء. وقرئ: ضئزى، من ضأزه بالهمز. وضيز: بفتح الضاد هِيَ ضمير الأصنام، أى ما هي إِلَّا أَسْماءٌ ليس تحتها في الحقيقة مسميات، لأنكم تدعون الإلهية لما هو أبعد شيء منها وأشدّه منافاة لها. ونحوه قوله تعالى ما تَعْبُدُونَ مِنْ دُونِهِ إِلَّا أَسْماءً سَمَّيْتُمُوها أو ضمير الأسماء وهي قولهم، اللات والعزى ومناة، وهم يقصدون بهذه الأسماء الآلهة، يعنى: ما هذه الأسماء إلا أسماء سميتموها بهواكم وشهوتكم، ليس لكم من الله على صحة تسميتها برهان تتعلقون به. ومعنى سَمَّيْتُمُوها سميتم بها، يقال: سميته زيدا، وسميته بزيد إِنْ يَتَّبِعُونَ وقرئ بالتاء إِلَّا الظَّنَّ إلا توهم أنّ ما هم عليه حق، وأنّ آلهتهم شفعاؤهم، وما تشتهيه أنفسهم، ويتركون ما جاءهم من الهدى والدليل على أنّ دينهم باطل.","surah_id":53,"source_id":9},{"ayah_number":24,"ayah_text":"أَمْ لِلْإِنْسانِ ما تَمَنَّى (24) فَلِلَّهِ الْآخِرَةُ وَالْأُولى (25)","text":"أَمْ لِلْإِنْسانِ ما تَمَنَّى هي أم المنقطعة ومعنى الهمزة فيها لإنكار، أى: ليس للإنسان ما تمنى، والمراد طمعهم في شفاعة الآلهة، وهو تمنّ على الله في غاية البعد، وقيل: هو قولهم:\n\nوَلَئِنْ رُجِعْتُ إِلى رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنى وقيل: هو قول الوليد بن المغيرة «لأوتين مالا وولدا» وقيل هو تمنى بعضهم أن يكون هو النبي صلى الله عليه وسلم فلله الآخرة والأولى أى هو مالكهما.\n\nفهو يعطى منهما من يشاء ويمنع من يشاء، وليس لأحد أن يتحكم عليه في شيء منهما.","surah_id":53,"source_id":9},{"ayah_number":26,"ayah_text":"وَكَمْ مِنْ مَلَكٍ فِي السَّماواتِ لا تُغْنِي شَفاعَتُهُمْ شَيْئاً إِلاَّ مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشاءُ وَيَرْضى (26)","text":"يعنى: أنّ أمر الشفاعة ضيق وذلك أنّ الملائكة مع قربتهم وزلفاهم وكثرتهم واغتصاص السماوات بجموعهم لو شفعوا بأجمعهم لأحد لم تغن شفاعتهم عنه شيئا قط ولم تنفع، إلا إذا شفعوا من بعد أن بأذن الله لهم في الشفاعة لمن يشاء الشفاعة له ويرضاه ويراه أهلا لأن يشفع له، فكيف تشفع الأصنام إليه بعبدتهم.","surah_id":53,"source_id":9},{"ayah_number":27,"ayah_text":"إِنَّ الَّذِينَ لا يُؤْمِنُونَ بِالْآخِرَةِ لَيُسَمُّونَ الْمَلائِكَةَ تَسْمِيَةَ الْأُنْثى (27) وَما لَهُمْ بِهِ مِنْ عِلْمٍ إِنْ يَتَّبِعُونَ إِلاَّ الظَّنَّ وَإِنَّ الظَّنَّ لا يُغْنِي مِنَ الْحَقِّ شَيْئاً (28) فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنا وَلَمْ يُرِدْ إِلاَّ الْحَياةَ الدُّنْيا (29) ذلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدى (30)","text":"لَيُسَمُّونَ الْمَلائِكَةَ أى كل واحد متهم تَسْمِيَةَ الْأُنْثى لأنهم إذا قالوا: الملائكة بنات الله، فقد سموا كل واحد منهم بنتا وهي تسمية الأنثى بِهِ مِنْ عِلْمٍ أى بذلك وبما يقولون .\n\nوفي قراءة أبىّ: بها، أى: بالملائكة. أو التسمية لا يُغْنِي مِنَ الْحَقِّ شَيْئاً يعنى إنما يدرك الحق الذي هو حقيقة الشيء وما هو عليه بالعلم والتيقن لا بالظنّ والتوهم فَأَعْرِضْ عن دعوة من رأيته معرضا عن ذكر الله عن الآخرة ولم يرد إلا الدنيا، ولا تتهالك على إسلامه، ثم قال إِنَّ رَبَّكَ هُوَ أَعْلَمُ أى إنما يعلم الله من يجيب ممن لا يجيب، وأنت لا تعلم، فخفض على نفسك ولا تتعنها، فإنك لا تهدى من أحببت، وما عليك إلا البلاغ. وقوله تعالى ذلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ اعتراض أو فأعرض عنه ولا تقابله، إنّ ربك هو أعلم بالضال والمهتدى، وهو مجازيهما بما يستحقان من الجزاء.","surah_id":53,"source_id":9},{"ayah_number":31,"ayah_text":"وَلِلَّهِ ما فِي السَّماواتِ وَما فِي الْأَرْضِ لِيَجْزِيَ الَّذِينَ أَساؤُا بِما عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى (31) الَّذِينَ يَجْتَنِبُونَ كَبائِرَ الْإِثْمِ وَالْفَواحِشَ إِلاَّ اللَّمَمَ إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ هُوَ أَعْلَمُ بِكُمْ إِذْ أَنْشَأَكُمْ مِنَ الْأَرْضِ وَإِذْ أَنْتُمْ أَجِنَّةٌ فِي بُطُونِ أُمَّهاتِكُمْ فَلا تُزَكُّوا أَنْفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقى (32)","text":"قرئ: ليجزي. ويجزى، بالياء والنون فيهما. ومعناه: أنّ الله عز وجل إنما خلق العالم وسوّى هذه الملكوت لهذا الغرض: وهو أن يجازى المحسن من المكلفين والمسيء منهم.\n\nويجوز أن يتعلق بقوله هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدى لأنّ نتيجة العلم بالضال والمهتدى جزاؤهما بِما عَمِلُوا بعقاب ما عملوا من السوء. وبِالْحُسْنَى بالمثوبة الحسنى وهي الجنة. أو بسبب ما عملوا من السوء وبسبب الأعمال الحسنى كَبائِرَ الْإِثْمِ أى الكبائر من الإثم، لأن الإثم جنس يشتمل على كبائر وصغائر، والكبائر: الذنوب التي لا يسقط عقابها إلا بالتوبة. وقيل: التي يكبر عقابها بالإضافة إلى ثواب صاحبها وَالْفَواحِشَ ما فحش من الكبائر، كأنه قال: والفواحش منها خاصة: وقرئ: كبير الإثم، أى: النوع الكبير منه وقيل: هو الشرك بالله. واللمم: ما قل وصغر. ومنه: اللمم المس من الجنون، واللوثة منه.\n\nوألم بالمكان إذا قل فيه لبثه. وألم بالطعام: قل منه أكله: ومنه:\n\nلقاء أخلّاء الصّفاء لمام\n\n والمراد الصغائر من الذنوب، ولا يخلو قوله تعالى إِلَّا اللَّمَمَ من أن يكون استثناء منقطعا أو صفة، كقوله تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا اللَّهُ كأنه قيل: كبائر الإثم غير اللمم، وآلهة غير الله: وعن أبى سعيد الخدري: اللمم هي النظرة، والغمزة، والقبلة: وعن السدّى:\n\nالخطرة من الذنب: وعن الكلبي: كل ذنب لم يذكر الله عليه حدّا ولا عذابا: وعن عطاء:\n\nعادة النفس الحين بعد الحين إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ حيث يكفر الصغائر باجتناب الكبائر، والكبائر بالتوبة فَلا تُزَكُّوا أَنْفُسَكُمْ فلا تنسبوها إلى زكاء العمل وزيادة الخير وعمل الطاعات: أو إلى الزكاء والطهارة من المعاصي، ولا تثنوا عليها واهضموها، فقد علم الله الزكي منكم والتقى أوّلا وآخرا قبل أن يخرجكم من صلب آدم، وقبل أن تخرجوا من بطون أمهاتكم. وقيل: كان ناس يعملون أعمالا حسنة ثم يقولون: صلاتنا وصيامنا وحجنا، فنزلت: وهذا إذا كان على سبيل الإعجاب أو الرياء: فأما من اعتقد أن ما عمله من العمل الصالح من الله وبتوفيقه وتأييده ولم يقصد به التمدح: لم يكن من المزكين أنفسهم، لأن المسرة بالطاعة طاعة، وذكرها شكر.","surah_id":53,"source_id":9},{"ayah_number":33,"ayah_text":"أَفَرَأَيْتَ الَّذِي تَوَلَّى (33) وَأَعْطى قَلِيلاً وَأَكْدى (34) أَعِنْدَهُ عِلْمُ الْغَيْبِ فَهُوَ يَرى (35) أَمْ لَمْ يُنَبَّأْ بِما فِي صُحُفِ مُوسى (36) وَإِبْراهِيمَ الَّذِي وَفَّى (37) أَلاَّ تَزِرُ وازِرَةٌ وِزْرَ أُخْرى (38) وَأَنْ لَيْسَ لِلْإِنْسانِ إِلاَّ ما سَعى (39) وَأَنَّ سَعْيَهُ سَوْفَ يُرى (40) ثُمَّ يُجْزاهُ الْجَزاءَ الْأَوْفى (41) وَأَنَّ إِلى رَبِّكَ الْمُنْتَهى (42) وَأَنَّهُ هُوَ أَضْحَكَ وَأَبْكى (43) وَأَنَّهُ هُوَ أَماتَ وَأَحْيا (44) وَأَنَّهُ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنْثى (45) مِنْ نُطْفَةٍ إِذا تُمْنى (46) وَأَنَّ عَلَيْهِ النَّشْأَةَ الْأُخْرى (47) وَأَنَّهُ هُوَ أَغْنى وَأَقْنى (48) وَأَنَّهُ هُوَ رَبُّ الشِّعْرى (49) وَأَنَّهُ أَهْلَكَ عاداً الْأُولى (50) وَثَمُودَ فَما أَبْقى (51) وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كانُوا هُمْ أَظْلَمَ وَأَطْغى (52) وَالْمُؤْتَفِكَةَ أَهْوى (53) فَغَشَّاها ما غَشَّى (54)","text":"أَكْدى قطع عطيته وأمسك، وأصله: إكداء الحافر، وهو أن تلقاه كدية: وهي صلابة كالصخرة فيمسك عن الحفر، ونحوه: أجبل الحافر، ثم استعير فقيل: أجبل الشاعر إذا أفحم. روى أن عثمان رضى الله عنه كان يعطى ما له في الخير، فقال له عبد الله بن سعد بن أبى سرح وهو أخوه من الرضاعة: يوشك أن لا يبقى لك شيء، فقال عثمان: إن لي ذنوبا وخطايا، وإنى أطلب بما أصنع رضا الله تعالى وأرجو عفوه، فقال عبد الله: أعطنى ناقتك برحلها وأنا أتحمل عنك ذنوبك كلها، فأعطاه وأشهد عليه وأمسك عن العطاء. فنزلت. ومعنى تَوَلَّى ترك المركز يوم أحد، فعاد عثمان إلى أحسن من ذلك وأجمل فَهُوَ يَرى فهو يعلم أن ما قال له أخوه من احتمال أوزاره حق وَفَّى قرئ مخففا ومشدّدا، والتشديد مبالغة في الوفاء. أو بمعنى:\n\nوفر وأتم، كقوله تعالى فَأَتَمَّهُنَّ وإطلاقه ليتناول كل وفاء وتوفية، من ذلك: تبليغه الرسالة، واستقلاله بأعباء النبوّة، والصبر على ذبح ولده وعلى نار نمروذ، وقيامه بأضيافه وخدمته إياهم بنفسه، وأنه كان يخرج كل يوم فيمشى فرسخا يرتاد ضيفا، فإن وافقه أكرمه، وإلا نوى الصوم. وعن الحسن: ما أمره الله بشيء إلا وفي به. وعن الهزيل بن شرحبيل : كان بين نوح وبين إبراهيم يؤخذ الرجل بجريرة غيره، ويقتل بأبيه وابنه وعمه وخاله، والزوج بامرأته، والعبد بسيده، فأوّل من خالفهم إبراهيم. وعن عطاء بن السائب: عهد أن لا يسأل مخلوقا، فلما قذف في النار قال له جبريل وميكائيل: ألك حاجة؟ فقال. أمّا إليكما فلا. وعن النبي صلى الله عليه وسلم: وفي عمله كل يوم بأربع ركعات في صدر النهار، وهي: صلاة الضحى.\n\nوروى: ألا أخبركم لم سمى الله خليله الَّذِي وَفَّى؟ كان يقول إذا أصبح وأمسى: فَسُبْحانَ اللَّهِ حِينَ تُمْسُونَ ... إلى ... حِينَ تُظْهِرُونَ وقيل: وفي سهام الإسلام: وهي ثلاثون: عشرة في التوبة التَّائِبُونَ ... وعشرة في الأحزاب: إِنَّ الْمُسْلِمِينَ ... وعشرة في المؤمنين قَدْ أَفْلَحَ الْمُؤْمِنُونَ ... وقرئ: في صحف، بالتخفيف أَلَّا تَزِرُ أن مخففة من الثقيلة. والمعنى: أنه\n\n لا تزر، والضمير ضمير الشأن، ومحل أن وما بعدها: الجر بدلا من ما في صحف موسى. أو الرفع على: هو أن لا تزر، كأن قائلا قال: وما في صحف موسى وإبراهيم، فقيل: أن لا تزر إِلَّا ما سَعى إلا سعيه. فإن قلت: أما صح في الأخبار: الصدقة عن الميت، والحج عنه، وبه الإضعاف؟ قلت: فيه جوابان، أحدهما: أن سعى غيره لما لم ينفعه إلا مبنيا على سعى نفسه.\n\nوهو أن يكون مؤمنا صالحا وكذلك الإضعاف- كأن سعى غيره كأنه سعى نفسه، لكونه تابعا له وقائما بقيامه. والثاني، أن سعى غيره لا ينفعه إذا عمله لنفسه، ولكن إذا نواه به فهو بحكم الشرع كالنائب عنه والوكيل القائم مقامه ثُمَّ يُجْزاهُ ثم يجزى العبد سعيه، يقال: جزاه الله عمله وجزاه على عمله، بحذف الجار وإيصال الفعل. ويجوز أن يكون الضمير للجزاء، ثم فسره بقوله الْجَزاءَ الْأَوْفى أو أبدله عنه، كقوله تعالى: وَأَسَرُّوا النَّجْوَى الَّذِينَ ظَلَمُوا، وَأَنَّ إِلى رَبِّكَ الْمُنْتَهى قرئ بالفتح على معنى: أن هذا كله في الصحف، وبالكسر على الابتداء، وكذلك ما بعده. والمنتهى: مصدر بمعنى الانتهاء، أى: ينتهى إليه الخلق ويرجعون إليه، كقوله تعالى إِلَى اللَّهِ الْمَصِيرُ. أَضْحَكَ وَأَبْكى خلق قوتي الضحك والبكاء إِذا تُمْنى إذا تدفق في الرحم، يقال: منى وأمنى. وعن الأخفش: تخلق من منى المانى، أى قدر المقدّر: قرئ: النشأة والنشاءة بالمد. وقال عَلَيْهِ لأنها واجبة عليه في الحكمة ، ليجازى على الإحسان والإساءة وَأَقْنى وأعطى القنية وهي المال الذي تأثلته وعزمت أن لا تخرجه من يدك الشِّعْرى مرزم الجوزاء : وهي التي تطلع وراءها، وتسمى كلب الجبار، وهما شعريان الغميصاء والعبور وأراد العبور. وكانت خزاعة تعبدها، سنّ لهم ذلك أبو كبشة رجل من أشرافهم، وكانت قريش تقول لرسول الله صلى الله عليه وسلم: أبو كبشة، تشبيها له به لمخالفته إياهم في دينهم ، يريد: أنه رب معبودهم هذا. عاد الأولى: قوم هود، وعاد الأخرى: إرم. وقيل:\n\nالأولى القدماء، لأنهم أوّل الأمم هلاكا بعد قوم نوح، أو المتقدمون في الدنيا الأشراف. وقرئ:\n\nعادا لولى. وعاد لولى، بإدغام التنوين في اللام وطرح همزة أولى ونقل ضمتها إلى لام التعريف وَثَمُودَ وقرئ: وثمود أَظْلَمَ وَأَطْغى لأنهم كانوا يؤذونه ويضربونه حتى لا يكون به حراك، وينفرون عنه حتى كانوا يحذرون صبيانهم أن يسمعوا منه، وما أثر فيهم دعاؤه قريبا من ألف سنة وَالْمُؤْتَفِكَةَ والقرى التي ائتفكت بأهلها، أى: انقلبت، وهم قوم لوط، يقال: أفكه فأتفك:\n\nوقرئ: والمؤتفكات أَهْوى رفعها إلى السماء على جناح جبريل، ثم أهواها إلى الأرض أى:\n\nأسقطها ما غَشَّى تهويل وتعظيم لما صب عليها من العذاب وأمطر عليها من الصخر المنضود.","surah_id":53,"source_id":9},{"ayah_number":55,"ayah_text":"فَبِأَيِّ آلاءِ رَبِّكَ تَتَمارى (55) هذا نَذِيرٌ مِنَ النُّذُرِ الْأُولى (56) أَزِفَتِ الْآزِفَةُ (57) لَيْسَ لَها مِنْ دُونِ اللَّهِ كاشِفَةٌ (58)","text":"فَبِأَيِّ آلاءِ رَبِّكَ تَتَمارى تتشكك، والخطاب لرسول الله صلى الله عليه وسلم، أو للإنسان على الإطلاق، وقد عدد نعما ونقما وسماها كلها آلاء من قبل ما في نقمه من المزاجر والمواعظ للمعتبرين هذا القرآن نَذِيرٌ مِنَ النُّذُرِ الْأُولى أى إنذار من جنس الإنذارات الأولى التي أنذر بها من قبلكم. أو هذا الرسول منذر من المنذرين الأولين، وقال: الأولى على تأويل الجماعة أَزِفَتِ الْآزِفَةُ قربت الموصوفة بالقرب في قوله تعالى اقْتَرَبَتِ السَّاعَةُ، لَيْسَ لَها نفس كاشِفَةٌ أى مبينة متى تقوم، كقوله تعالى لا يُجَلِّيها لِوَقْتِها إِلَّا هُوَ أو ليس لها نفس كاشفة، أى: قادرة على كشفها إذا وقعت إلا الله، غير أنه لا يكشفها. أو ليس لها الآن نفس كاشفة بالتأخير، وقيل الكاشفة مصدر بمعنى الكشف: كالعافية. وقرأ طلحة: ليس لها مما يدعون من دون الله كاشفة، وهي على الظالمين ساءت الغاشية.","surah_id":53,"source_id":9},{"ayah_number":59,"ayah_text":"أَفَمِنْ هذَا الْحَدِيثِ تَعْجَبُونَ (59) وَتَضْحَكُونَ وَلا تَبْكُونَ (60) وَأَنْتُمْ سامِدُونَ (61) فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا (62)","text":"أَفَمِنْ هذَا الْحَدِيثِ وهو القرآن تَعْجَبُونَ إنكارا وَتَضْحَكُونَ استهزاء وَلا تَبْكُونَ والبكاء والخشوع حق عليكم. وعن رسول الله صلى الله عليه وسلم: أنه لم ير ضاحكا بعد نزولها . وقرئ: تعجبون تضحكون، بغير واو وَأَنْتُمْ سامِدُونَ شامخون مبرطمون .\n\nوقيل: لاهون لاعبون. وقال بعضهم لجاريته: اسمدى لنا، أى غنى لنا فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا ولا تعبدوا الآلهة.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة النجم أعطاه الله عشر حسنات بعدد من صدق بمحمد وجحد به بمكة»","surah_id":53,"source_id":9}]