[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مدنية، وهي ثلاث عشرة آية «3» [نزلت بعد الأحزاب] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":60,"source_id":9},{"ayah_number":1,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِياءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِما جاءَكُمْ مِنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ أَنْ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِنْ كُنْتُمْ خَرَجْتُمْ جِهاداً فِي سَبِيلِي وَابْتِغاءَ مَرْضاتِي تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِما أَخْفَيْتُمْ وَما أَعْلَنْتُمْ وَمَنْ يَفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَواءَ السَّبِيلِ (1) إِنْ يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْداءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُمْ بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ (2)","text":"روى أن مولاة لأبى عمرو بن صيفي بن هاشم يقال لها سارة أتت رسول الله صلى الله عليه وسلم بالمدينة وهو يتجهز للفتح، فقال لها: أمسلمة جئت؟ قالت: لا. قال: أفمهاجرة جئت؟ قالت: لا. قال: فما جاء بك؟ قالت: كنتم الأهل والموالي والعشيرة، وقد ذهبت الموالي، تعنى: قتلوا يوم بدر، فاحتجت حاجة شديدة فحث عليها بنى عبد المطلب فكسوها وحملوها وزوّدوها، فأناها حاطب بن أبى بلتعة وأعطاها عشرة دنانير وكساها بردا، واستحملها كتابا إلى أهل مكة نسخته: من حاطب بن أبى بلتعة إلى أهل مكة، اعلموا أنّ رسول الله صلى الله تعالى عليه وسلم يريدكم فخذوا حذركم، فخرجت سارة ونزل جبريل بالخبر، فبعث رسول الله صلى الله عليه وسلم عليا وعمارا وعمر وطلحة والزبير والمقداد وأبا مرثد- وكانوا فرسانا- وقال: انطلقوا حتى تأتوا روضة خاخ، فإن بها ظعينة معها كتاب من حاطب إلى أهل مكة، فخذوه منها وخلوها، فإن أبت فاضربوا عنقها، فأدركوها فجحدت وحلفت، فهموا بالرجوع فقال على رضى الله عنه: والله ما كذبنا ولا كذب رسول الله، وسل سيفه، وقال: أخرجى الكتاب أو تضعي رأسك، فأخرجته من عقاص شعرها. وروى أن رسول الله صلى الله عليه وسلم أمّن جميع الناس يوم الفتح إلا أربعة: هي أحدهم ، فاستحضر رسول الله حاطبا وقال: ما حملك عليه؟ فقال: يا رسول الله ما كفرت منذ أسلمت، ولا غششتك منذ نصحتك. ولا أحببتهم منذ فارقتهم، ولكنى كنت امرأ ملصقا في قريش. وروى: عزيزا فيهم، أى: غريبا، ولم أكن من أنفسها، وكل من معكم من المهاجرين لهم قرابات بمكة يحمون أهاليهم وأموالهم غيرى، فخشيت على أهلى، فأردت أن أتخذ عندهم يدا، وقد علمت أن الله تعالى ينزل عليهم بأسه. وأن كتابي لا يغنى عنهم شيئا، فصدّقه وقبل عذره، فقال عمر: دعى يا رسول الله أضرب عنق هذا المنافق فقال: «وما يدريك يا عمر، لعل الله قد اطلع على أهل بدر فقال لهم: اعملوا ما شئتم فقد غفرت لكم» ففاضت عينا عمر وقال. الله ورسوله أعلم، فنزلت. عدى «اتخذ» إلى مفعوليه، وهما عدوى، أولياء. والعدوّ: فعول، من عدا، كعفوّ من عفا ولكونه على زنه المصدر أوقع على الجمع إيقاعه على الواحد. فإن قلت: تُلْقُونَ بم يتعلق؟ قلت: يجوز أن يتعلق بلا تتخذوا حالا من ضميره وبأولياء صفة له. ويجوز أن يكون استئنافا. فإن قلت: إذا جعلته صفة لأولياء وقد جرى على غير من هوله، فأين الضمير البارز وهو قولك: تلقون إليهم أنتم بالمودّة؟ قلت: ذلك إنما اشترطوه في الأسماء دون الأفعال، لو قيل: أولياء ملقين إليهم بالمودّة على الوصف. لما كان بد من الضمير البارز، والإلقاء عبارة عن إيصال المودّة والإفضاء بها إليهم: يقال ألقى إليه خراشى صدره ، وأفضى إليه بقشوره. والباء في بِالْمَوَدَّةِ إما زائدة مؤكدة للتعدى مثلها في وَلا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ وإما ثابتة على أن مفعول تلقون محذوف، معناه: تلقون إليهم أخبار رسول الله بسبب المودّة الى بينكم وبينهم. وكذلك قوله تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ أى: تفضون إليهم بمودتكم سرا. أو تسرون إليهم إسرار رسول الله بسبب المودّة. فإن قلت: وَقَدْ كَفَرُوا حال مماذا؟ قلت: إما من لا تَتَّخِذُوا وإما من تُلْقُونَ أى: لا تتولوهم أو توادّونهم وهذه حالهم. ويُخْرِجُونَ استئناف كالتفسير لكفرهم وعتوّهم.\n\nأو حال من كفروا. وأَنْ تُؤْمِنُوا تعليل ليخرجون، أى يخرجونكم لإيمانكم. وإِنْ كُنْتُمْ خَرَجْتُمْ متعلق بلا تتخذوا، يعنى: لا تتولوا أعدائى إن كنتم أوليائى. وقول النحويين في مثله: هو شرط جوابه محذوف لدلالة ما قبله عليه. وتُسِرُّونَ استئناف، ومعناه: أىّ طائل لكم في إسراركم وقد علمتم أن الإخفاء والإعلان سيان في علمى لا تفاوت بينهما، وأنا مطلع رسولي على ما تسرون وَمَنْ يَفْعَلْهُ ومن يفعل هذا الإسرار فقد أخطأ طريق الحق والصواب. وقرأ الجحدري: لما جاءكم، أى: كفروا لأجل ما جاءكم، بمعنى: أن ما كان يجب أن يكون سبب إيمانهم جعلوه سببا لكفرهم. إِنْ يَثْقَفُوكُمْ إن يظفروا بكم ويتمكنوا منكم يَكُونُوا لَكُمْ أَعْداءً خالصي العداوة، ولا يكونوا لكم أولياء كما أنتم وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُمْ بِالسُّوءِ بالقتال والشتم، وتمنوا لو ترتدون عن دينكم، فإذن مودة أمثالهم ومناصحتهم خطأ عظيم منكم ومغالطة لأنفسكم ونحوه قوله تعالى لا يَأْلُونَكُمْ خَبالًا فإن قلت: كيف أورد جواب الشرط مضارعا مثله ثم قال وَوَدُّوا بلفظ الماضي؟ قلت: الماضي وإن كان يجرى في باب الشرط مجرى المضارع في علم الإعراب، فإن فيه نكتة، كأنه قيل: وودّوا قبل كل شيء كفركم وارتدادكم، يعنى:\n\nأنهم يريدون أن يلحقوا بكم مضار الدنيا والدين جميعا: من قتل الأنفس، وتمزيق الأعراض، وردّكم كفارا، وردكم كفارا أسبق المضارّ عندهم وأوّلها، لعلمهم أن الدين أعز عليكم من أرواحكم، لأنكم بذّالون لها دونه، والعدوّ أهم شيء عنده أن يقصد أعز شيء عند صاحبه.","surah_id":60,"source_id":9},{"ayah_number":3,"ayah_text":"لَنْ تَنْفَعَكُمْ أَرْحامُكُمْ وَلا أَوْلادُكُمْ يَوْمَ الْقِيامَةِ يَفْصِلُ بَيْنَكُمْ وَاللَّهُ بِما تَعْمَلُونَ بَصِيرٌ (3)","text":"لَنْ تَنْفَعَكُمْ أَرْحامُكُمْ أى قراباتكم وَلا أَوْلادُكُمْ الذي توالون الكفار من أجلهم وتتقربون إليهم محاماة عليهم، ثم قال يَوْمَ الْقِيامَةِ يَفْصِلُ بَيْنَكُمْ وبين أقاربكم وأولادكم يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ ... الآية فما لكم ترفضون حق الله مراعاة لحق من يفرّ منكم غدا:\n\nخطأ رأيهم في موالاة الكفار بما يرجع إلى حال من والوه أوّلا، ثم بما يرجع إلى حال من اقتضى تلك الموالاة ثانيا، ليربهم أن ما أقدموا عليه من أى جهة نظرت فيه وجدته باطلا.\n\nقرئ: يفصل ويفصّل، على البناء للمفعول. ويفصل ويفصّل، على البناء للفاعل وهو الله عزّ وجل. ونفصل ونفصل، بالنون.","surah_id":60,"source_id":9},{"ayah_number":4,"ayah_text":"قَدْ كانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْراهِيمَ وَالَّذِينَ مَعَهُ إِذْ قالُوا لِقَوْمِهِمْ إِنَّا بُرَآؤُا مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ كَفَرْنا بِكُمْ وَبَدا بَيْنَنا وَبَيْنَكُمُ الْعَداوَةُ وَالْبَغْضاءُ أَبَداً حَتَّى تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلاَّ قَوْلَ إِبْراهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَما أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ رَبَّنا عَلَيْكَ تَوَكَّلْنا وَإِلَيْكَ أَنَبْنا وَإِلَيْكَ الْمَصِيرُ (4) رَبَّنا لا تَجْعَلْنا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنا رَبَّنا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ (5)","text":"وقرئ. أسوة وإسوة. وهو اسم المؤتسى به، أى كان فيهم مذهب حسن مرضى بأن يؤتسى به ويتبع أثره، وهو قولهم لكفار قومهم ما قالوا، حيث كاشفوهم بالعداوة وقشروا لهم العصا، وأظهروا البغضاء والمقت، وصرحوا بأن سبب عداوتهم وبغضائهم ليس إلا كفرهم بالله، وما دام هذا السبب قائما كانت العداوة قائمة، حتى إن أزالوه وآمنوا بالله وحده انقلبت العداوة موالاة، والبغضاء محبة، والمقت مقة ، فأفصحوا عن محض الإخلاص. ومعنى كَفَرْنا بِكُمْ وبما تعبدون من دون الله: أنا لا نعتدّ بشأنكم ولا بشأن آلهتكم، وما أنتم عندنا على شيء.\n\nفإن قلت: مم استثنى قوله إِلَّا قَوْلَ إِبْراهِيمَ؟ قلت: من قوله أُسْوَةٌ حَسَنَةٌ لأنه أراد بالأسوة الحسنة: قولهم الذي حق عليهم أن يأتسوا به ويتخذونه سنة يستنون بها. فإن قلت:\n\nفإن كان قوله لَأَسْتَغْفِرَنَّ لَكَ مستثنى من القول الذي هو أسوة حسنة، فما بال قوله وَما أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ وهو غير حقيق بالاستثناء. ألا ترى إلى قوله قُلْ فَمَنْ يَمْلِكُ مِنَ اللَّهِ شَيْئاً؟ قلت: أراد استثناء جملة قوله لأبيه، والقصد إلى موعد الاستغفار له، وما بعده مبنىّ عليه وتابع له، كأنه قال: أنا أستغفر لك وما في طاقتي إلا الاستغفار. فإن قلت: بم اتصل قوله رَبَّنا عَلَيْكَ تَوَكَّلْنا؟ قلت: بما قبل الاستثناء، وهو من جملة الأسوة الحسنة. ويجوز أن يكون المعنى: قولوا ربنا، أمرا من الله تعالى للمؤمنين بأن يقولوه، وتعليما منه لهم تتميما لما وصاهم به من قطع العلائق بينهم وبين الكفار، والائتساء بإبراهيم وقومه في البراءة منهم، وتنبيها على الإنابة إلى الله والاستعاذة به من فتنة أهل الكفر، والاستغفار مما فرط منهم. وقرئ: برآء كشركاء، وبراء كظراف. وبراء على إبدال الضم من الكسر، كرخال ورباب. وبراء على الوصف بالمصدر. والبراء والبراءة كالظماء والظماءة.","surah_id":60,"source_id":9},{"ayah_number":6,"ayah_text":"لَقَدْ كانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ لِمَنْ كانَ يَرْجُوا اللَّهَ وَالْيَوْمَ الْآخِرَ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (6)","text":"ثم كرّر الحث على الائتساء بإبراهيم وقومه تقريرا وتأكيدا عليهم، ولذلك جاء به مصدرا بالقسم لأنه الغاية في التأكيد، وأبدل عن قوله لَكُمْ قوله لِمَنْ كانَ يَرْجُوا اللَّهَ وَالْيَوْمَ الْآخِرَ وعقبه بقوله وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ فلم يترك نوعا من التأكيد إلا جاء به.","surah_id":60,"source_id":9},{"ayah_number":7,"ayah_text":"عَسَى اللَّهُ أَنْ يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عادَيْتُمْ مِنْهُمْ مَوَدَّةً وَاللَّهُ قَدِيرٌ وَاللَّهُ غَفُورٌ رَحِيمٌ (7)","text":"ولما نزلت هذه الآيات: تشدّد المؤمنون في عداوة آبائهم وأبنائهم وجميع أقربائهم من المشركين ومقاطعتهم، فلما رأى الله عز وجل منهم الجدّ والصبر على الوجه الشديد وطول التمني للسبب الذي يبيح لهم الموالاة والمواصلة: رحمهم فوعدهم تيسير ما تمنوه، فلما يسر فتح مكة أظفرهم الله بأمنيتهم، فأسلم قومهم، وتمّ بينهم من التحاب والتصافي ما تمّ. وقيل: تزوّج رسول الله صلى الله عليه وسلم أمّ حبيبة، فلانت عند ذلك عريكة أبى سفيان واسترخت شكيمته في العداوة، وكانت أمّ حبيبة قد أسلمت وهاجرت مع زوجها عبد الله بن أبى جحش إلى الحبشة، فتنصر وأرادها على النصرانية، فأبت وصبرت على دينها، ومات زوجها، فبعث رسول الله صلى الله عليه وسلم إلى النجاشي فخطبها عليه ، وساق عنه إليها مهرها أربعمائة دينار، وبلغ ذلك أباها فقال: ذلك الفحل لا يقدع أنفه . وعَسَى وعد من الله على عادات الملوك حيث يقولون في بعض الحوائج: عسى أو لعل: فلا تبقى شبهة للمحتاج في تمام ذلك. أو قصد به إطماع المؤمنين، والله قدير على تقليب القلوب وتغيير الأحوال وتسهيل أسباب المودة وَاللَّهُ غَفُورٌ رَحِيمٌ لمن أسلم من المشركين.","surah_id":60,"source_id":9},{"ayah_number":8,"ayah_text":"لا يَنْهاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُمْ مِنْ دِيارِكُمْ أَنْ تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ (8) إِنَّما يَنْهاكُمُ اللَّهُ عَنِ الَّذِينَ قاتَلُوكُمْ فِي الدِّينِ وَأَخْرَجُوكُمْ مِنْ دِيارِكُمْ وَظاهَرُوا عَلى إِخْراجِكُمْ أَنْ تَوَلَّوْهُمْ وَمَنْ يَتَوَلَّهُمْ فَأُولئِكَ هُمُ الظَّالِمُونَ (9)","text":"أَنْ تَبَرُّوهُمْ بدل من الذين لم يقاتلوكم. وكذلك أَنْ تَوَلَّوْهُمْ من الذين قاتلوكم:\n\nوالمعنى: لا ينهاكم عن مبرّه هؤلاء، وإنما ينهاكم عن تولى هؤلاء. وهذا أيضا رحمة لهم لتشدّدهم وجدّهم في العداوة متقدّمة لرحمته بتيسير إسلام قومهم، حيث رخص لهم في صلة من لم يجاهر منهم بقتال المؤمنين وإخراجهم من ديارهم. وقيل: أراد بهم خزاعة وكانوا صالحوا رسول الله صلى الله عليه وسلم على أن لا يقاتلوه ولا يعينوا عليه. وعن مجاهد:\n\nهم الذين آمنوا بمكة ولم يهاجروا. وقيل: هم النساء والصبيان. وقيل قدمت على أسماء بنت أبى بكر أمّها قتيلة بنت عبد العزى وهي مشركة بهدايا فلم تقبلها ولم تأذن لها في الدخول، فنزلت، فأمرها رسول الله صلى الله تعالى عليه وآله وسلم أن تدخلها وتقبل منها وتكرمها وتحسن إليها . وعن قتادة: نسختها آية القتال وَتُقْسِطُوا إِلَيْهِمْ وتقضوا إليهم بالقسط ولا تظلموهم.\n\nوناهيك بتوصية الله المؤمنين أن يستعملوا القسط مع المشركين به ويتحاموا ظلمهم، مترجمة عن حال مسلم يجترئ على ظلم أخيه المسلم.","surah_id":60,"source_id":9},{"ayah_number":10,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا إِذا جاءَكُمُ الْمُؤْمِناتُ مُهاجِراتٍ فَامْتَحِنُوهُنَّ اللَّهُ أَعْلَمُ بِإِيمانِهِنَّ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِناتٍ فَلا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ لا هُنَّ حِلٌّ لَهُمْ وَلا هُمْ يَحِلُّونَ لَهُنَّ وَآتُوهُمْ ما أَنْفَقُوا وَلا جُناحَ عَلَيْكُمْ أَنْ تَنْكِحُوهُنَّ إِذا آتَيْتُمُوهُنَّ أُجُورَهُنَّ وَلا تُمْسِكُوا بِعِصَمِ الْكَوافِرِ وَسْئَلُوا ما أَنْفَقْتُمْ وَلْيَسْئَلُوا ما أَنْفَقُوا ذلِكُمْ حُكْمُ اللَّهِ يَحْكُمُ بَيْنَكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ (10) وَإِنْ فاتَكُمْ شَيْءٌ مِنْ أَزْواجِكُمْ إِلَى الْكُفَّارِ فَعاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْواجُهُمْ مِثْلَ ما أَنْفَقُوا وَاتَّقُوا اللَّهَ الَّذِي أَنْتُمْ بِهِ مُؤْمِنُونَ (11)","text":"إِذا جاءَكُمُ الْمُؤْمِناتُ سماهنّ مؤمنات لتصديقهنّ بألسنتهنّ ونطقهنّ بكلمة الشهادة ولم يظهر منهنّ ما ينافي ذلك. أو لأنهنّ مشارفات لثبات إيمانهن بالامتحان فَامْتَحِنُوهُنَّ فابتلوهن بالحلف والنظر في الأمارات ليغلب على ظنونكم صدق إيمانهن، وكان رسول الله صلى الله عليه وسلم يقول للممتحنة: «بالله الذي لا إله إلا هو ما خرجت من بغض زوج، بالله ما خرجت رغبة عن أرض إلى أرض، بالله ما خرجت التماس دنيا، بالله ما خرجت إلا حبا لله ولرسوله» اللَّهُ أَعْلَمُ بِإِيمانِهِنَّ منكم لأنكم لا تكسبون فيه علما تطمئن معه نفوسكم، وإن استحلفتموهن ورزتم أحوالهن، وعند الله حقيقة العلم به فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِناتٍ العلم الذي تبلغه طاقتكم وهو الظن الغالب بالحلف وظهور الأمارات فَلا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ فلا تردّوهن إلى أزواجهن المشركين، لأنه لأحل بين المؤمنة والمشرك وَآتُوهُمْ ما أَنْفَقُوا وأعطوا أزواجهنّ مثل ما دفعوا إليهنّ من المهور، وذلك أن صلح الحديبية كان على أن من أتاكم من أهل مكة ردّ إليهم، ومن أتى منكم مكة لم يردّ إليكم، وكتبوا بذلك كتابا وختموه، فجاءت سبيعة بنت الحرث الأسلمية مسلمة والنبي صلى الله عليه وسلم بالحديبية، فأقبل زوجها مسافر المخزومي. وقيل صيفي بن الراهب فقال: يا محمد، اردد علىّ امرأتى فإنك قد شرطت لنا أن ترد علينا من أتاك منا، وهذه طينة الكتاب لم تجف، فنزلت بيانا لأن الشرط إنما كان في الرجال دون النساء . وعن الضحاك: كان بين رسول الله صلى الله عليه وسلم وبين المشركين عهد:\n\nأن لا تأتيك منا امرأة ليست على دينك إلا رددتها إلينا، فإن دخلت في دينك ولها زوج أن تردّ على زوجها الذي أنفق عليها، وللنبي صلى الله عليه وسلم من الشرط مثل ذلك. وعن قتادة: ثم نسخ هذا الحكم وهذا العهد براءة، فاستحلفها رسول الله صلى الله عليه وسلم فحلفت، فأعطى زوجها ما أنفق وتزوّجها عمر. فإن قلت: كيف سمى الظنّ علما في قوله فَإِنْ عَلِمْتُمُوهُنَّ؟\n\nقلت: إيذانا بأن الظن الغالب وما يفضى إليه الاجتهاد والقياس جار مجرى العلم، وأن صاحبه غير داخل في قوله وَلا تَقْفُ ما لَيْسَ لَكَ بِهِ عِلْمٌ فإن قلت: فما فائدة قوله اللَّهُ أَعْلَمُ بِإِيمانِهِنَّ وذلك معلوم لا شبهة فيه؟ قلت: فائدته بيان أن لا سبيل لكم إلى ما تطمئن به النفس ويثلج به الصدر من الإحاطة بحقيقة إيمانهن، فإنّ ذلك مما استأثر به علام الغيوب، وأن ما يؤدى إليه الامتحان من العلم كاف في ذلك، وأن تكليفكم لا يعدوه، ثم نفى عنهم الجناح في تزوّج هؤلاء المهاجرات إذا آتوهنّ أجورهنّ أى مهورهنّ، لأن المهر أجر البضع، ولا يخلو إما أن يراد بها ما كان يدفع إليهنّ ليدفعنه إلى أزواجهنّ فيشترط في إباحة تزوجهنّ تقديم أدائه، وإما أن يراد أن ذلك إذا دفع إليهنّ على سبيل القرض ثم تزوجن على ذلك لم يكن به بأس، وإما أن يبين لهم أن ما أعطى أزواجهنّ لا يقوم مقام المهر وأنه لا بد من إصداق، وبه احتج أبو حنيفة على أن أحد الزوجين إذا خرج من دار الحرب مسلما أو بذمة وبقي الآخر حربيا: وقعت الفرقة، ولا يرى العدة على المهاجرة ويبيح نكاحها إلا أن تكون حاملا وَلا تُمْسِكُوا بِعِصَمِ الْكَوافِرِ والعصمة ما يعتصم به من عقد وسبب، يعنى: إياكم وإياهنّ، ولا تكن بينكم وبينهنّ عصمة ولا علقة زوجية. قال ابن عباس: من كانت له امرأة كافرة بمكة فلا يعتدنّ بها من نسائه، لأن اختلاف الدارين قطع عصمتها منه. وعن النخعي: هي المسلمة تلحق بدار الحرب فتكفر.\n\nوعن مجاهد: أمرهم بطلاق الباقيات مع الكفار ومفارقتهن وَسْئَلُوا ما أَنْفَقْتُمْ من مهور أزواجكم اللاحقات بالكفار وَلْيَسْئَلُوا ما أَنْفَقُوا من مهور نسائهم المهاجرات. وقرئ:\n\nولا تمسكوا بالتخفيف. ولا تمسكوا بالتثقيل. ولا تمسكوا، أى: ولا تتمسكوا ذلِكُمْ حُكْمُ اللَّهِ يعنى جميع ما ذكر في هذه الآية يَحْكُمُ بَيْنَكُمْ كلام مستأنف. أو حال من حكم الله على حذف الضمير، أى: يحكمه الله. أو جعل الحكم حاكما على المبالغة. روى أنها لما نزلت هذه الآية أدى المؤمنون ما أمروا به من أداء مهور المهاجرات إلى أزواجهنّ المشركين، وأبى المشركون أن يؤدوا شيئا من مهور الكوافر إلى أزواجهن المسلمين، فنزل قوله وَإِنْ فاتَكُمْ وإن سبقكم وانفلت منكم شَيْءٌ من أزواجكم: أحد منهن إلى الكفار، وهو في قراءة ابن مسعود: أحد. فإن قلت: هل لإيقاع شيء في هذا الموقع فائدة؟ قلت: نعم، الفائدة فيه: أن لا يغادر شيء من هذا الجنس وإن قل وحقر، غير معوض منه تغليظا في هذا الحكم وتشديدا فيه فَعاقَبْتُمْ من العقبة وهي التوبة: شبه ما حكم به على المسلمين والكافرين من أداء هؤلاء مهور نساء أولئك تارة، وأولئك مهور نساء هؤلاء أخرى بأمر يتعاقبون فيه كما يتعاقب في الركوب وغيره. ومعناه: فجاءت عقبتكم من أداء المهر، فآتوا من فاتته امرأته إلى الكفار مثل مهرها من مهر المهاجرة، ولا تؤتوه زوجها الكافر، وهكذا عن الزهري: يعطى من صداق من لحق بهم. وقرئ: فأعقبتم. فعقبتم بالتشديد. فعقبتم بالتخفيف، بفتح القاف وكسرها، فمعنى أعقبتم: دخلتم في العقبة، وعقبتم: من عقبه إذا قفاه، لأنّ كل واحد من المتعاقبين يقفى صاحبه، وكذلك عقبتم بالتخفيف، يقال: عقبه يعقبه. وعقبتم نحو تبعتم. وقال الزجاج:\n\nفعاقبتم فأصبتموهم في القتال بعقوبة حتى غنمتم، والذي ذهبت زوجته كان يعطى من الغنيمة المهر، وفسر غيرها من القراآت فكانت العقبى لكم، أى: فكانت الغلبة لكم حتى غنمتم.\n\nوقيل: جميع من لحق بالمشركين من نساء المؤمنين المهاجرين راجعة عن الإسلام ست نسوة:\n\nأم الحكم بنت أبى سفيان كانت تحت عياض بن شداد الفهري، وفاطمة بنت أبى أمية كانت تحت عمر بن الخطاب وهي أخت أم سلمة، وبروع بنت عقبة كانت تحت شماس بن عثمان، وعبدة بنت عبد العزى بن نصلة وزوجها عمرو بن عبدودّ، وهند بنت أبى جهل كانت تحت هشام بن العاص. وكلثوم بنت جرول كانت تحت عمر، فأعطاهم رسول الله صلى الله عليه وسلم مهور نسائهم من الغنيمة.","surah_id":60,"source_id":9},{"ayah_number":12,"ayah_text":"يا أَيُّهَا النَّبِيُّ إِذا جاءَكَ الْمُؤْمِناتُ يُبايِعْنَكَ عَلى أَنْ لا يُشْرِكْنَ بِاللَّهِ شَيْئاً وَلا يَسْرِقْنَ وَلا يَزْنِينَ وَلا يَقْتُلْنَ أَوْلادَهُنَّ وَلا يَأْتِينَ بِبُهْتانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ وَلا يَعْصِينَكَ فِي مَعْرُوفٍ فَبايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (12)","text":"وَلا يَقْتُلْنَ أَوْلادَهُنَّ وقرئ: يقتلن، بالتشديد، يريد: وأد البنات وَلا يَأْتِينَ بِبُهْتانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ كانت المرأة تلتقط المولود فتقول لزوجها: هو ولدى منك.\n\nكنى بالبهتان المفترى بين يديها ورجليها عن الولد الذي تلصقه بزوجها كذبا، لأنّ بطنها الذي تحمله فيه بين اليدين، وفرجها الذي تلده به بين الرجلين وَلا يَعْصِينَكَ فِي مَعْرُوفٍ فيما تأمرهن به من المحسنات وتنهاهنّ عنه من المقبحات. وقيل: كل ما وافق طاعة الله فهو معروف. فإن قلت: لو اقتصر على قوله وَلا يَعْصِينَكَ فقد علم أن رسول الله صلى الله عليه وسلم لا يأمر إلا بمعروف؟ قلت: نبه بذلك على أنّ طاعة المخلوق في معصية الخالق جديرة بغاية التوقي والاجتناب. وروى أنّ رسول الله صلى الله عليه وسلم لما فرغ يوم فتح مكة من بيعة الرجال:\n\nأخذ في بيعة النساء وهو على الصفا وعمر بن الخطاب رضى الله عنه أسفل منه يبايعهن بأمره ويبلغهن عنه، وهند بنت عتبة امرأة أبى سفيان متقنعة متنكرة خوفا من رسول الله صلى الله عليه وسلم أن يعرفها فقال عليه الصلاة والسلام: «أبايعكن على أن لا تشركن بالله شيئا فرفعت هند رأسها وقالت: والله لقد عبدنا الأصنام وإنك لتأخذ علينا أمرا ما رأيناك أخذته على الرجال تبايع الرجال على الإسلام والجهاد، فقال عليه الصلاة والسلام: و «لا يسرقن» فقالت: إنّ أبا سفيان رجل شحيح، وإنى أصبت من ماله هنات، فما أدرى، أتحل لي أم لا. فقال أبو سفيان: ما أصبت من شيء فيما مضى وفيما غبر فهو لك حلال، فضحك رسول الله صلى الله عليه وسلم وعرفها فقال لها: وإنّك لهند بنت عتبة؟ قالت: نعم فاعف عما سلف يا نبى الله عفا الله عنك، فقال: «ولا يزنين» ، فقالت: أو تزنى الحرة؟ وفي رواية: ما زنت منهن امرأة قط، فقال عليه الصلاة والسلام «ولا يقتلن أولادهن» فقالت: ربيناهم صغارا وقتلتهم كبارا فأنتم وهم أعلم، وكان ابنها حنظلة بن أبى سفيان قد قتل يوم بدر، فضحك عمر حتى استلقى، وتبسم رسول الله صلى الله عليه وسلم فقال: «ولا يأتين ببهتان» فقالت:\n\nوالله إنّ البهتان لأمر قبيح، وما تأمرنا إلا بالرشد ومكارم الأخلاق، فقال: «ولا يعصينك في معروف» فقالت: والله ما جلسنا مجلسنا هذا وفي أنفسنا أن نعصيك في شيء. وقيل في كيفية المبايعة: دعا بقدح من ماء فغمس فيه يده، ثم غمسن أيديهن . وقيل صافحهن وكان على يده ثوب قطري . وقيل كان عمر يصافحهن عنه","surah_id":60,"source_id":9},{"ayah_number":13,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا لا تَتَوَلَّوْا قَوْماً غَضِبَ اللَّهُ عَلَيْهِمْ قَدْ يَئِسُوا مِنَ الْآخِرَةِ كَما يَئِسَ الْكُفَّارُ مِنْ أَصْحابِ الْقُبُورِ (13)","text":"روى أنّ بعض فقراء المسلمين كانوا يواصلون اليهود ليصيبوا من ثمارهم . فقيل لهم لا تَتَوَلَّوْا قَوْماً مغضوبا عليهم قَدْ يَئِسُوا من أن يكون لهم حظ في الآخرة لعنادهم رسول الله صلى الله عليه وسلم، وهم يعلمون أنه الرسول المنعوت في التوراة كَما يَئِسَ الْكُفَّارُ من موتاهم أن يبعثوا ويرجعوا أحياء. وقيل مِنْ أَصْحابِ الْقُبُورِ بيان للكفار، أى: كما يئس الكفار الذين قبروا من خير الآخرة، لأنهم تبينوا قبح حالهم وسوء منقلبهم.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة الممتحنة كان له المؤمنون والمؤمنات شفعاء يوم القيامة .","surah_id":60,"source_id":9}]