[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مكية [إلا آية 14 فمدنية] وآياتها 37 وقيل 36 آية [نزلت بعد الدخان] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":45,"source_id":9},{"ayah_number":1,"ayah_text":"حم (1) تَنْزِيلُ الْكِتابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ (2) إِنَّ فِي السَّماواتِ وَالْأَرْضِ لَآياتٍ لِلْمُؤْمِنِينَ (3) وَفِي خَلْقِكُمْ وَما يَبُثُّ مِنْ دابَّةٍ آياتٌ لِقَوْمٍ يُوقِنُونَ (4) وَاخْتِلافِ اللَّيْلِ وَالنَّهارِ وَما أَنْزَلَ اللَّهُ مِنَ السَّماءِ مِنْ رِزْقٍ فَأَحْيا بِهِ الْأَرْضَ بَعْدَ مَوْتِها وَتَصْرِيفِ الرِّياحِ آياتٌ لِقَوْمٍ يَعْقِلُونَ (5) تِلْكَ آياتُ اللَّهِ نَتْلُوها عَلَيْكَ بِالْحَقِّ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآياتِهِ يُؤْمِنُونَ (6)","text":"حم إن جعلتها اسما مبتدأ مخبرا عنه ب تَنْزِيلُ الْكِتابِ لم يكن بدّ من حذف مضاف، تقديره: تنزيل حم تنزيل الكتاب. ومِنَ اللَّهِ صلة للتنزيل، وإن جعلتها تعديدا للحروف كان تَنْزِيلُ الْكِتابِ مبتدأ، والظرف خبرا إِنَّ فِي السَّماواتِ وَالْأَرْضِ يجوز أن يكون على ظاهره، وأن يكون المعنى، إنّ في خلق السماوات لقوله وَفِي خَلْقِكُمْ فإن قلت: علام عطف وَما يَبُثُّ أعلى الخلق المضاف؟ أم على الضمير المضاف إليه؟ قلت: بل على المضاف، لأنّ المضاف إليه ضمير متصل مجرور يقبح العطف عليه: استقبحوا أن يقال: مررت بك وزيد، وهذا أبوك وعمرو، وكذلك إن أكدوه كرهوا أن يقولوا: مررت بك أنت وزيد. قرئ: آيات لقوم يوقنون، بالنصب والرفع، على قولك: إنّ زيدا في الدار وعمرا في السوق. أو عمرو في السوق. وأمّا قوله آياتٌ لِقَوْمٍ يَعْقِلُونَ فمن العطف على عاملين، سواء نصبت أو رفعت، فالعاملان إذا نصبت هما: إن، وفى: أقيمت الواو مقامهما، فعملت الجر في اخْتِلافِ اللَّيْلِ وَالنَّهارِ، والنصب في آياتٌ. وإذا رفعت فالعاملان: الابتداء وفي: عملت الرفع في آياتٌ، والجر في وَاخْتِلافِ وقرأ ابن مسعود: وفي اختلاف الليل والنهار. فإن قلت: العطف على عاملين على مذهب الأخفش سديد لا مقام فيه. وقد أباه سيبويه، فما وجه تخريج الآية عنده؟\n\nقلت: فيه وجهان عنده. أحدهما: أن يكون على إضمار في. والذي حسنه تقدّم ذكره في الآيتين قبلها. ويعضده قراءة ابن مسعود. والثاني: أن ينتصب آيات على الاختصاص بعد انقضاء المجرور معطوفا على ما قبله أو على التكرير، ورفعها بإضمار هي: وقرئ: واختلاف الليل والنهار بالرفع. وقرئ: آية. وكذلك وما يبث من دابة آية. وقرئ وتصريف الريح. والمعنى: إنّ المنصفين من العباد إذا نظروا في السماوات والأرض النظر الصحيح، علموا أنها مصنوعة، وأنه لا بدّ لها من صانع، فآمنوا بالله وأقرّوا، فإذا نظروا في خلق أنفسهم وتنقلها من حال إلى حال وهيئة إلى هيئة، وفي خلق ما على ظهر الأرض من صنوف الحيوان: ازدادوا إيمانا، وأيقنوا وانتفى عنهم اللبس، فإذا نظروا في سائر الحوادث التي تتجدّد في كل وقت كاختلاف الليل والنهار ونزول الأمطار وحياة الأرض بها بعد موتها وَتَصْرِيفِ الرِّياحِ جنوبا وشمالا وقبولا ودبورا: عقلوا واستحكم علمهم وخلص يقينهم، وسمى المطر رزقا، لأنه سبب الرزق تِلْكَ إشارة إلى الآيات المتقدّمة، أى: تلك الآيات آيات الله. ونَتْلُوها في محل الحال، أى: متلوة عَلَيْكَ بِالْحَقِّ والعامل ما دل عليه تلك من معنى الإشارة. ونحوه: هذا بَعْلِي شَيْخاً وقرئ: يتلوها، بالياء بَعْدَ اللَّهِ وَآياتِهِ أى بعد آيات الله كقولهم: أعجبنى زيد وكرمه، يريدون: أعجبنى كرم زيد. ويجوز أن يراد: بعد حديث الله، وهو كتابه وقرآنه، كقوله تعالى، اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ. وقرئ يُؤْمِنُونَ بالتاء والياء.","surah_id":45,"source_id":9},{"ayah_number":7,"ayah_text":"وَيْلٌ لِكُلِّ أَفَّاكٍ أَثِيمٍ (7) يَسْمَعُ آياتِ اللَّهِ تُتْلى عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِراً كَأَنْ لَمْ يَسْمَعْها فَبَشِّرْهُ بِعَذابٍ أَلِيمٍ (8) وَإِذا عَلِمَ مِنْ آياتِنا شَيْئاً اتَّخَذَها هُزُواً أُولئِكَ لَهُمْ عَذابٌ مُهِينٌ (9) مِنْ وَرائِهِمْ جَهَنَّمُ وَلا يُغْنِي عَنْهُمْ ما كَسَبُوا شَيْئاً وَلا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِياءَ وَلَهُمْ عَذابٌ عَظِيمٌ (10)","text":"الأفاك: الكذاب، والأثيم: المتبالغ في اقتراف الآثام يُصِرُّ يقبل على كفره ويقيم عليه. وأصله من إصرار الحمار على العانة وهو أن ينحى عليها صارّا أذنيه مُسْتَكْبِراً عن الإيمان بالآيات والإذعان لما ينطق به من الحق، مزدريا لها معجبا بما عنده. قيل: نزلت في النضر بن الحرث وما كان يشترى من أحاديث الأعاجم، ويشغل الناس بها عن استماع القرآن.\n\nوالآية عامّة في كل ما كان مضارّا لدين الله. فإن قلت: ما معنى ثم في قوله ثُمَّ يُصِرُّ مُسْتَكْبِراً؟\n\nقلت: كمعناه في قول القائل:\n\nيرى غمرات الموت ثمّ يزورها\n\nوذلك أنّ غمرات الموت حقيقة، بأن ينجو رائيها بنفسه ويطلب الفرار عنها. وأمّا زيارتها والإقدام على مزاولتها. فأمر مستبعد، فمعنى ثم: الإيذان بأن فعل المقدّم عليها بعد ما رآها وعاينها، شيء يستبعد في العادات والطباع، وكذلك آيات الله الواضحة الناطقة بالحق، من تليت عليه وسمعها: كان مستبعدا في العقول إصراره على الضلالة عندها واستكباره عن الإيمان بها كَأَنْ مخففة، والأصل كأنه لم يسمعها: والضمير ضمير الشأن، كما في قوله:\n\nكأن ظبية تعطو إلى ناضر السّلم\n\nومحل الجملة النصب على الحال. أى: يصير مثل غير السامع وَإِذا بلغه شيء من آياتنا وعلم أنه منها اتَّخَذَها أى اتخذ الآيات هُزُواً ولم يقل: اتخذه، للإشعار بأنه إذا أحس بشيء من الكلام أنه من جملة الآيات التي أنزلها الله تعالى على محمد صلى الله عليه وسلم: خاض في الاستهزاء بجميع الآيات. ولم يقتصر على الاستهزاء بما بلغه، ويحتمل: وإذا علم من آياتنا شيئا يمكن أن يتشبث به المعاند ويجد له محملا يتسلق به على الطعن والغميزة: افترصه واتخذ آيات الله هزوا، وذلك نحو افتراص ابن الزبعرى قوله عز وجل إِنَّكُمْ وَما تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ ومغالطته رسول الله صلى الله عليه وسلم، وقوله: خصمتك. ويجوز أن يرجع الضمير إلى شيء، لأنه في معنى الآية كقول أبى العتاهية:\n\nنفسي بشيء من الدنيا معلّقة ... الله والقائم المهدي يكفيها\n\nحيث أراد عتبة. وقرئ: علم أُولئِكَ إشارة إلى كل أفاك أثيم، لشموله الأفاكين. والوراء اسم للجهة التي يواريها الشخص من خلف أو قدام. قال:\n\nأليس ورائي أن تراخت منيّتى ... أدب مع الولدان أزحف كالنّسر\n\nومنه قوله عز وجل مِنْ وَرائِهِمْ أى من قدّامهم ما كَسَبُوا من الأموال في رحلهم ومتاجرهم وَلا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ من الأوثان.","surah_id":45,"source_id":9},{"ayah_number":11,"ayah_text":"هذا هُدىً وَالَّذِينَ كَفَرُوا بِآياتِ رَبِّهِمْ لَهُمْ عَذابٌ مِنْ رِجْزٍ أَلِيمٌ (11)","text":"هذا إشارة إلى القرآن، يدل عليه قوله تعالى وَالَّذِينَ كَفَرُوا بِآياتِ رَبِّهِمْ لأنّ آيات ربهم هي القرآن، أى هذا القرآن كامل في الهداية، كما تقول: زيد رجل، تريد كامل في الرجولية.\n\nوأيما رجل. والرجز: أشد العذاب. وقرئ بجر أليم ورفعه.","surah_id":45,"source_id":9},{"ayah_number":12,"ayah_text":"اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ (12) وَسَخَّرَ لَكُمْ ما فِي السَّماواتِ وَما فِي الْأَرْضِ جَمِيعاً مِنْهُ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ (13)","text":"وَلِتَبْتَغُوا مِنْ فَضْلِهِ بالتجارة أو بالغوص على اللؤلؤ والمرجان واستخراج اللحم الطري وغير ذلك من منافع البحر. فإن قلت: ما معنى مِنْهُ في قوله جَمِيعاً مِنْهُ وما موقعها من الإعراب، قلت: هي واقعة موقع الحال، والمعنى: أنه سخر هذه الأشياء كائنة منه وحاصلة من عنده، يعنى: أنه مكوّنها وموجدها بقدرته وحكمته، ثم مسخرها لخلقه. ويجوز أن يكون خبر مبتدإ محذوف، تقديره: هي جميعا منه، وأن يكون وَسَخَّرَ لَكُمْ تأكيدا لقوله تعالى سَخَّرَ لَكُمْ ثم ابتدئ قوله: ما فِي السَّماواتِ وَما فِي الْأَرْضِ جَمِيعاً مِنْهُ وأن يكون ما فِي الْأَرْضِ مبتدأ، ومِنْهُ خبره. وقرأ ابن عباس رضى الله عنهما: منة، وقرأ سلمة بن محارب: منه، على أن يكون منه فاعل سخر على الإسناد المجازى. أو على أنه خبر مبتدإ محذوف، أى: ذلك.\n\nأو هو منه.","surah_id":45,"source_id":9},{"ayah_number":14,"ayah_text":"قُلْ لِلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْماً بِما كانُوا يَكْسِبُونَ (14) مَنْ عَمِلَ صالِحاً فَلِنَفْسِهِ وَمَنْ أَساءَ فَعَلَيْها ثُمَّ إِلى رَبِّكُمْ تُرْجَعُونَ (15)","text":"حذف المقول لأنّ الجواب دال عليه. والمعنى: قل لهم اغفروا يغفروا لا يَرْجُونَ أَيَّامَ اللَّهِ لا يتوقعون وقائع الله بأعدائه، من قولهم لوقائع العرب: أيام العرب. وقيل: لا يأملون الأوقات التي وقتها الله لثواب المؤمنين ووعدهم الفوز فيها. قيل: نزلت قبل آية القتال، ثم نسخ حكمها. وقيل: نزولها في عمر رضى الله عنه- وقد شتمه رجل من غفار فهمّ أن يبطش به.\n\nوعن سعيد بن المسيب: كنا بين يدي عمر بن الخطاب رضى الله عنه فقرأ قارئ هذه الآية، فقال عمر: ليجزي عمر بما صنع لِيَجْزِيَ تعليل الأمر بالمغفرة، أى: إنما أمروا بأن يغفروا لما أراده الله من توفيتهم جزاء مغفرتهم يوم القيامة. فإن قلت: قوله قَوْماً ما وجه تنكيره وإنما أراد الذين آمنوا وهم معارف؟ قلت: هو مدح لهم وثناء عليهم، كأنه قيل. ليجزي أيما قوم وقوما مخصوصين، لصبرهم وإغضائهم على أذى أعدائهم من الكفار، وعلى ما كانوا يجرعونهم من الغصص بِما كانُوا يَكْسِبُونَ من الثواب العظيم بكظم الغيظ واحتمال المكروه ومعنى قوله عمر: ليجزي عمر بما صنع: ليجزي بصبره واحتماله. وقوله لرسول الله صلى الله عليه وسلم عند نزول الآية: والذي بعثك بالحق لا ترى الغضب في وجهى. وقرئ: ليجزي قوما، أى: الله عز وجل. وليجزي قوم. وليجزي قوما، على معنى: وليجزي الجزاء قوما.","surah_id":45,"source_id":9},{"ayah_number":16,"ayah_text":"وَلَقَدْ آتَيْنا بَنِي إِسْرائِيلَ الْكِتابَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْناهُمْ مِنَ الطَّيِّباتِ وَفَضَّلْناهُمْ عَلَى الْعالَمِينَ (16) وَآتَيْناهُمْ بَيِّناتٍ مِنَ الْأَمْرِ فَمَا اخْتَلَفُوا إِلاَّ مِنْ بَعْدِ ما جاءَهُمُ الْعِلْمُ بَغْياً بَيْنَهُمْ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيامَةِ فِيما كانُوا فِيهِ يَخْتَلِفُونَ (17)","text":"الْكِتابَ التوراة وَالْحُكْمَ الحكمة والفقه. أو فصل الخصومات بين الناس، لأنّ الملك كان فيهم والنبوّة مِنَ الطَّيِّباتِ مما أحل الله لهم وأطاب من الأرزاق وَفَضَّلْناهُمْ عَلَى الْعالَمِينَ حيث لم نؤت غيرهم مثل ما آتيناهم بَيِّناتٍ آيات ومعجزات مِنَ الْأَمْرِ من أمر الدين، فما وقع بينهم الخلاف في الدين إِلَّا مِنْ بَعْدِ ما جاءَهُمُ ما هو موجب لزوال الخلاف وهو العلم. وإنما اختلفوا لبغى حدث بينهم، أو لعداوة وحسد.","surah_id":45,"source_id":9},{"ayah_number":18,"ayah_text":"ثُمَّ جَعَلْناكَ عَلى شَرِيعَةٍ مِنَ الْأَمْرِ فَاتَّبِعْها وَلا تَتَّبِعْ أَهْواءَ الَّذِينَ لا يَعْلَمُونَ (18) إِنَّهُمْ لَنْ يُغْنُوا عَنْكَ مِنَ اللَّهِ شَيْئاً وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ (19)","text":"عَلى شَرِيعَةٍ على طريقة ومنهاج مِنَ الْأَمْرِ من أمر الدين، فاتبع شريعتك الثابتة بالدلائل والحجج، ولا تتبع ما لا حجة عليه من أهواء الجهال. ودينهم المبنى على هوى وبدعة، وهم رؤساء قريش حين قالوا. ارجع إلى دين آبائك. ولا توالهم، إنما يوالى الظالمين من هو ظالم مثلهم، وأما المتقون: فوليهم الله وهم موالوه. وما أبين الفصل بين الولايتين.","surah_id":45,"source_id":9},{"ayah_number":20,"ayah_text":"هذا بَصائِرُ لِلنَّاسِ وَهُدىً وَرَحْمَةٌ لِقَوْمٍ يُوقِنُونَ (20)","text":"هذا القرآن بَصائِرُ لِلنَّاسِ جعل ما فيه من معالم الدين والشرائع بمنزلة البصائر في القلوب. كما جعل روحا وحياة وهو هدى من الضلالة، ورحمة من العذاب لمن آمن وأيقن.\n\nوقرئ: هذه بصائر، أى: هذه الآيات.","surah_id":45,"source_id":9},{"ayah_number":21,"ayah_text":"أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ سَواءً مَحْياهُمْ وَمَماتُهُمْ ساءَ ما يَحْكُمُونَ (21)","text":"أَمْ منقطعة. ومعنى الهمزة فيها إنكار الحسبان. والاجتراح: الاكتساب. ومنه الجوارح وفلان جارحة أهله، أى: كاسبهم أَنْ نَجْعَلَهُمْ أن نصيرهم. وهو من جعل المتعدي إلى مفعولين فأوّلهما الضمير، والثاني: الكاف، والجملة التي هي سَواءً مَحْياهُمْ وَمَماتُهُمْ بدل من الكاف، لأنّ الجملة تقع مفعولا ثانيا، فكانت في حكم المفرد. ألا تراك لو قلت: أن نجعلهم سواء محياهم ومماتهم: كان سديدا، كما تقول: ظننت زبدا أبوه منطلق. ومن قرأ سَواءً بالنصب: أجرى سواء مجرى مستويا، وارتفع محياهم ومماتهم على الفاعلية، وكان مفردا غير جملة. ومن قرأ:\n\nومماتهم بالنصب، جعل محياهم ومماتهم: ظرفين، كمقدم الحاج وخفوق النجم. أى: سواء في محياهم وفي مماتهم. والمعنى: إنكار أن يستوي المسيئون والمحسنون محيا، وأن يستووا مماتا، لافتراق أحوالهم أحياء. حيث عاش هؤلاء على القيام بالطاعات، وأولئك على ركوب المعاصي. ومماتا، حيث مات هؤلاء على البشرى بالرحمة والوصول إلى ثواب الله ورضوانه، وأولئك على اليأس من رحمة الله والوصول إلى هول ما أعدّ لهم. وقيل: معناه إنكار أن يستووا في الممات كما استووا في الحياة، لأنّ المسيئين والمحسنين مستو محياهم في الرزق والصحة، وإنما يفترقون في الممات، وقيل: سواء محياهم ومماتهم: كلام مستأنف على معنى: أن محيا المسيئين ومماتهم سواء، وكذلك محيا المحسنين ومماتهم: كل يموت على حسب ما عاش عليه. وعن تميم الداري رضى الله عنه أنه كان يصلى ذات ليلة عند المقام، فبلغ هذه الآية، فجعل يبكى ويردّد إلى الصباح: ساء ما يحكمون.\n\nوعن الفضيل: أنه بلغها فجعل يردّدها ويبكى ويقول: يا فضيل، ليت شعري من أى الفريقين أنت.","surah_id":45,"source_id":9},{"ayah_number":22,"ayah_text":"وَخَلَقَ اللَّهُ السَّماواتِ وَالْأَرْضَ بِالْحَقِّ وَلِتُجْزى كُلُّ نَفْسٍ بِما كَسَبَتْ وَهُمْ لا يُظْلَمُونَ (22)","text":"وَلِتُجْزى معطوف على بالحق، لأنّ فيه معنى التعليل. أو على معلل محذوف تقديره:\n\nخلق الله السماوات والأرض، ليدل به على قدرته ولتجزى كل نفس.","surah_id":45,"source_id":9},{"ayah_number":23,"ayah_text":"أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلهَهُ هَواهُ وَأَضَلَّهُ اللَّهُ عَلى عِلْمٍ وَخَتَمَ عَلى سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلى بَصَرِهِ غِشاوَةً فَمَنْ يَهْدِيهِ مِنْ بَعْدِ اللَّهِ أَفَلا تَذَكَّرُونَ (23)","text":"\nأى: هو مطواع لهوى النفس يتبع ما تدعوه إليه، فكأنه يعبده كما يعبد الرجل إلهه.\n\nوقرئ: آلهة هواه، لأنه كان يستحسن الحجر فيعبده، فإذا رأى ما هو أحسن رفضه إليه، فكأنه اتخذ هواه آلهة شتى: يعبد كل وقت واحدا منها وَأَضَلَّهُ اللَّهُ عَلى عِلْمٍ وتركه عن الهداية واللطف وخذله على علم، عالما بأنّ ذلك لا يجدى عليه، وأنه ممن لا لطف له.\n\nأو مع علمه بوجوه الهداية وإحاطته بأنواع الألطاف المحصلة والمقرّبة فَمَنْ يَهْدِيهِ مِنْ بَعْدِ إضلال اللَّهُ وقرئ: غشاوة، بالحركات الثلاث. وغشوة، بالكسر والفتح.\n\nوقرئ: تتذكرون","surah_id":45,"source_id":9},{"ayah_number":24,"ayah_text":"وَقالُوا ما هِيَ إِلاَّ حَياتُنَا الدُّنْيا نَمُوتُ وَنَحْيا وَما يُهْلِكُنا إِلاَّ الدَّهْرُ وَما لَهُمْ بِذلِكَ مِنْ عِلْمٍ إِنْ هُمْ إِلاَّ يَظُنُّونَ (24)","text":"نَمُوتُ وَنَحْيا نموت نحن ويحيا أولادنا. أو يموت بعض ويحيا بعض. أو نكون مواتا نطفا في الأصلاب، ونحيا بعد ذلك. أو يصيبنا الأمران: الموت والحياة، يريدون: الحياة في الدنيا والموت بعدها، وليس وراء ذلك حياة. وقرئ: نحيا، بضم النون. وقرئ: إلا دهر يمرّ، وما يقولون ذلك عن علم، ولكن عن ظنّ وتخمين: كانوا يزعمون أنّ مرور الأيام والليالي هو المؤثر في هلاك الأنفس، وينكرون ملك الموت وقبضه الأرواح بأمر الله، وكانوا يضيفون كل حادثة تحدث إلى الدهر والزمان، وترى أشعارهم ناطقة بشكوى الزمان.\n\nومنه قوله عليه السلام: «لا تسبوا الدهر، فإنّ الله هو الدهر» أى: فإنّ الله هو الآتي بالحوادث لا الدهر.","surah_id":45,"source_id":9},{"ayah_number":25,"ayah_text":"وَإِذا تُتْلى عَلَيْهِمْ آياتُنا بَيِّناتٍ ما كانَ حُجَّتَهُمْ إِلاَّ أَنْ قالُوا ائْتُوا بِآبائِنا إِنْ كُنْتُمْ صادِقِينَ (25) قُلِ اللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلى يَوْمِ الْقِيامَةِ لا رَيْبَ فِيهِ وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (26)","text":"وقرئ: حجتهم بالنصب والرفع، على تقديم خبر كان وتأخيره. فإن قلت: لم سمى قولهم حجة وليس بحجة؟ قلت: لأنهم أدلوا به كما يدلى المحتج بحجته وساقوه مساقها، فسميت حجة على سبيل التهكم. أو لأنه في حسبانهم وتقديرهم حجة. أو لأنه في أسلوب قوله:\n\nتحيّة بينهم ضرب وجيع\n\nكأنه قيل: ما كان حجتهم إلا ما ليس بحجة. والمراد: نفى أن تكون لهم حجة البتة. فإن قلت:\n\nكيف وقع قوله قُلِ اللَّهُ يُحْيِيكُمْ جوابا لقولهم ائْتُوا بِآبائِنا إِنْ كُنْتُمْ صادِقِينَ؟ قلت: لما أنكروا البعث وكذبوا الرسل، وحسبوا أنّ ما قالوه قول مبكت. ألزموا ما هو مقرّون به:\n\nمن أنّ الله عز وجل هو الذي يحييهم ثم يميتهم، وضم إلى إلزام ذلك إلزام ما هو واجب الإقرار به إن أنصفوا وأصغوا إلى داعى الحق، وهو جمعهم إلى يوم القيامة، ومن كان قادرا على ذلك كان قادرا على الإتيان بآبائهم، وكان أهون شيء عليه.","surah_id":45,"source_id":9},{"ayah_number":27,"ayah_text":"وَلِلَّهِ مُلْكُ السَّماواتِ وَالْأَرْضِ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ (27) وَتَرى كُلَّ أُمَّةٍ جاثِيَةً كُلُّ أُمَّةٍ تُدْعى إِلى كِتابِهَا الْيَوْمَ تُجْزَوْنَ ما كُنْتُمْ تَعْمَلُونَ (28) هذا كِتابُنا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ إِنَّا كُنَّا نَسْتَنْسِخُ ما كُنْتُمْ تَعْمَلُونَ (29) فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحاتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِي رَحْمَتِهِ ذلِكَ هُوَ الْفَوْزُ الْمُبِينُ (30) وَأَمَّا الَّذِينَ كَفَرُوا أَفَلَمْ تَكُنْ آياتِي تُتْلى عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْماً مُجْرِمِينَ (31)","text":"عامل النصب في يَوْمَ تَقُومُ يخسر، ويَوْمَئِذٍ بدل من يَوْمَ تَقُومُ جاثِيَةً باركة مستوفزة على الركب. وقرئ: جاذية. والجذوّ: أشد استيفازا من الجثوّ، لأن الجاذى هو الذي يجلس على أطراف أصابعه: وعن ابن عباس رضى الله عنهما: جاثية مجتمعة. وعن قتادة:\n\nجماعات من الجثوة، وهي الجماعة، وجمعها: جثى. وفي الحديث «من جثى جهنم» وقرئ كُلَّ أُمَّةٍ على الابتداء: وكل أمة: على الإبدال من كل أمة إِلى كِتابِهَا إلى صحائف أعمالها، فاكتفى باسم الجنس، كقوله تعالى وَوُضِعَ الْكِتابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ.\n\nالْيَوْمَ تُجْزَوْنَ محمول على القول. فإن قلت: كيف أضيف الكتاب إليهم وإلى الله عزّ وجل؟ قلت: الإضافة تكون للملابسة، وقد لا بسهم ولا بسه، أما ملابسته إياهم، فلأن أعمالهم مثبتة فيه. وأما ملابسته إياه، فلأنه مالكه، والآمر ملائكته أن يكتبوا فيه أعمال عباده يَنْطِقُ عَلَيْكُمْ يشهد عليكم بما عملتم بِالْحَقِّ من غير زيادة ولا نقصان إِنَّا كُنَّا نَسْتَنْسِخُ الملائكة ما كُنْتُمْ تَعْمَلُونَ أى نستكتبهم أعمالكم فِي رَحْمَتِهِ في جنته. وجواب أما محذوف تقديره: وأما الذين كفروا فيقال لهم أَفَلَمْ تَكُنْ آياتِي تُتْلى عَلَيْكُمْ والمعنى ألم يأتكم رسلي فلم تكن آياتي تتلى عليكم، فحذف المعطوف عليه.","surah_id":45,"source_id":9},{"ayah_number":32,"ayah_text":"وَإِذا قِيلَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَالسَّاعَةُ لا رَيْبَ فِيها قُلْتُمْ ما نَدْرِي مَا السَّاعَةُ إِنْ نَظُنُّ إِلاَّ ظَنًّا وَما نَحْنُ بِمُسْتَيْقِنِينَ (32) وَبَدا لَهُمْ سَيِّئاتُ ما عَمِلُوا وَحاقَ بِهِمْ ما كانُوا بِهِ يَسْتَهْزِؤُنَ (33)","text":"وقرئ: والساعة، بالنصب عطفا على الوعد، وبالرفع عطفا على محل إن واسمها مَا السَّاعَةُ أىّ شيء الساعة؟ فإن قلت: ما معنى إِنْ نَظُنُّ إِلَّا ظَنًّا؟ قلت: أصله نظن ظنا.\n\nومعناه: إثبات الظن فحسب، فأدخل حرفا النفي والاستثناء، ليفاد إثبات الظن مع نفى ما سواء وزيد نفى ما سوى الظن توكيدا بقوله وَما نَحْنُ بِمُسْتَيْقِنِينَ...... سَيِّئاتُ ما عَمِلُوا أى قبائح أعمالهم. أو عقوبات أعمالهم السيئات، كقوله تعالى وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها.\n","surah_id":45,"source_id":9},{"ayah_number":34,"ayah_text":"وَقِيلَ الْيَوْمَ نَنْساكُمْ كَما نَسِيتُمْ لِقاءَ يَوْمِكُمْ هذا وَمَأْواكُمُ النَّارُ وَما لَكُمْ مِنْ ناصِرِينَ (34) ذلِكُمْ بِأَنَّكُمُ اتَّخَذْتُمْ آياتِ اللَّهِ هُزُواً وَغَرَّتْكُمُ الْحَياةُ الدُّنْيا فَالْيَوْمَ لا يُخْرَجُونَ مِنْها وَلا هُمْ يُسْتَعْتَبُونَ (35)","text":"نَنْساكُمْ نترككم في العذاب كما تركتم عدة لِقاءَ يَوْمِكُمْ هذا وهي الطاعة، أو نجعلكم بمنزلة الشيء المنسى غير المبالى به، كما لم تبالوا أنتم بلقاء يومكم ولم تخطروه ببال، كالشىء الذي يطرح نسيا منسيا. فإن قلت: فما معنى إضافة اللقاء إلى اليوم؟ قلت: كمعنى إضافة المكر في قوله تعالى بَلْ مَكْرُ اللَّيْلِ وَالنَّهارِ أى نسيتم لقاء الله في يومكم هذا ولقاء جزائه. وقرئ: لا يخرجون، يفتح الياء وَلا هُمْ يُسْتَعْتَبُونَ ولا يطلب منهم أن يعتبوا ربهم أى يرضوه.","surah_id":45,"source_id":9},{"ayah_number":36,"ayah_text":"فَلِلَّهِ الْحَمْدُ رَبِّ السَّماواتِ وَرَبِّ الْأَرْضِ رَبِّ الْعالَمِينَ (36) وَلَهُ الْكِبْرِياءُ فِي السَّماواتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (37)","text":"فَلِلَّهِ الْحَمْدُ فاحمدوا الله لذي هو ربكم ورب كل شيء من السماوات والأرض والعالمين، فان مثل هذه الربوبية العامة يوجب الحمد والثناء على كل مربوب، وكبروه فقد ظهرت آثار كبريائه وعظمته فِي السَّماواتِ وَالْأَرْضِ وحق مثله أن يكبر ويعظم.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ حم الجاثية ستر الله عورته وسكن روعته يوم الحساب».","surah_id":45,"source_id":9}]