[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"مدنية، وهي تسع وعشرون آية [نزلت بعد الزلزلة] بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":57,"source_id":9},{"ayah_number":1,"ayah_text":"سَبَّحَ لِلَّهِ ما فِي السَّماواتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1) لَهُ مُلْكُ السَّماواتِ وَالْأَرْضِ يُحْيِي وَيُمِيتُ وَهُوَ عَلى كُلِّ شَيْءٍ قَدِيرٌ (2) هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْباطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ (3) هُوَ الَّذِي خَلَقَ السَّماواتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوى عَلَى الْعَرْشِ يَعْلَمُ ما يَلِجُ فِي الْأَرْضِ وَما يَخْرُجُ مِنْها وَما يَنْزِلُ مِنَ السَّماءِ وَما يَعْرُجُ فِيها وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وَاللَّهُ بِما تَعْمَلُونَ بَصِيرٌ (4) لَهُ مُلْكُ السَّماواتِ وَالْأَرْضِ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ (5) يُولِجُ اللَّيْلَ فِي النَّهارِ وَيُولِجُ النَّهارَ فِي اللَّيْلِ وَهُوَ عَلِيمٌ بِذاتِ الصُّدُورِ (6)","text":"جاء في بعض الفواتح سَبَّحَ على لفظ الماضي، وفي بعضها على لفظ المضارع، وكل واحد منهما معناه: أنّ من شأن من أسند إليه التسبيح أن يسبحه، وذلك هجيراه وديدنه، وقد عدى هذا الفعل باللام تارة وبنفسه أخرى في قوله تعالى وَتُسَبِّحُوهُ وأصله: التعدي بنفسه، لأنّ معنى سبحته: بعدته عن السوء، منقول من سبح إذا ذهب وبعد، فاللام لا تخلو إما أن تكون مثل اللام في: نصحته، ونصحت له. وإما أن يراد بسبح لله: أحدث التسبيح لأجل الله ولوجهه خالصا، ما فِي السَّماواتِ وَالْأَرْضِ ما يتأتى منه التسبيح ويصح. فإن قلت: ما محل يُحْيِي؟\n\nقلت: يجوز أن لا يكون له محل، ويكون جملة برأسها، كقوله لَهُ مُلْكُ السَّماواتِ وأن يكون مرفوعا على: هو يحيى ويميت، ومنصوبا حالا من المجرور في لَهُ والجار عاملا فيها. ومعناه:\n\nيحيى النطف والبيض والموتى يوم القيامة ويميت الأحياء هُوَ الْأَوَّلُ هو القديم الذي كان قبل كل شيء وَالْآخِرُ الذي يبقى بعد هلاك كل شيء وَالظَّاهِرُ بالأدلة الدالة عليه وَالْباطِنُ لكونه غير مدرك بالحواس. فإن قلت: فما معنى الواو؟ قلت الواو الأولى معناها الدلالة على أنه الجامع بين الصفتين الأولية والآخرية، والثالثة على أنه الجامع بين الظهور والخفاء. وأما الوسطى، فعلى أنه الجامع بين مجموع الصفتين الأوليين ومجموع الصفتين الأخريين، فهو المستمر الوجود في جميع الأوقات الماضية والآتية، وهو في جميعها ظاهر وباطن: جامع للظهور بالأدلة والخفاء، فلا يدرك بالحواس. وفي هذا حجة على من جوّز إدراكه في الآخرة بالحاسة. وقيل: الظاهر العالي على كل شيء الغالب له، من ظهر عليه إذا علاه وغلبه. والباطن الذي بطن كل شيء، أى علم باطنه، وليس بذاك مع العدول عن الظاهر المفهوم.\n","surah_id":57,"source_id":9},{"ayah_number":7,"ayah_text":"آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فَالَّذِينَ آمَنُوا مِنْكُمْ وَأَنْفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ (7) وَما لَكُمْ لا تُؤْمِنُونَ بِاللَّهِ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثاقَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ (8)","text":"مُسْتَخْلَفِينَ فِيهِ يعنى أن الأموال التي في أيديكم إنما هي أموال الله بخلقه وإنشائه لها، وإنما موّلكم إياها، وخوّلكم الاستمتاع بها، وجعلكم خلفاء في التصرف فيها، فليست هي بأموالكم في الحقيقة. وما أنتم فيها إلا بمنزلة الوكلاء والنوّاب، فأنفقوا منها في حقوق الله، وليهن عليكم الإنفاق منها كما يهون على الرجل النفقة من مال غيره إذا أذن له فيه. أو جعلكم مستخلفين ممن كان قبلكم فيما في أيديكم: بتوريثه إياكم، فاعتبروا بحالهم حيث انتقل منهم إليكم، وسينقل منكم إلى من بعدكم، فلا تبخلوا به، وانفعوا بالإنفاق منها أنفسكم لا تُؤْمِنُونَ حال من معنى الفعل في مالكم، كما تقول: مالك قائما، بمعنى: ما تصنع قائما، أى: وما لكم كافرين بالله. والواو في وَالرَّسُولُ يَدْعُوكُمْ واو الحال، فهما حالان متداخلتان. وقرئ:\n\nوَما لَكُمْ لا تُؤْمِنُونَ بِاللَّهِ وَالرَّسُولُ يَدْعُوكُمْ والمعنى: وأى عذر لكم في ترك الإيمان والرسول يدعوكم إليه وينبهكم عليه ويتلو عليكم الكتاب الناطق بالبراهين والحجج، وقبل ذلك قد أخذ الله ميثاقكم بالإيمان: حيث ركب فيكم العقول، ونصب لكم الأدلة، ومكنكم من النظر، وأزاح عللكم، فإذ لم تبق لكم علة بعد أدلة العقول وتنبيه الرسول، فما لكم لا تؤمنون إِنْ كُنْتُمْ مُؤْمِنِينَ لموجب ما، فإن هذا الموجب لا مزيد عليه. وقرئ: أخذ ميثاقكم، على البناء للفاعل، وهو الله عز وجل.","surah_id":57,"source_id":9},{"ayah_number":9,"ayah_text":"هُوَ الَّذِي يُنَزِّلُ عَلى عَبْدِهِ آياتٍ بَيِّناتٍ لِيُخْرِجَكُمْ مِنَ الظُّلُماتِ إِلَى النُّورِ وَإِنَّ اللَّهَ بِكُمْ لَرَؤُفٌ رَحِيمٌ (9)","text":"لِيُخْرِجَكُمْ الله بآياته من ظلمات الكفر إلى نور الإيمان. أو ليخرجكم الرسول بدعوته\n\n لَرَؤُفٌ وقرئ لرؤوف.","surah_id":57,"source_id":9},{"ayah_number":10,"ayah_text":"وَما لَكُمْ أَلاَّ تُنْفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيراثُ السَّماواتِ وَالْأَرْضِ لا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقاتَلَ أُولئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَقاتَلُوا وَكُلاًّ وَعَدَ اللَّهُ الْحُسْنى وَاللَّهُ بِما تَعْمَلُونَ خَبِيرٌ (10) مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضاً حَسَناً فَيُضاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ (11)","text":"وَما لَكُمْ أَلَّا تُنْفِقُوا في أن لا تنفقوا وَلِلَّهِ مِيراثُ السَّماواتِ وَالْأَرْضِ يرث كل شيء فيهما لا يبقى منه باق لأحد من مال وغيره، يعنى: وأى غرض لكم في ترك الإنفاق في سبيل الله والجهاد مع رسوله والله مهلككم فوارث أموالكم، وهو من أبلغ البعث على الإنفاق في سبيل الله. ثم بين التفاوت بين المنفقين منهم فقال لا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ قبل فتح مكة قبل عز الإسلام وقوّة أهله ودخول الناس في دين الله أفواجا وقلة الحاجة إلى القتال والنفقة فيه، ومن أنفق من بعد الفتح فحذف لوضوح الدلالة أُولئِكَ الذين أنفقوا قبل الفتح وهم السابقون الأولون من المهاجرين والأنصار الذين قال فيهم النبي صلى الله عليه وسلم:\n\n«لو أنفق أحدكم مثل أحد ذهبا ما بلغ مدّ أحدهم ولا نصيفه» أَعْظَمُ دَرَجَةً. وقرئ:\n\nقبل الفتح وَكُلًّا وكل واحد من الفريقين وَعَدَ اللَّهُ الْحُسْنى أى المثوبة الحسنى وهي الجنة مع تفاوت الدرجات. وقرئ بالرفع على: وكل وعده الله. وقيل: نزلت في أبى بكر رضى الله عنه، لأنه أول من أسلم وأول من أنفق في سبيل الله. القرض الحسن: الإنفاق في سبيله. شبه ذلك بالقرض على سبيل المجاز، لأنه إذا أعطى ماله لوجهه فكأنه أقرضه إياه فَيُضاعِفَهُ لَهُ أى يعطيه أجره على إنفاقه مضاعفا «أضعافا» من فضله وَلَهُ أَجْرٌ كَرِيمٌ يعنى: وذلك الأجر المضموم إليه الأضعاف كريم في نفسه. وقرئ: فيضعفه. وقرئا منصوبين على جواب الاستفهام «والرفع عطف على يُقْرِضُ، أو على فَيُضاعِفَهُ.","surah_id":57,"source_id":9},{"ayah_number":12,"ayah_text":"يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِناتِ يَسْعى نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَبِأَيْمانِهِمْ بُشْراكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهارُ خالِدِينَ فِيها ذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ (12)","text":"يَوْمَ تَرَى ظرف لقوله: وله أجر كريم. أو منصوب بإضمار «اذكر» تعظيما لذلك اليوم. وإنما قال بَيْنَ أَيْدِيهِمْ وَبِأَيْمانِهِمْ لأنّ السعداء يؤتون صحائف أعمالهم من هاتين الجهتين، كما أن الأشقياء يؤتونها من شمائلهم ومن وراء ظهورهم، فجعل النور في الجهتين شعارا لهم وآية، لأنهم هم الذين بحسناتهم سعدوا وبصحائفهم البيض أفلحوا، فإذا ذهب بهم إلى الجنة ومروا على الصراط يسعون: سعى بسعيهم ذلك النور جنيبا لهم ومتقدما. ويقول لهم الذين يتلقونهم من الملائكة. بُشْراكُمُ الْيَوْمَ. وقرئ: ذلك الفوز.","surah_id":57,"source_id":9},{"ayah_number":13,"ayah_text":"يَوْمَ يَقُولُ الْمُنافِقُونَ وَالْمُنافِقاتُ لِلَّذِينَ آمَنُوا انْظُرُونا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَراءَكُمْ فَالْتَمِسُوا نُوراً فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بابٌ باطِنُهُ فِيهِ الرَّحْمَةُ وَظاهِرُهُ مِنْ قِبَلِهِ الْعَذابُ (13) يُنادُونَهُمْ أَلَمْ نَكُنْ مَعَكُمْ قالُوا بَلى وَلكِنَّكُمْ فَتَنْتُمْ أَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمانِيُّ حَتَّى جاءَ أَمْرُ اللَّهِ وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ (14) فَالْيَوْمَ لا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَلا مِنَ الَّذِينَ كَفَرُوا مَأْواكُمُ النَّارُ هِيَ مَوْلاكُمْ وَبِئْسَ الْمَصِيرُ (15)","text":"يَوْمَ يَقُولُ بدل من يوم ترى انْظُرُونا انتظرونا، لأنهم يسرع بهم إلى الجنة كالبروق الخاطفة على ركاب تزف بهم. وهؤلاء مشاة. وانظروا إلينا، لأنهم إذا نظروا اليهم استقبلوهم بوجوههم والنور بين أيديهم فيستضيئون به. وقرئ: أنظرونا من النظرة وهي الإمهال: جعل اتئادهم في المضي إلى أن يلحقوا بهم إنظارا لهم نَقْتَبِسْ مِنْ نُورِكُمْ نصب منه، وذلك أن يلحقوا بهم فيستنيروا به قِيلَ ارْجِعُوا وَراءَكُمْ فَالْتَمِسُوا نُوراً طرد لهم وتهكم بهم، أى: ارجعوا إلى الموقف إلى حيث أعطينا هذا النور فالتمسوه هنالك، فمن ثم يقتبس. أو ارجعوا إلى الدنيا، فالتمسوا نورا بتحصيل سببه وهو الإيمان. أو ارجعوا خائبين وتنحوا عنا، فالتمسوا نورا آخر، فلا سبيل لكم إلى هذا النور، وقد علموا أن لا نور وراءهم، وإنما هو تخييب وإقناط لهم فَضُرِبَ بَيْنَهُمْ بِسُورٍ بين المؤمنين والمنافقين بحائط حائل بين شق الجنة وشق النار. وقيل: هو الأعراف لذلك السور بابٌ لأهل الجنة يدخلون منه باطِنُهُ باطن السور أو الباب، وهو الشق الذي بلى الجنة وَظاهِرُهُ ما ظهر لأهل النار مِنْ قِبَلِهِ من عنده ومن جهته الْعَذابُ وهو الظلمة والنار. وقرأ زيد بن على رضى الله عنهما: فضرب بينهم على البناء للفاعل أَلَمْ نَكُنْ مَعَكُمْ يريدون موافقتهم في الظاهر فَتَنْتُمْ أَنْفُسَكُمْ محنتموها بالنفاق وأهلكتموها وَتَرَبَّصْتُمْ بالمؤمنين الدوائر وَغَرَّتْكُمُ الْأَمانِيُّ طول الآمال والطمع في امتداد الأعمار حَتَّى جاءَ أَمْرُ اللَّهِ وهو الموت وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ وغرّكم الشيطان بأنّ الله عفوّ كريم لا يعذبكم. وقرئ: الغرور، بالضم فِدْيَةٌ ما يفتدى به هِيَ مَوْلاكُمْ قيل: هي أولى بكم، وأنشد قول لبيد:\n\nفندت كلا الفرجين تحسب أنّه ... مولى المخافة خلفها وأمامها\n\nوحقيقة مولاكم: محراكم ومقمنكم . أى: مكانكم الذي يقال فيه هو أولى بكم، كما قيل: هو مئنة للكرم، أى مكان، لقول القائل: إنه لكريم. ويجوز أن يراد: هي ناصركم، أى لا ناصر لكم غيرها. والمراد: نفى الناصر على البتات. ونحوه قولهم: أصيب فلان بكذا فاستنصر الجزع . ومنه قوله تعالى يُغاثُوا بِماءٍ كَالْمُهْلِ وقيل: تتولاكم كما توليتم في الدنيا أعمال أهل النار.","surah_id":57,"source_id":9},{"ayah_number":16,"ayah_text":"أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَما نَزَلَ مِنَ الْحَقِّ وَلا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتابَ مِنْ قَبْلُ فَطالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِنْهُمْ فاسِقُونَ (16)","text":"أَلَمْ يَأْنِ من أنى الأمر يأنى، إذا جاء إناه، أى. وقته. وقرئ: ألم يئن، من آن يئين بمعنى: أنى يأنى، وألما يأن، قيل: كانوا مجدبين بمكة، فلما هاجروا أصابوا الرزق والنعمة ففتروا عما كانوا عليه، فنزلت. وعن ابن مسعود: ما كان بين إسلامنا وبين أن عوتبنا بهذه الآية إلا أربع سنين . وعن ابن عباس رضى الله عنهما: أنّ الله استبطأ قلوب المؤمنين فعاتبهم على رأس ثلاث عشرة من نزول القرآن. وعن الحسن رضى الله عنه: أما والله لقد استبطأهم وهم يقرؤن من القرآن أقل مما تقرءون. فانظروا في طول ما قرأتم منه وما ظهر فيكم من الفسق.\n\nوعن أبى بكر رضى الله عنه أنّ هذه الآية قرئت بين يديه وعنده قوم من أهل اليمامة، فبكوا بكاء شديدا، فنظر إليهم فقال: هكذا كنا حتى قست القلوب. وقرئ: نزّل ونزل. وأنزل وَلا يَكُونُوا عطف على تخشع، وقرئ بالتاء على الالتفات. ويجوز أن يكون نهيا لهم عن مماثلة أهل الكتاب في قسوة القلوب بعد أن وبخوا، وذلك أنّ بنى إسرائيل كان الحق يحول بينهم وبين شهواتهم، وإذا سمعوا التوراة والإنجيل خشعوا لله ورقت قلوبهم، فلما طال عليهم الزمان غلبهم الجفاء والقسوة واختلفوا وأحدثوا ما أحدثوا من التحريف وغيره. فإن قلت:\n\nما معنى لِذِكْرِ اللَّهِ وَما نَزَلَ مِنَ الْحَقِّ؟ قلت: يجوز أن يراد بالذكر وبما نزل من الحق: القرآن، لأنه جامع للأمرين: للذكر والموعظة، وأنه حق نازل من السماء، وأن يراد خشوعها إذا ذكر الله وإذا تلى القرآن كقوله تعالى إِذا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذا تُلِيَتْ عَلَيْهِمْ آياتُهُ زادَتْهُمْ إِيماناً أراد بالأمد: الأجل، كقوله:\n\n...... إذا انتهى أمده\n\nوقرئ: الأمدّ، أى: الوقت الأطول وَكَثِيرٌ مِنْهُمْ فاسِقُونَ خارجون عن دينهم رافضون لما في الكتابين.","surah_id":57,"source_id":9},{"ayah_number":17,"ayah_text":"اعْلَمُوا أَنَّ اللَّهَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِها قَدْ بَيَّنَّا لَكُمُ الْآياتِ لَعَلَّكُمْ تَعْقِلُونَ (17)","text":"اعْلَمُوا أَنَّ اللَّهَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِها قيل: هذا تمثيل لأثر الذكر في القلوب، وأنه يحييها كما يحيى الغيث الأرض.","surah_id":57,"source_id":9},{"ayah_number":18,"ayah_text":"إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقاتِ وَأَقْرَضُوا اللَّهَ قَرْضاً حَسَناً يُضاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ (18)","text":"الْمُصَّدِّقِينَ المتصدّقين. وقرئ على الأصل. والمصدّقين من صدق، وهم الذين صدقوا الله ورسوله يعنى المؤمنين. فإن قلت: علام عطف قوله وَأَقْرَضُوا؟ قلت: على معنى الفعل في المصدّقين، لأنّ اللام بمعنى الذين، واسم الفاعل بمعنى اصدقوا، كأنه قيل: إنّ الذين اصدقوا وأقرضوا. والقرض الحسن: أنّ يتصدق من الطيب عن طيبة النفس وصحة النية على المستحق للصدقة. وقرئ: يضعف، ويضاعف، بكسر العين، أى: يضاعف الله.","surah_id":57,"source_id":9},{"ayah_number":19,"ayah_text":"وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولئِكَ هُمُ الصِّدِّيقُونَ وَالشُّهَداءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآياتِنا أُولئِكَ أَصْحابُ الْجَحِيمِ (19)","text":"يريد أنّ المؤمنين بالله ورسله هم عند الله بمنزلة الصديقين والشهداء: وهم الذين سبقوا إلى التصديق واستشهدوا في سبيل الله لَهُمْ أَجْرُهُمْ وَنُورُهُمْ أى: مثل أجر الصديقين والشهداء ومثل نورهم. فإن قلت: كيف يسوّى بينهم في الأجر ولا بدّ من التفاوت؟ قلت: المعنى أنّ الله يعطى المؤمنين أجرهم ويضاعفه لهم بفضله، حتى يساوى أجرهم مع أضعافه أجر أولئك.\n\nويجوز أن يكون وَالشُّهَداءُ مبتدأ، ولَهُمْ أَجْرُهُمْ خيره.","surah_id":57,"source_id":9},{"ayah_number":20,"ayah_text":"اعْلَمُوا أَنَّمَا الْحَياةُ الدُّنْيا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفاخُرٌ بَيْنَكُمْ وَتَكاثُرٌ فِي الْأَمْوالِ وَالْأَوْلادِ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَباتُهُ ثُمَّ يَهِيجُ فَتَراهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطاماً وَفِي الْآخِرَةِ عَذابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوانٌ وَمَا الْحَياةُ الدُّنْيا إِلاَّ مَتاعُ الْغُرُورِ (20)","text":"أراد أنّ الدنيا ليست إلا محقرات من الأمور وهي اللعب واللهو والزينة والتفاخر والتكاثر.\n\nوأما الآخرة فما هي إلا أمور عظام، وهي: العذاب الشديد والمغفرة ورضوان الله. وشبه حال الدنيا وسرعة تقضيها مع قلة جدواها بنبات أنبته الغيث فاستوى واكتهل\n\nوأعجب به الكفار الجاحدون لنعمة الله فيما رزقهم من الغيث والنبات، فبعث عليه العاهة فهاج واصفرّ وصار حطاما عقوبة لهم على جحودهم، كما فعل بأصحاب الجنة وصاحب الجنتين. وقيل الْكُفَّارَ:\n\nالزراع. وقرئ: مصفارا","surah_id":57,"source_id":9},{"ayah_number":21,"ayah_text":"سابِقُوا إِلى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُها كَعَرْضِ السَّماءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ذلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (21)","text":"سابِقُوا سارعوا مسارعة المسابقين لأقرانهم في المضمار، إلى جنة عَرْضُها كَعَرْضِ السَّماءِ وَالْأَرْضِ قال السدى: كعرض سبع السماوات وسبع الأرضين، وذكر العرض دون الطول، لأنّ كل ماله عرض وطول فإنّ عرضه أقل من طوله، فإذا وصف عرضه بالبسطة:\n\nعرف أنّ طوله أبسط وأمدّ. ويجوز أن يراد بالعرض: البسطة، كقوله تعالى فَذُو دُعاءٍ عَرِيضٍ لما حقر الدنيا وصغر أمرها وعظم أمر الآخرة: بعث عباده على المسارعة إلى نيل ما وعد من ذلك: وهي المغفرة المنجية من العذاب الشديد والفوز بدخول الجنة ذلِكَ الموعود من المغفرة والجنة فَضْلُ اللَّهِ عطاؤه يُؤْتِيهِ مَنْ يَشاءُ وهم المؤمنون.","surah_id":57,"source_id":9},{"ayah_number":22,"ayah_text":"ما أَصابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلا فِي أَنْفُسِكُمْ إِلاَّ فِي كِتابٍ مِنْ قَبْلِ أَنْ نَبْرَأَها إِنَّ ذلِكَ عَلَى اللَّهِ يَسِيرٌ (22) لِكَيْلا تَأْسَوْا عَلى ما فاتَكُمْ وَلا تَفْرَحُوا بِما آتاكُمْ وَاللَّهُ لا يُحِبُّ كُلَّ مُخْتالٍ فَخُورٍ (23) الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (24)","text":"المصيبة في الأرض: نحو الجدب وآفات الزروع والثمار. وفي الأنفس: نحو الأدواء والموت فِي كِتابٍ في اللوح مِنْ قَبْلِ أَنْ نَبْرَأَها يعنى الأنفس أو المصائب إِنَّ ذلِكَ إنّ تقدير ذلك وإثباته في كتاب عَلَى اللَّهِ يَسِيرٌ وإن كان عسيرا على العباد، ثم علل ذلك وبين الحكمة فيه فقال لِكَيْلا تَأْسَوْا ... وَلا تَفْرَحُوا يعنى أنكم إذا علمتم أنّ كل شيء مقدر مكتوب عند الله قلّ أساكم على الفائت وفرحكم على الآتي، لأنّ من علم أن ما عنده معقود لا محالة: لم يتفاقم جزعه عند فقده، لأنه وطن نفسه على ذلك، وكذلك من علم أنّ بعض الخير واصل إليه، وأن وصوله لا يفوته بحال: لم يعظم فرحه عند نيله وَاللَّهُ لا يُحِبُّ كُلَّ مُخْتالٍ فَخُورٍ لأنّ من فرح بحظ من الدنيا وعظم في نفسه: اختال وافتخر به وتكبر على الناس.\n\nقرئ: بما آتاكم. وأتاكم، من الإيتاء والإتيان. وفي قراءة ابن مسعود: بما أوتيتم. فإن قلت: فلا أحد يملك نفسه- عند مضرة تنزل به، ولا عند منفعة ينالها- أن لا يحزن ولا يفرح.\n\nقلت: المراد: الحزن المخرج إلى ما يذهل صاحبه عن الصبر والتسليم لأمر الله ورجاء ثواب الصابرين، والفرح المطغى الملهى عن الشكر، فأما الحزن الذي لا يكاد الإنسان يخلو منه مع الاستسلام، والسرور بنعمة الله والاعتداد بها مع الشكر: فلا بأس بهما الَّذِينَ يَبْخَلُونَ بدل من قوله كُلَّ مُخْتالٍ فَخُورٍ كأنه قال: لا يحب الذين يبخلون، يريد: الذين يفرحون الفرح المطغى إذا رزقوا مالا وحظا من الدنيا فلحبهم له وعزته عندهم وعظمه في عيونهم: يزوونه عن حقوق الله ويبخلون به، ولا يكفيهم أنهم بخلوا حتى يحملوا الناس على البخل ويرغبوهم في الإمساك ويزينوه لهم، وذلك كله نتيجة فرحهم به وبطرهم عند إصابته وَمَنْ يَتَوَلَّ عن أوامر الله ونواهيه ولم ينته عما نهى عنه من الأسى على الفائت والفرح بالآتى: فإنّ الله غنى عنه. وقرئ: بالبخل. وقرأ نافع: فإنّ الله الغنى، وهو في مصاحف أهل المدينة والشام كذلك.","surah_id":57,"source_id":9},{"ayah_number":25,"ayah_text":"لَقَدْ أَرْسَلْنا رُسُلَنا بِالْبَيِّناتِ وَأَنْزَلْنا مَعَهُمُ الْكِتابَ وَالْمِيزانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ وَأَنْزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللَّهُ مَنْ يَنْصُرُهُ وَرُسُلَهُ بِالْغَيْبِ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ (25)","text":"لَقَدْ أَرْسَلْنا رُسُلَنا يعنى الملائكة إلى الأنبياء بِالْبَيِّناتِ بالحجج والمعجزات وَأَنْزَلْنا مَعَهُمُ الْكِتابَ أى الوحى وَالْمِيزانَ روى أنّ جبريل عليه السلام نزل بالميزان فدفعه إلى نوح وقال: مر قومك يزنوا به وَأَنْزَلْنَا الْحَدِيدَ قيل: نزل آدم من الجنة ومعه خمسة أشياء من حديد: السندان، والكلبتان، والميقعة، والمطرقة\n\n، والإبرة. وروى: ومعه المر والمسحاة. وعن النبي صلى الله عليه وسلم: أنّ الله تعالى أنزل أربع بركات من السماء إلى الأرض:\n\nأنزل الحديد، والنار، والماء، والملح\n\n. وعن الحسن وَأَنْزَلْنَا الْحَدِيدَ: خلقناه، كقوله تعالى وَأَنْزَلَ لَكُمْ مِنَ الْأَنْعامِ وذلك أن أوامره تنزل من السماء وقضاياه وأحكامه فِيهِ بَأْسٌ شَدِيدٌ وهو القتال به وَمَنافِعُ لِلنَّاسِ في مصالحهم ومعايشهم وصنائعهم، فما من صناعة إلا والحديد آلة فيها، أو ما يعمل بالحديد وَلِيَعْلَمَ اللَّهُ مَنْ يَنْصُرُهُ وَرُسُلَهُ باستعمال السيوف والرماح وسائر السلاح في مجاهدة أعداء الدين بِالْغَيْبِ غائبا عنهم، قال ابن عباس رضى الله عنهما: ينصرونه ولا يبصرونه إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ غنى بقدرته وعزته في إهلاك من يريد هلاكه عنهم، وإنما كلفهم الجهاد لينتفعوا به ويصلوا بامتثال الأمر فيه إلى الثواب.","surah_id":57,"source_id":9},{"ayah_number":26,"ayah_text":"وَلَقَدْ أَرْسَلْنا نُوحاً وَإِبْراهِيمَ وَجَعَلْنا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتابَ فَمِنْهُمْ مُهْتَدٍ وَكَثِيرٌ مِنْهُمْ فاسِقُونَ (26)","text":"وَالْكِتابَ والوحى. وعن ابن عباس: الخط بالقلم، يقال: كتب كتابا وكتابة مِنْهُمْ فمن الذرية أو من المرسل إليهم، وقد دل عليهم ذكر الإرسال والمرسلين. وهذا تفصيل لحالهم، أى: فمنهم مهتد ومنهم فاسق، والغلبة للفساق.","surah_id":57,"source_id":9},{"ayah_number":27,"ayah_text":"ثُمَّ قَفَّيْنا عَلى آثارِهِمْ بِرُسُلِنا وَقَفَّيْنا بِعِيسَى ابْنِ مَرْيَمَ وَآتَيْناهُ الْإِنْجِيلَ وَجَعَلْنا فِي قُلُوبِ الَّذِينَ اتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبانِيَّةً ابْتَدَعُوها ما كَتَبْناها عَلَيْهِمْ إِلاَّ ابْتِغاءَ رِضْوانِ اللَّهِ فَما رَعَوْها حَقَّ رِعايَتِها فَآتَيْنَا الَّذِينَ آمَنُوا مِنْهُمْ أَجْرَهُمْ وَكَثِيرٌ مِنْهُمْ فاسِقُونَ (27)","text":"قرأ الحسن: الإنجيل، بفتح الهمزة، وأمره أهون من أمر البرطيل والسكينة فيمن رواهما بفتح الفاء، لأنّ الكلمة أعجمية لا يلزم فيها حفظ أبنية العرب. وقرئ: رآفة، على: فعالة، أى: وفقناهم للتراحم والتعاطف بينهم. ونحوه في صفة أصحاب رسول الله صلى الله عليه وسلم رُحَماءُ بَيْنَهُمْ. والرهبانية: ترهبهم في الجبال فارّين من الفتنة في الدين، مخلصين أنفسهم للعبادة، وذلك أنّ الجبابرة ظهروا على المؤمنين بعد موت عيسى، فقاتلوهم ثلاث مرات، فقتلوا حتى لم يبق منهم إلا القليل، فخافوا أن يفتنوا في دينهم، فاختاروا الرهبانية: ومعناها الفعلة المنسوبة إلى الرهبان،\n\nوهو الخائف: فعلان من رهب، كخشيان من خشي. وقرئ: ورهبانية بالضم، كأنها نسبة إلى الرهبان: وهو جمع راهب كراكب وركبان، وانتصابها بفعل مضمر\n\nيفسره الظاهر: تقديره. وابتدعوا رهبانية ابْتَدَعُوها يعنى: وأحدثوها من عند أنفسهم ونذروها ما كَتَبْناها عَلَيْهِمْ لم نفرضها نحن عليهم إِلَّا ابْتِغاءَ رِضْوانِ اللَّهِ استثناء منقطع، أى:\n\nولكنهم ابتدعوها ابتغاء رضوان الله فَما رَعَوْها حَقَّ رِعايَتِها كما يجب على الناذر رعاية نذره، لأنه عهد مع الله لا يحل نكثه فَآتَيْنَا الَّذِينَ آمَنُوا يريد: أهل الرحمة والرأفة الذين اتبعوا عيسى وَكَثِيرٌ مِنْهُمْ فاسِقُونَ الذين لم يحافظوا على نذرهم. ويجوز أن تكون الرهبانية معطوفة على ما قبلها، وابتدعوها: صفة لها في محل النصب، أى: وجعلنا في قلوبهم رأفة ورحمة ورهبانية مبتدعة من عندهم، بمعنى: وقفناهم للتراحم بينهم ولابتداع الرهبانية واستحداثها، ما كتبناها عليهم إلا ليبتغوا بها رضوان الله ويستحقوا بها الثواب، على أنه كتبها عليهم وألزمها إياهم ليتخلصوا من الفتن ويبتغوا بذلك رضا الله وثوابه، فما رعوها جميعا حق رعايتها، ولكن بعضهم، فآتينا المؤمنين المراعين منهم للرهبانية أجرهم، وكثير منهم فاسقون. وهم الذين لم يرعوها.","surah_id":57,"source_id":9},{"ayah_number":28,"ayah_text":"يا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُوراً تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ (28)","text":"يا أَيُّهَا الَّذِينَ آمَنُوا يجوز أن يكون خطابا للذين آمنوا من أهل الكتاب والذين آمنوا من غيرهم، فإن كان خطابا لمؤمنى أهل الكتاب. فالمعنى: يا أيها الذين آمنوا بموسى وعيسى آمنوا بمحمد يُؤْتِكُمْ الله كِفْلَيْنِ أى نصيبين مِنْ رَحْمَتِهِ لإيمانكم بمحمد وإيمانكم بمن قبله وَيَجْعَلْ لَكُمْ يوم القيامة نُوراً تَمْشُونَ بِهِ وهو النور المذكور في قوله يَسْعى نُورُهُمْ. وَيَغْفِرْ لَكُمْ ما أسلفتم من الكفر والمعاصي.","surah_id":57,"source_id":9},{"ayah_number":29,"ayah_text":"لِئَلاَّ يَعْلَمَ أَهْلُ الْكِتابِ أَلاَّ يَقْدِرُونَ عَلى شَيْءٍ مِنْ فَضْلِ اللَّهِ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (29)","text":"لِئَلَّا يَعْلَمَ ليعلم أَهْلُ الْكِتابِ الذين لم يسلموا، ولا مزيدة أَلَّا يَقْدِرُونَ أن مخففة من الثقيلة، أصله: أنه لا يقدرون، يعنى: أنّ الشأن لا يقدرون عَلى شَيْءٍ مِنْ فَضْلِ اللَّهِ أى: لا ينالون شيئا مما ذكر من فضله من الكفلين: والنور والمغفرة، لأنهم لم يؤمنوا برسول الله، فلم ينفعهم إيمانهم بمن قبله، ولم يكسبهم فضلا قط. وإن كان خطابا لغيرهم، فالمعنى:\n\nاتقوا الله واثبتوا على إيمانكم برسول الله يؤتكم ما وعد من آمن من أهل الكتاب من الكفلين في قوله أُولئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ ولا ينقصكم من مثل أجرهم، لأنكم مثلهم في الإيمانين لا تفرقون بين أحد من رسله. روى أنّ رسول الله صلى الله عليه وسلم بعث جعفرا رضى الله عنه في سبعين راكبا إلى النجاشي يدعوه، فقدم جعفر عليه فدعاه فاستجاب له، فقال ناس ممن آمن من أهل مملكته وهم أربعون رجلا. ائذن لنا في الوفادة على رسول الله صلى الله عليه وسلم، فأذن لهم فقدموا مع جعفر وقد تهيأ لوقعة أحد، فلما رأوا ما بالمسلمين من خصاصة: استأذنوا رسول الله صلى الله عليه وسلم، فرجعوا وقدموا بأموال لهم فآسوا بها المسلمين\n\n، فأنزل الله الَّذِينَ آتَيْناهُمُ الْكِتابَ ... إلى قوله ... وَمِمَّا رَزَقْناهُمْ يُنْفِقُونَ فلما سمع من لم يؤمن من أهل الكتاب قوله يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ فخروا على المسلمين وقالوا: أما من آمن بكتابكم وكتابنا فله أجره مرّتين، وأما من لم يؤمن بكتابكم فله أجر كأجركم، فما فضلكم علينا؟ فنزلت. وروى أنّ مؤمنى أهل الكتاب افتخروا على غيرهم من المؤمنين بأنهم يؤتون أجرهم مرّتين، وادعوا الفضل عليهم، فنزلت. وقرئ لكي يعلم. ولكيلا يعلم. وليعلم. ولأن يعلم: بإدغام النون في الياء. ولين يعلم: بقلب الهمزة ياء وإدغام النون في الياء. وعن الحسن: ليلا يعلم، بفتح اللام وسكون الياء. ورواه قطرب بكسر اللام. وقيل في وجهها: حذفت همزة أن، وأدغمت نونها في لام لا، فصار «للا» ثم أبدلت من اللام المدغمة ياء، كقولهم: ديوان، وقيراط. ومن فتح اللام فعلى أن أصل لام الجرّ الفتح، كما أنشد:\n\nأريد لأنسى ذكرها. .. وقرئ: أن لا يقدروا بِيَدِ اللَّهِ في ملكه وتصرفه. واليد مثل يُؤْتِيهِ مَنْ يَشاءُ ولا يشاء إلا إيتاء من يستحقه. عن رسول الله صلى الله عليه وسلم: «من قرأ سورة الحديد كتب من الذين آمنوا بالله ورسله».","surah_id":57,"source_id":9}]