[{"ayah_number":1,"ayah_text":"بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","text":"(مكية، غير ثلاث آيات في آخرها وتسمى سورة النعم، وهي مائة وثمان وعشرون آية [نزلت بعد سورة الكهف] ) بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ","surah_id":16,"source_id":9},{"ayah_number":1,"ayah_text":"أَتى أَمْرُ اللَّهِ فَلا تَسْتَعْجِلُوهُ سُبْحانَهُ وَتَعالى عَمَّا يُشْرِكُونَ (1)","text":"كانوا يستمجلون ما وعدوا من قيام الساعة أو نزول العذاب بهم يوم بدر، استهزاء وتكذيباً بالوعد، فقيل لهم أَتى أَمْرُ اللَّهِ الذي هو بمنزلة الآتي الواقع وإن كان منتظراً لقرب وقوعه فَلا تَسْتَعْجِلُوهُ روى أنه لما نزلت اقْتَرَبَتِ السَّاعَةُ قال الكفار فيما بينهم إن هذا يزعم أن القيامة قد قربت، فأمسكوا عن بعض ما تعملون حتى ننظر ما هو كائن، فلما تأخرت قالوا:\n\nما نرى شيئاً، فنزلت اقْتَرَبَ لِلنَّاسِ حِسابُهُمْ فأشفقوا وانتظروا قربها، فلما امتدت الأيام قالوا: يا محمد، ما نرى شيئاً مما تخوفنا به، فنزلت أَتى أَمْرُ اللَّهِ فوثب رسول الله صلى الله عليه وسلم ورفع الناس رؤوسهم، فنزلت فَلا تَسْتَعْجِلُوهُ فاطمأنوا وقرئ: تستعجلوه، بالتاء والياء سُبْحانَهُ وَتَعالى عَمَّا يُشْرِكُونَ تبرأ عز وجل عن أن يكون له شريك، وأن تكون آلهتهم له شركاء. أو عن إشراكهم، على أنّ «ما» موصولة أو مصدرية. فإن قلت: كيف اتصل هذا باستعجالهم؟ قلت: لأنّ استعجالهم استهزاء وتكذيب وذلك من الشرك. وقرئ: تشركون، بالتاء والياء.","surah_id":16,"source_id":9},{"ayah_number":2,"ayah_text":"يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلى مَنْ يَشاءُ مِنْ عِبادِهِ أَنْ أَنْذِرُوا أَنَّهُ لا إِلهَ إِلاَّ أَنَا فَاتَّقُونِ (2)","text":"قرئ يُنَزِّلُ بالتخفيف والتشديد. وقرئ تَنَزَّلُ الْمَلائِكَةُ أى تنزل بِالرُّوحِ مِنْ أَمْرِهِ بما يحيى القلوب الميتة بالجهل من وحيه، أو بما يقوم في الدين مقام الروح في الجسد، وأَنْ أَنْذِرُوا بدل من الروح، أى ينزلهم بأن أنذروا. وتقديره: بأنه أنذروا، أى: بأن الشأن أقول لكم أنذروا. أو تكون «أن» مفسرة، لأنّ تنزيل الملائكة بالوحي فيه معنى القول.\n\nومعنى أنذروا أَنَّهُ لا إِلهَ إِلَّا أَنَا أعلموا بأنّ الأمر ذلك، من نذرت بكذا إذا علمته. والمعنى:\n\nيقول لهم أعلموا الناس قولي لا إله إلا أنا فَاتَّقُونِ.\n\n","surah_id":16,"source_id":9},{"ayah_number":3,"ayah_text":"خَلَقَ السَّماواتِ وَالْأَرْضَ بِالْحَقِّ تَعالى عَمَّا يُشْرِكُونَ (3) خَلَقَ الْإِنْسانَ مِنْ نُطْفَةٍ فَإِذا هُوَ خَصِيمٌ مُبِينٌ (4)","text":"ثم دلّ على وحدانيته وأنه لا إله إلا هو بما ذكر، مما لا يقدر عليه غيره من خلق السموات والأرض وخلق الإنسان وما يصلحه، وما لا بدّ له منه من خلق البهائم لأكله وركوبه وجرّ أثقاله وسائر حاجاته، وخلق ما لا يعلمون من أصناف خلائقه، ومثله متعال عن أن يشرك به غيره. وقرئ: تشركون، بالتاء والياء فَإِذا هُوَ خَصِيمٌ مُبِينٌ فيه معنيان، أحدهما: فإذا هو منطيق مجادل عن نفسه مكافح للخصوم مبين للحجة، بعد ما كان نطفة من منىّ جماداً لا حس به ولا حركة، دلالة على قدرته. والثاني: فإذا هو خصيم لربه، منكر على خالقه، قائل: من يحيى العظام وهي رميم، وصفاً للإنسان بالإفراط في الوقاحة والجهل، والتمادي في كفران النعمة.\n\nوقيل نزلت في أبىّ بن خلف الجمحي حين جاء بالعظم الرميم إلى النبي صلى الله عليه وسلم فقال:\n\nيا محمد، أترى الله يحيى هذا بعد ما قد رمّ؟","surah_id":16,"source_id":9},{"ayah_number":5,"ayah_text":"وَالْأَنْعامَ خَلَقَها لَكُمْ فِيها دِفْءٌ وَمَنافِعُ وَمِنْها تَأْكُلُونَ (5)","text":"الْأَنْعامَ الأزواج الثمانية، وأكثر ما تقع على الإبل، وانتصابها بمضمر يفسره الظاهر، كقوله وَالْقَمَرَ قَدَّرْناهُ ويجوز أن يعطف على الإنسان، أى: خلق الإنسان والأنعام، ثم قال خَلَقَها لَكُمْ أى ما خلقها إلا لكم ولمصالحكم يا جنس الإنسان. والدفء: اسم ما يدفأ به، كما أنّ الملء اسم ما يملأ به، وهو الدفاء من لباس معمول من صوف أو وبر أو شعر. وقرئ:\n\nدفّ، بطرح الهمزة وإلقاء حركتها على الفاء وَمَنافِعُ هي نسلها ودرّها وغير ذلك. فإن قلت:\n\nتقديم الظرف في قوله وَمِنْها تَأْكُلُونَ مؤذن بالاختصاص، وقد يؤكل من غيرها. قلت:\n\nالأكل منها هو الأصل الذي يعتمده الناس في معايشهم. وأما الأكل من غيرها من الدجاج والبط وصيد البر والبحر فكغير المعتدّ به وكالجارى مجرى التفكه. ويحتمل أن طعمتكم منها، لأنكم تحرثون بالبقر فالحبّ والثمار التي تأكلونها منها وتكتسبون بإكراء الإبل وتبيعون نتاجها وألبانها وجلودها.","surah_id":16,"source_id":9},{"ayah_number":6,"ayah_text":"وَلَكُمْ فِيها جَمالٌ حِينَ تُرِيحُونَ وَحِينَ تَسْرَحُونَ (6)","text":"منّ الله بالتجمل بها كما منّ بالانتفاع بها، لأنه من أغراض أصحاب المواشي، بل هو من معاظمها، لأنّ الرعيان إذا روّحوها بالعشي وسرحوها بالغداة- فزينت بإراحتها وتسريحها الأفنية وتجاوب فيها الثغاء والرغاء - أنست أهلها وفرحت أربابها، وأجلتهم في عيون الناظرين إليها، وكسبتهم الجاه والحرمة عند الناس. ونحوه لِتَرْكَبُوها وَزِينَةً، يُوارِي سَوْآتِكُمْ وَرِيشاً. فإن قلت: لم قدّمت الإراحة على التسريح؟ قلت: لأنّ الجمال في الإراحة أظهر، إذا أقبلت ملأى البطون حافلة الضروع، ثم أوت إلى الحظائر حاضرة لأهلها. وقرأ عكرمة:\n\nحينا تريحون وحينا تسرحون، على أن تُرِيحُونَ وَحِينَ تَسْرَحُونَ وصف للحين. والمعنى: تريحون فيه وتسرحون فيه، كقوله تعالى يَوْماً لا يَجْزِي والِدٌ.","surah_id":16,"source_id":9},{"ayah_number":7,"ayah_text":"وَتَحْمِلُ أَثْقالَكُمْ إِلى بَلَدٍ لَمْ تَكُونُوا بالِغِيهِ إِلاَّ بِشِقِّ الْأَنْفُسِ إِنَّ رَبَّكُمْ لَرَؤُفٌ رَحِيمٌ (7)","text":"قرئ: بشق الأنفس، بكسر الشين وفتحها. وقيل: هما لغتان في معنى المشقة، وبينهما فرق:\n\nوهو أن المفتوح مصدر شق الأمر عليه شقا، وحقيقته راجعة إلى الشق الذي هو الصدع. وأما الشق فالنصف، كأنه يذهب نصف قوته لما يناله من الجهد. فإن قلت: ما معنى قوله: لَمْ تَكُونُوا بالِغِيهِ كأنهم كانوا زمانا يتحملون المشاق في بلوغه حتى حملت الإبل أثقالهم. قلت:\n\nمعناه وتحمل أثقالكم إلى بلد لم تكونوا بالغيه في التقدير لو لم تخلق الإبل إلا بجهد أنفسكم، لا أنهم لم يكونوا بالغيه في الحقيقة. فإن قلت: كيف طابق قوله: لَمْ تَكُونُوا بالِغِيهِ قوله:\n\nوَتَحْمِلُ أَثْقالَكُمْ وهلا قيل: لم تكونوا حامليها إليه ؟ قلت: طباقه من حيث أن معناه:\n\nوتحمل أثقالكم إلى بلد بعيد قد علمتم أنكم لا تبلغونه بأنفسكم إلا بجهد ومشقة، فضلا أن تحملوا على ظهوركم أثقالكم. ويجوز أن يكون المعنى: لم تكونوا بالغيه بها إلا بشق الأنفس. وقيل:\n\nأثقالكم أجرامكم. وعن عكرمة: البلد مكة لَرَؤُفٌ رَحِيمٌ حيث رحمكم بخلق هذه الحوامل وتيسير هذه المصالح.","surah_id":16,"source_id":9},{"ayah_number":8,"ayah_text":"وَالْخَيْلَ وَالْبِغالَ وَالْحَمِيرَ لِتَرْكَبُوها وَزِينَةً وَيَخْلُقُ ما لا تَعْلَمُونَ (8)","text":"وَالْخَيْلَ وَالْبِغالَ وَالْحَمِيرَ عطف على الأنعام، أى: وخلق هؤلاء للركوب والزينة، وقد احتج على حرمة أكل لحومهن بأن علل خلقها بالركوب والزينة، ولم يذكر الأكل بعد ما ذكره في الأنعام. فإن قلت: لم انتصب وَزِينَةً؟ قلت: لأن مفعول له، وهو معطوف على محل لتركبوها. فإن قلت: فهلا ورد المعطوف والمعطوف عليه على سنن واحد ؟ قلت: لأنّ الركوب فعل المخاطبين، وأما الزينة ففعل الزائن وهو الخالق. وقرئ: لتركبوها زينة، بغير واو، أى: وخلقها زينة لتركبوها. أو تجعل زينة حالا منها، أى: وخلقها لتركبوها وهي زينة وجمال وَيَخْلُقُ ما لا تَعْلَمُونَ يجوز أن يريد به: ما يخلق فينا ولنا مما لا نعلم كنهه وتفاصيله ويمنّ علينا بذكره كما منّ بالأشياء المعلومة مع الدلالة على قدرته. ويجوز أن يخبرنا بأن له من الخلائق ما لا علم لنا به، ليزيدنا دلالة على اقتداره بالإخبار بذلك، وإن طوى عنا علمه لحكمة له في طيه، وقد حمل على ما خلق في الجنة والنار، مما لم يبلغه وهم أحد، ولا خطر على قلبه.","surah_id":16,"source_id":9},{"ayah_number":9,"ayah_text":"وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ وَمِنْها جائِرٌ وَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ (9)","text":"المراد بالسبيل: الجنس، ولذلك أضاف إليها القصد وقال وَمِنْها جائِرٌ. والقصد مصدر بمعنى الفاعل وهو القاصد. يقال: سبيل قصد وقاصد، أى: مستقيم، كأنه يقصد الوجه الذي يؤمه السالك لا يعدل عنه. ومعنى قوله وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ أنّ هداية الطريق الموصل إلى الحق واجبة عليه، كقوله إِنَّ عَلَيْنا لَلْهُدى. فإن قلت: لم غير أسلوب الكلام في قوله وَمِنْها جائِرٌ؟ قلت: ليعلم ما يجوز إضافته إليه من السبيلين وما لا يجوز، ولو كان الأمر كما تزعم المجبرة لقيل: وعلى الله قصد السبيل وعليه جائرها أو وعليه الجائر. وقرأ عبد الله:\n\nومنكم جائر، يعنى: ومنكم جائر جار عن القصد بسوء اختياره، والله بريء منه وَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ قسراً وإلجاء .","surah_id":16,"source_id":9},{"ayah_number":10,"ayah_text":"هُوَ الَّذِي أَنْزَلَ مِنَ السَّماءِ ماءً لَكُمْ مِنْهُ شَرابٌ وَمِنْهُ شَجَرٌ فِيهِ تُسِيمُونَ (10) يُنْبِتُ لَكُمْ بِهِ الزَّرْعَ وَالزَّيْتُونَ وَالنَّخِيلَ وَالْأَعْنابَ وَمِنْ كُلِّ الثَّمَراتِ إِنَّ فِي ذلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ (11)","text":"لَكُمْ متعلق بأنزل، أو بشراب، خبراً له. والشراب ما يشرب شَجَرٌ يعنى الشجر الذي ترعاه المواشي. وفي حديث عكرمة: لا تأكلوا ثمن الشجر فإنه سحت . يعنى الكلأ تُسِيمُونَ من سامت الماشية إذا رعت، فهي سائمة، وأسامها صاحبها، وهو من السومة وهي العلامة، لأنها تؤثر بالرعي علامات في الأرض. وقرئ: ينبت، بالياء والنون. فإن قلت:\n\nلم قيل وَمِنْ كُلِّ الثَّمَراتِ؟ قلت: لأنّ كل الثمرات لا تكون إلا في الجنة، وإنما أنبت في الأرض بعض من كلها للتذكرة يَتَفَكَّرُونَ ينظرون فيستدلون بها عليه وعلى قدرته وحكمته.\n\nوالآية: الدلالة الواضحة. وعن بعضهم: ينبت، بالتشديد. وقرأ أبىّ بن كعب: ينبت لكم به الزرع والزيتون والنخيل والأعناب، بالرفع.","surah_id":16,"source_id":9},{"ayah_number":12,"ayah_text":"وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهارَ وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومُ مُسَخَّراتٌ بِأَمْرِهِ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ (12)","text":"قرئت كلها بالنصب على: وجعل النجوم مسخرات. أو على أنّ معنى تسخيرها للناس:\n\nتصييرها نافعة لهم، حيث يسكنون بالليل، ويبتغون من فضله بالنهار، ويعلمون عدد السنين والحساب بمسير الشمس والقمر، ويهتدون بالنجوم. فكأنه قيل: ونفعكم بها في حال كونها مسخرات لما خلقن له بأمره. ويجوز أن يكون المعنى: أنه سخرها أنواعا من التسخير جمع مسخر، بمعنى تسخير، من قولك: سخره الله مسخراً، كقولك: سرحه مسرحاً، كأنه قيل: وسخرها لكم تسخيرات بأمره. وقرئ بنصب الليل والنهار وحدهما، ورفع ما بعدهما على الابتداء والخبر.\n\nوقرئ: والنجوم مسخرات، بالرفع. وما قبله بالنصب، وقال إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ فجمع الآية. وذكر العقل، لأنّ الآثار العلوية أظهر دلالة على القدرة الباهرة، وأبين شهادة للكبرياء والعظمة.","surah_id":16,"source_id":9},{"ayah_number":13,"ayah_text":"وَما ذَرَأَ لَكُمْ فِي الْأَرْضِ مُخْتَلِفاً أَلْوانُهُ إِنَّ فِي ذلِكَ لَآيَةً لِقَوْمٍ يَذَّكَّرُونَ (13)","text":"وَما ذَرَأَ لَكُمْ معطوف على الليل والنهار. يعنى: ما خلق فيها من حيوان وشجر وثمر وغير ذلك مختلف الهيئات والمناظر.","surah_id":16,"source_id":9},{"ayah_number":14,"ayah_text":"وَهُوَ الَّذِي سَخَّرَ الْبَحْرَ لِتَأْكُلُوا مِنْهُ لَحْماً طَرِيًّا وَتَسْتَخْرِجُوا مِنْهُ حِلْيَةً تَلْبَسُونَها وَتَرَى الْفُلْكَ مَواخِرَ فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ (14)","text":"لَحْماً طَرِيًّا هو السمك، ووصفه بالطراءة، لأنّ الفساد يسرع إليه، فيسارع إلى أكله خيفة للفساد عليه. فإن قلت: ما بال الفقهاء قالوا: إذا حلف الرجل لا يأكل لحماً، فأكل سمكا، لم يحنث. والله تعالى سماء لحماً كما ترى؟ قلت: مبنى الإيمان على العادة، وعادة الناس إذا ذكر اللحم على الإطلاق أن لا يفهم منه السمك، وإذا قال الرجل لغلامه: اشتر بهذه الدراهم لحماً فجاء بالسمك، كان حقيقاً بالإنكار. ومثاله أن الله تعالى سمى الكافر دابة في قوله: إنّ شرّ الدواب عند الله الذين كفروا، فلو حلف حالف لا يركب دابة فركب كافراً لم يحنث. حِلْيَةً هي اللؤلؤ والمرجان». \n\nوالمراد بلبسهم: لبس نسائهم، لأنهنّ من جملتهم، ولأنهنّ إنما يتزينّ بها من أجلهم، فكأنها زينتهم ولباسهم. المخر: شق الماء بحيزومها. وعن الفراء: هو صوت جرى الفلك بالرياح. وابتغاء الفضل: التجارة.","surah_id":16,"source_id":9},{"ayah_number":15,"ayah_text":"وَأَلْقى فِي الْأَرْضِ رَواسِيَ أَنْ تَمِيدَ بِكُمْ وَأَنْهاراً وَسُبُلاً لَعَلَّكُمْ تَهْتَدُونَ (15) وَعَلاماتٍ وَبِالنَّجْمِ هُمْ يَهْتَدُونَ (16)","text":"أَنْ تَمِيدَ بِكُمْ كراهة أن تميل بكم وتضطرب. والمائد: الذي يدار به إذا ركب البحر.\n\nقيل: خلق الله الأرض فجعلت تمور، فقالت الملائكة: ما هي بمقرّ أَحد على ظهرها، فأصبحت وقد أرسيت بالجبال، لم تدر الملائكة ممّ خلقت وَأَنْهاراً وجعل فيها أنهاراً، لأن أَلْقى فيه معنى: جعل. ألا ترى إلى قوله أَلَمْ نَجْعَلِ الْأَرْضَ مِهاداً وَالْجِبالَ أَوْتاداً. وَعَلاماتٍ\n\n هي معالم الطرق وكل ما تستدل به السابلة من جبل ومنهل وغير ذلك. والمراد بالنجم: الجنس، كقولك. كثر الدرهم في أيدى الناس. وعن السدى: هو الثريا، والفرقدان، وبنات نعش، والجدى. وقرأ الحسن: وبالنجم، بضمتين، وبضمة وسكون، وهو جمع نجم، كرهن ورهن، والسكون تخفيف. وقيل حذف الواو من النجوم تخفيفاً. فإن قلت: قوله وَبِالنَّجْمِ هُمْ يَهْتَدُونَ مخرج عن سنن الخطاب، مقدم فيه بِالنَّجْمِ، مقحم فيه هُمْ، كأنه قيل: وبالنجم خصوصاً هؤلاء خصوصاً يهتدون، فمن المراد ب هُمْ؟ قلت: كأنه أراد قريشاً: كان لهم اهتداء بالنجوم في مسايرهم، وكان لهم بذلك علم لم يكن مثله لغيرهم، فكان الشكر أوجب عليهم، والاعتبار ألزم لهم، فخصصوا.","surah_id":16,"source_id":9},{"ayah_number":17,"ayah_text":"أَفَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ أَفَلا تَذَكَّرُونَ (17)","text":"فإن قلت: كَمَنْ لا يَخْلُقُ أريد به الأصنام، فلم جيء بمن الذي هو لأولى العلم؟ قلت:\n\nفيه أوجه، أحدها: أنهم سموها آلهة وعبدوها، فأجروها مجرى أولى العلم. ألا ترى إلى قوله على أثره وَالَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ لا يَخْلُقُونَ شَيْئاً وَهُمْ يُخْلَقُونَ والثاني: المشاكلة بينه وبين من يخلق. والثالث: أن يكون المعنى أنّ من يخلق ليس كمن لا يخلق من أولى العلم، فكيف بما لا علم عنده، كقوله أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِها يعنى أنّ الآلهة حالهم منحطة عن حال من لهم أرجل وأيد وآذان وقلوب، لأنّ هؤلاء أَحياء وهم أموات، فكيف تصح لهم العبادة؟ لا أنها لو صحت لهم هذه الأعضاء لصحّ أن يعبدوا. فإن قلت: هو إلزام للذين عبدوا الأوثان وسموها آلهة تشبيهاً بالله، فقد جعلوا غير الخالق مثل الخالق، فكان حق الإلزام أن يقال لهم: أفمن لا يخلق كمن يخلق؟ قلت: حين جعلوا غير الله مثل الله في تسميته باسمه والعبادة له وسوّوا بينه وبينه، فقد جعلوا الله تعالى من جنس المخلوقات وشبيهاً بها، فأنكر عليهم ذلك بقوله أَفَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ","surah_id":16,"source_id":9},{"ayah_number":18,"ayah_text":"وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لا تُحْصُوها إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ (18) وَاللَّهُ يَعْلَمُ ما تُسِرُّونَ وَما تُعْلِنُونَ (19)","text":"لا تُحْصُوها لا تضبطوا عددها ولا تبلغه طاقتكم، فضلا أن تطيقوا القيام بحقها من أداء الشكر، أتبع ذلك ما عدّد من نعمه تنبيهاً على أنّ وراءها ما لا ينحصر ولا ينعدّ إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ حيث يتجاوز عن تقصيركم في أداء شكر النعمة، ولا يقطعها عنكم لتفريطكم، ولا يعاجلكم بالعقوبة على كفرانها وَاللَّهُ يَعْلَمُ ما تُسِرُّونَ وَما تُعْلِنُونَ من أعمالكم، وهو وعيد.","surah_id":16,"source_id":9},{"ayah_number":20,"ayah_text":"وَالَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ لا يَخْلُقُونَ شَيْئاً وَهُمْ يُخْلَقُونَ (20) أَمْواتٌ غَيْرُ أَحْياءٍ وَما يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ (21)","text":"وَالَّذِينَ يَدْعُونَ والآلهة الذين يدعوهم الكفار مِنْ دُونِ اللَّهِ وقرئ بالتاء. وقرئ:\n\nيدعون، على البناء للمفعول. نفى عنهم خصائص الإلهية بنفي كونهم خالقين وأحياء لا يموتون وعالمين بوقت البعث، وأثبت لهم صفات الخلق بأنهم مخلوقون وأنهم أموات وأنهم جاهلون بالغيب. ومعنى أَمْواتٌ غَيْرُ أَحْياءٍ أنهم لو كانوا آلهة على الحقيقة لكانوا أحياء غير أموات، أى غير جائز عليها الموت كالحىّ الذي لا يموت وأمرهم على العكس من ذلك. والضمير في يُبْعَثُونَ للداعين، أى لا يشعرون متى تبعث عبدتهم. وفيه تهكم بالمشركين وأنّ آلهتهم لا يعلمون وقت بعثهم، فكيف يكون لهم وقت جزاء منهم على عبادتهم. وفيه دلالة على أنه لا بدّ من البعث وأنه من لوازم التكليف. ووجه آخر: وهو أن يكون المعنى أن الناس يخلقونهم بالنحت والتصوير، وهم لا يقدرون على نحو ذلك، فهم أعجز من عبدتهم أموات جمادات لا حياة فيها، غير أحياء يعنى أنَّ من الأموات ما يعقب موته حياة، كالنطف التي ينشئها الله حيوانا، وأجساد الحيوان التي تبعث بعد موتها. وأمّا الحجارة فأموات لا يعقب موتها حياة، وذلك أعرق في موتها وَما يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ أى وما يعلم هؤلاء الآلهة متى تبعث الأحياء تهكما بحالها، لأنّ شعور الجماد محال، فكيف بشعور ما لا يعلمه حىّ إلا الحىّ القيوم سبحانه. ووجه ثالث: وهو أن يراد بالذين يدعون الملائكة، وكان ناس منهم يعبدونهم، وأنهم أموات: أى لا بدّ لهم من الموت، غير أحياء: غير باقية حياتهم. وما يشعرون: ولا علم لهم بوقت بعثهم. وقرئ: إيان، بكسر الهمزة.","surah_id":16,"source_id":9},{"ayah_number":22,"ayah_text":"إِلهُكُمْ إِلهٌ واحِدٌ فَالَّذِينَ لا يُؤْمِنُونَ بِالْآخِرَةِ قُلُوبُهُمْ مُنْكِرَةٌ وَهُمْ مُسْتَكْبِرُونَ (22) لا جَرَمَ أَنَّ اللَّهَ يَعْلَمُ ما يُسِرُّونَ وَما يُعْلِنُونَ إِنَّهُ لا يُحِبُّ الْمُسْتَكْبِرِينَ (23)","text":"إِلهُكُمْ إِلهٌ واحِدٌ يعنى أنه قد ثبت بما تقدّم من إبطال أن تكون الإلهية لغيره، وأنها له وحده لا شريك له فيها، فكان من نتيجة ثبات الوحدانية ووضوح دليلها: استمرارهم على شركهم، وأنّ قلوبهم منكرة للوحدانية، وهم مستكبرون عنها وعن الإقرار بها لا جَرَمَ حقا أَنَّ اللَّهَ يَعْلَمُ سرّهم وعلانيتهم فيجازيهم، وهو وعيد إِنَّهُ لا يُحِبُّ الْمُسْتَكْبِرِينَ يجوز أن يريد المستكبرين عن التوحيد يعنى المشركين. ويجوز أن يعمّ كل مستكبر، ويدخل هؤلاء تحت عمومه.","surah_id":16,"source_id":9},{"ayah_number":24,"ayah_text":"وَإِذا قِيلَ لَهُمْ ماذا أَنْزَلَ رَبُّكُمْ قالُوا أَساطِيرُ الْأَوَّلِينَ (24) لِيَحْمِلُوا أَوْزارَهُمْ كامِلَةً يَوْمَ الْقِيامَةِ وَمِنْ أَوْزارِ الَّذِينَ يُضِلُّونَهُمْ بِغَيْرِ عِلْمٍ أَلا ساءَ ما يَزِرُونَ (25)","text":"ماذا منصوب بأنزل، بمعنى: أى شيء أَنْزَلَ رَبُّكُمْ أو مرفوع بالابتداء، بمعنى:\n\nأىّ شيء أنزله ربكم، فإذا نصبت فمعنى أَساطِيرُ الْأَوَّلِينَ ما يدّعون نزوله أساطير الأوّلين، وإذا رفعته فالمعنى: المنزل أساطير الأوّلين، كقوله ماذا يُنْفِقُونَ قُلِ الْعَفْوَ فيمن رفع. فإن قلت: هو كلام متناقض، لأنه لا يكون منزل ربهم وأساطير؟ قلت: هو على السخرية كقوله:\n\nإنّ رسولكم وهو كلام بعضهم لبعض، أو قول المسلمين لهم. وقيل: هو قول المقتسمين:\n\nالذين اقتسموا مداخل مكة ينفرون عن رسول الله صلى الله عليه وسلم، إذا سألهم وفود الحاج عما أنزل على رسول الله صلى الله عليه وسلم، قالوا أَحاديث الأوّلين وأباطيلهم لِيَحْمِلُوا أَوْزارَهُمْ أى قالوا ذلك إضلالا للناس وصدّاً عن رسول الله صلى الله عليه وسلم، فحملوا أوزار ضلالهم كامِلَةً وبعض أوزار من ضلّ بضلالهم، وهو وزر الإضلال، لأن المضلّ والضال شريكان: هذا يضله، وهذا يطاوعه على إضلاله، فيتحاملان الوزر. ومعنى اللام التعليل من غير أن يكون غرضاً، كقولك: خرجت من البلد مخافة الشر بِغَيْرِ عِلْمٍ حال من المفعول أى يضلون من لا يعلم أنهم ضلال وإنما وصف بالضلال واحتمال الوزر من أضلوه وإن لم يعلم لأنه كان عليه أن يبحث وينظر بعقله حتى يميز بين المحق والمبطل.","surah_id":16,"source_id":9},{"ayah_number":26,"ayah_text":"قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَى اللَّهُ بُنْيانَهُمْ مِنَ الْقَواعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَأَتاهُمُ الْعَذابُ مِنْ حَيْثُ لا يَشْعُرُونَ (26) ثُمَّ يَوْمَ الْقِيامَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكائِيَ الَّذِينَ كُنْتُمْ تُشَاقُّونَ فِيهِمْ قالَ الَّذِينَ أُوتُوا الْعِلْمَ إِنَّ الْخِزْيَ الْيَوْمَ وَالسُّوءَ عَلَى الْكافِرِينَ (27) الَّذِينَ تَتَوَفَّاهُمُ الْمَلائِكَةُ ظالِمِي أَنْفُسِهِمْ فَأَلْقَوُا السَّلَمَ ما كُنَّا نَعْمَلُ مِنْ سُوءٍ بَلى إِنَّ اللَّهَ عَلِيمٌ بِما كُنْتُمْ تَعْمَلُونَ (28) فَادْخُلُوا أَبْوابَ جَهَنَّمَ خالِدِينَ فِيها فَلَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ (29)","text":"القواعد: أساطين البناء التي تعمده. وقيل: الأساس. وهذا تمثيل، يعنى: أنهم سوّوا منصوبات ليمكروا بها الله ورسوله، فجعل الله هلاكهم في تلك المنصوبات، كحال قوم بنوا بنياناً وعمدوه بالأساطين «فأتى البنيان من الأساطين بأن ضعضعت، فسقط عليهم السقف وهلكوا. ونحوه: من حفر لأخيه جبا وقع فيه منكبا. وقيل: هو نمروذ بن كنعان حين بنى الصرح ببابل طوله خمسة آلاف ذراع. وقيل فرسخان، فأهب الله الريح فخر عليه وعلى قومه فهلكوا. ومعنى إتيان الله: إتيان أمره مِنَ الْقَواعِدِ من جهة القواعد مِنْ حَيْثُ لا يَشْعُرُونَ من حيث لا يحتسبون ولا يتوقعون. وقرئ: فأتى الله بيتهم. فخرّ عليهم السقف، بضمتين يُخْزِيهِمْ بذلهم بعذاب الخزي رَبَّنا إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ يعنى هذا لهم في الدنيا، ثم العذاب في الآخرة شُرَكائِيَ على الإضافة إلى نفسه حكاية لإضافتهم، ليوبخهم بها على طريق الاستهزاء بهم تُشَاقُّونَ فِيهِمْ تعادون وتخاصمون المؤمنين في شأنهم ومعناهم. وقرئ: تشاقون، بكسر النون، بمعنى: تشاقوننى، لأنّ مشاقة المؤمنين كأنها مشاقة الله قالَ الَّذِينَ أُوتُوا الْعِلْمَ هم الأنبياء والعلماء من أممهم الذين كانوا يدعونهم إلى الإيمان ويعظونهم، فلا يلتفتون إليهم ويتكبرون عليهم ويشاقونهم، يقولون ذلك شماتة بهم وحكى الله ذلك من قولهم ليكون لطفاً لمن سمعه. وقيل: هم الملائكة. قرئ: تتوفاهم، بالتاء والياء.\n\nوقرئ: الذين توفاهم، بإدغام التاء في التاء فَأَلْقَوُا السَّلَمَ فسالموا وأخبتوا، وجاءوا بخلاف ما كانوا عليه في الدنيا من الشقاق والكبر، وقالوا: ما كُنَّا نَعْمَلُ مِنْ سُوءٍ وجحدوا ما وجد منهم من الكفر والعدوان، فردّ عليهم أولو العلم إِنَّ اللَّهَ عَلِيمٌ بِما كُنْتُمْ تَعْمَلُونَ فهو يجازيكم عليه، وهذا أيضاً من الشماتة وكذلك فَادْخُلُوا أَبْوابَ جَهَنَّمَ.","surah_id":16,"source_id":9},{"ayah_number":30,"ayah_text":"وَقِيلَ لِلَّذِينَ اتَّقَوْا ماذا أَنْزَلَ رَبُّكُمْ قالُوا خَيْراً لِلَّذِينَ أَحْسَنُوا فِي هذِهِ الدُّنْيا حَسَنَةٌ وَلَدارُ الْآخِرَةِ خَيْرٌ وَلَنِعْمَ دارُ الْمُتَّقِينَ (30) جَنَّاتُ عَدْنٍ يَدْخُلُونَها تَجْرِي مِنْ تَحْتِهَا الْأَنْهارُ لَهُمْ فِيها ما يَشاؤُنَ كَذلِكَ يَجْزِي اللَّهُ الْمُتَّقِينَ (31) الَّذِينَ تَتَوَفَّاهُمُ الْمَلائِكَةُ طَيِّبِينَ يَقُولُونَ سَلامٌ عَلَيْكُمْ ادْخُلُوا الْجَنَّةَ بِما كُنْتُمْ تَعْمَلُونَ (32)","text":"خَيْراً أنزل خيراً. فإن قلت: لم نصب هذا ورفع الأول؟ قلت: فصلا بين جواب المقرّ وجواب الجاحد، يعنى أن هؤلاء لما سئلوا لم يتلعثموا، وأطبقوا الجواب على السؤال بينا مكشوفا مفعولا للإنزال، فقالوا خيراً: أى أنزل خيراً، وأولئك عدلوا بالجواب عن السؤال فقالوا: هو أساطير الأوّلين، وليس من الإنزال في شيء. وروى أن أحياء العرب كانوا يبعثون أيام الموسم من يأتيهم بخبر النبي صلى الله عليه وسلم، فإذا جاء الواقد كفه المقتسمون وأمروه بالانصراف وقالوا: إن لم تلقه كان خيراً لك، فيقول: أنا شرّ وافد إن رجعت إلى قومي دون أن أستطلع أمر محمد وأراه، فيلقى أصحاب رسول الله صلى الله عليه وسلم فيخبرونه بصدقه، وأنه نبىّ مبعوث، فهم الذين قالوا خيراً. وقوله لِلَّذِينَ أَحْسَنُوا وما بعده بدل من خيراً، حكاية لقوله الذين اتقوا، أى: قالوا هذا القول، فقدّم عليه تسميته خيراً ثم حكاه.\n\nويجوز أن يكون كلاما مبتدأ عدة للقائلين، ويجعل قولهم من جملة إحسانهم وبحمدوا عليه حَسَنَةٌ مكافأة في الدنيا بإحسانهم، ولهم في الآخرة ما هو خير منها، كقوله فَآتاهُمُ اللَّهُ ثَوابَ الدُّنْيا وَحُسْنَ ثَوابِ الْآخِرَةِ. وَلَنِعْمَ دارُ الْمُتَّقِينَ دار الآخرة، فحذف المخصوص بالمدح لتقدّم ذكره. وجَنَّاتُ عَدْنٍ خبر مبتدإ محذوف. ويجوز أن يكون المخصوص بالمدح طَيِّبِينَ طاهرين من ظلم أنفسهم بالكفر والمعاصي، لأنه في مقابلة ظالمي أنفسهم يَقُولُونَ سَلامٌ عَلَيْكُمْ قيل: إذا أشرف العبد المؤمن على الموت جاءه ملك فقال: السلام عليك يا ولىّ الله، الله يقرأ عليك السلام، وبشره بالجنة.","surah_id":16,"source_id":9},{"ayah_number":33,"ayah_text":"هَلْ يَنْظُرُونَ إِلاَّ أَنْ تَأْتِيَهُمُ الْمَلائِكَةُ أَوْ يَأْتِيَ أَمْرُ رَبِّكَ كَذلِكَ فَعَلَ الَّذِينَ مِنْ قَبْلِهِمْ وَما ظَلَمَهُمُ اللَّهُ وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ (33) فَأَصابَهُمْ سَيِّئاتُ ما عَمِلُوا وَحاقَ بِهِمْ ما كانُوا بِهِ يَسْتَهْزِؤُنَ (34)","text":"ْتِيَهُمُ الْمَلائِكَةُ قرئ بالتاء والياء، يعنى: أن تأتيهم لقبض الأرواح. ومْرُ رَبِّكَ العذاب المستأصل، أو القيامة ذلِكَ أى مثل ذلك الفعل من الشرك والتكذيب عَلَ الَّذِينَ مِنْ قَبْلِهِمْ وَما ظَلَمَهُمُ اللَّهُ بتدميرهم لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ لأنهم فعلوا ما استوجبوا به التدمير سَيِّئاتُ ما عَمِلُوا جزاء سيئات أعمالهم. أو هو كقوله وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها","surah_id":16,"source_id":9},{"ayah_number":35,"ayah_text":"وَقالَ الَّذِينَ أَشْرَكُوا لَوْ شاءَ اللَّهُ ما عَبَدْنا مِنْ دُونِهِ مِنْ شَيْءٍ نَحْنُ وَلا آباؤُنا وَلا حَرَّمْنا مِنْ دُونِهِ مِنْ شَيْءٍ كَذلِكَ فَعَلَ الَّذِينَ مِنْ قَبْلِهِمْ فَهَلْ عَلَى الرُّسُلِ إِلاَّ الْبَلاغُ الْمُبِينُ (35)","text":"هذا من جملة ما عدّد من أصناف كفرهم وعنادهم، من شركهم بالله وإنكار وحدانيته بعد قيام الحجج وإنكار البعث واستعجاله، استهزاء منهم به وتكذيبهم الرسول، وشقاقهم، واستكبارهم عن قبول الحق، يعنى: أنهم أشركوا بالله وحرّموا ما أحل الله، من البحيرة والسائبة وغيرهما، ثم نسبوا فعلهم إلى الله وقالوا: لو شاء لم نفعل، وهذا مذهب المجبرة بعينه كَذلِكَ فَعَلَ الَّذِينَ مِنْ قَبْلِهِمْ أى أشركوا وحرموا حلال الله ، فلما نبهوا على قبح فعلهم ورّكوه على ربهم فَهَلْ عَلَى الرُّسُلِ إلا أن يبلغوا الحق، وأن الله لا يشاء الشرك والمعاصي بالبيان والبرهان، ويطلعوا على بطلان الشرك وقبحه وبراءة الله تعالى من أفعال العباد، وأنهم فاعلوها بقصدهم وإرادتهم واختيارهم، والله تعالى باعثهم على جميلها وموفقهم له، وزاجرهم عن قبيحها وموعدهم عليه.","surah_id":16,"source_id":9},{"ayah_number":36,"ayah_text":"وَلَقَدْ بَعَثْنا فِي كُلِّ أُمَّةٍ رَسُولاً أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ فَمِنْهُمْ مَنْ هَدَى اللَّهُ وَمِنْهُمْ مَنْ حَقَّتْ عَلَيْهِ الضَّلالَةُ فَسِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كانَ عاقِبَةُ الْمُكَذِّبِينَ (36)","text":"ولقد أمدّ إبطال قدر السوء ومشيئة الشر بأنه ما من أمة إلا وقد بعث فيهم رسولا يأمرهم بالخير الذي هو الإيمان وعبادة الله، وباجتناب الشر الذي هو طاعة الطاغوت فَمِنْهُمْ مَنْ هَدَى اللَّهُ أى لطف به لأنه عرفه من أهل اللطف وَمِنْهُمْ مَنْ حَقَّتْ عَلَيْهِ الضَّلالَةُ أى ثبت عليه الخذلان والترك من اللطف، لأنه عرفه مصمما على الكفر لا يأتى منه خير فَسِيرُوا فِي الْأَرْضِ فَانْظُرُوا ما فعلت بالمكذبين حتى لا يبقى لكم شبهة في أنى لا أقدّر الشر ولا أشاؤه، حيث أفعل ما أفعل بالأشرار.","surah_id":16,"source_id":9},{"ayah_number":37,"ayah_text":"إِنْ تَحْرِصْ عَلى هُداهُمْ فَإِنَّ اللَّهَ لا يَهْدِي مَنْ يُضِلُّ وَما لَهُمْ مِنْ ناصِرِينَ (37)","text":"ثم ذكر عناد قريش وحرص رسول الله صلى الله عليه وسلم على إيمانهم، وعرّفه أنهم من قسم من حقت عليه الضلالة، وأنه لا يَهْدِي مَنْ يُضِلُّ أى لا يلطف بمن يخذل، لأنه عبث، والله تعالى متعال عن العبث، لأنه من قبيل القبائح التي لا تجوز عليه. وقرئ: لا يهدى ، أى:\n\nلا تقدر أنت ولا أحد على هدايته وقد خذله الله. وقوله وَما لَهُمْ مِنْ ناصِرِينَ دليل على أنّ المراد بالإضلال: الخذلان الذي هو نقيض النصرة. ويجوز أن يكون لا يَهْدِي بمعنى لا يهتدى. يقال: هداه الله فهدى. وفي قراءة أبىّ: فإنّ الله لا هادى لمن يضل، ولمن أضلّ ، وهي معاضدة لمن قرأ لا يَهْدِي على البناء للمفعول. وفي قراءة عبد الله: يهدى، بإدغام تاء يهتدى، وهي معاضدة للأولى. وقرئ «يضل» بالفتح. وقرأ النخعي: إن تحرص، بفتح الراء، وهي لغية.","surah_id":16,"source_id":9},{"ayah_number":38,"ayah_text":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمانِهِمْ لا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ بَلى وَعْداً عَلَيْهِ حَقًّا وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (38) لِيُبَيِّنَ لَهُمُ الَّذِي يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كانُوا كاذِبِينَ (39)","text":"وَأَقْسَمُوا بِاللَّهِ معطوف على وَقالَ الَّذِينَ أَشْرَكُوا إيذاناً بأنهما كفرتان عظيمتان موصوفتان، حقيقتان بأن تحكيا وتدوّنا: توريك ذنوبهم على مشيئة الله، وإنكارهم البعث مقسمين عليه. وبَلى إثبات لما بعد النفي، أى: بلى يبعثهم. ووعد الله: مصدر مؤكد لما دلّ عليه بلى. لأن يبعث موعد من الله، وبين أنّ الوفاء بهذا الموعد حق واجب عليه في الحكمة وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ أنهم يبعثون أو أنه وعد واجب على الله، لأنهم يقولون: لا يجب على الله شيء، لا ثواب عامل ولا غيره من مواجب الحكمة لِيُبَيِّنَ لَهُمُ متعلق بما دل عليه «بلى» أى يبعثهم ليبين لهم. والضمير لمن يموت، وهو عام للمؤمنين والكافرين، والذي اختلفوا فيه هو الحق وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كذبوا في قولهم:\n\nلو شاء الله ما عبدنا من دونه من شيء، وفي قولهم: لا يبعث الله من يموت. وقيل: يجوز أن يتعلق بقوله وَلَقَدْ بَعَثْنا فِي كُلِّ أُمَّةٍ رَسُولًا أى بعثناه ليبين لهم ما اختلفوا فيه، وأنهم كانوا على الضلالة قبله، مفترين على الله الكذب.","surah_id":16,"source_id":9},{"ayah_number":40,"ayah_text":"إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ (40)","text":"قَوْلُنا مبتدأ، وأَنْ نَقُولَ خبره. كُنْ فَيَكُونُ من كان التامة التي بمعنى الحدوث والوجود، أى: إذا أردنا وجود شيء فليس إلا أن نقول له: أحدث، فهو يحدث عقيب ذلك لا يتوقف، وهذا مثل لأنّ مراداً لا يمتنع عليه، وأنّ وجوده عند إرادته تعالى غير متوقف، كوجود المأمور به عند أمر الآمر المطاع إذا ورد على المأمور المطيع الممتثل، ولا قول ثم، والمعنى: أنّ إيجاد كل مقدور على الله تعالى بهذه السهولة، فكيف يمتنع عليه البعث الذي هو من شق المقدورات. وقرئ: فيكون، عطفاً على نَقُولَ.","surah_id":16,"source_id":9},{"ayah_number":41,"ayah_text":"وَالَّذِينَ هاجَرُوا فِي اللَّهِ مِنْ بَعْدِ ما ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيا حَسَنَةً وَلَأَجْرُ الْآخِرَةِ أَكْبَرُ لَوْ كانُوا يَعْلَمُونَ (41) الَّذِينَ صَبَرُوا وَعَلى رَبِّهِمْ يَتَوَكَّلُونَ (42)","text":"وَالَّذِينَ هاجَرُوا هم رسول الله صلى الله عليه وسلم وأصحابه، ظلمهم أهل مكة ففرّوا بدينهم إلى الله، منهم من هاجر إلى الحبشة ثم إلى المدينة فجمع بين الهجرتين. ومنهم من هاجر إلى المدينة. وقيل: هم الذين كانوا محبوسين معذبين بعد هجرة رسول الله صلى الله عليه وسلم، وكلما خرجوا تبعوهم فردّوهم: منهم بلال، وصهيب، وخباب، وعمار. وعن صهيب أنه قال لهم: أنا رجل كبير، إن كنت معكم لم أنفعكم، وإن كنت عليكم لم أضرّكم، فافتدى منهم بماله وهاجر، فلما رآه أبو بكر رضى الله عنه قال له: ربح البيع يا صهيب. وقال له عمر: نعم الرجل صهيب، لو لم يخف الله لم يعصه، وهو ثناء عظيم: يريد لو لم يخلق الله ناراً لأطاعه ، فكيف فِي اللَّهِ في حقه ولوجهه حَسَنَةً صفة للمصدر، أى لنبو أنهم تبوئة حسنة. وفي قراءة على رضى الله عنه: لنثوّينهم. ومعناه: أثوأة حسنة. وقيل: لننزلنهم في الدنيا منزلة حسنة، وهي الغلبة على أهل مكة الذين ظلموهم، وعلى العرب قاطبة، وعلى أهل المشرق والمغرب. وعن عمر رضى الله عنه أنه كان إذا أعطى رجلا من المهاجرين عطاء قال: خذ بارك الله لك فيه، هذا ما وعدك ربك في الدنيا، وما ذخر لك في الآخرة أكثر. وقيل: لنبوّأنهم مباءة حسنة وهي المدينة، حيث آواهم أهلها ونصروهم لَوْ كانُوا يَعْلَمُونَ الضمير للكفار، أى: لو علموا أنّ الله يجمع لهؤلاء المستضعفين في أيديهم الدنيا والآخرة، لرغبوا في دينهم. ويجوز أن يرجع الضمير إلى المهاجرين، أى: لو كانوا يعلمون ذلك لزادوا في اجتهادهم وصبرهم الَّذِينَ صَبَرُوا على:\n\nهم الذين صبروا. أو أعنى الذين صبروا، وكلاهما مدح، أى: صبروا على العذاب وعلى مفارقة الوطن الذي هو حرم الله المحبوب في كل قلب، فكيف بقلوب قوم هو مسقط رؤسهم، وعلى المجاهدة وبذل الأرواح في سبيل الله.","surah_id":16,"source_id":9},{"ayah_number":43,"ayah_text":"وَما أَرْسَلْنا مِنْ قَبْلِكَ إِلاَّ رِجالاً نُوحِي إِلَيْهِمْ فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ (43) بِالْبَيِّناتِ وَالزُّبُرِ وَأَنْزَلْنا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُونَ (44)","text":"قالت قريش: الله أعظم من أن يكون رسوله بشراً، فقيل وَما أَرْسَلْنا مِنْ قَبْلِكَ إِلَّا رِجالًا نُوحِي إِلَيْهِمْ على ألسنة الملائكة فَسْئَلُوا أَهْلَ الذِّكْرِ وهم أهل الكتاب، ليعلموكم أن الله لم يبعث إلى الأمم السالفة إلا بشراً. فإن قلت: بم تعلق قوله بِالْبَيِّناتِ؟ قلت: له متعلقات شتى، فاما أن يتعلق مما أرسلنا داخلا تحت حكم الاستثناء مع رجالا أى: وما أرسلنا إلا رجالا بالبينات، كقولك: ما ضربت إلا زيداً بالسوط، لأن أصله: ضربت زيداً بالسوط وإما برجالا، صفة له: أى رجالا ملتسين بالبينات. وإما بأرسلنا مضمراً، كأنما قيل: بم أرسلوا؟ فقلت بالبينات، فهو على كلامين، والأوّل على كلام واحد. وإما بيوحى، أى:\n\nيوحى إليهم بالبينات. وإما بلا تعلمون، على أن الشرط في معنى التبكيت والإلزام، كقول الأجير: إن كنت عملت لك فأعطنى حقي. وقوله فَسْئَلُوا أَهْلَ الذِّكْرِ اعتراض على الوجوه المتقدّمة، وأهل الذكر: أهل الكتاب. وقيل للكتاب الذكر، لأنه موعظة وتنبيه للغافلين ما نُزِّلَ إِلَيْهِمْ يعنى ما نزل الله إليهم في الذكر مما أمروا به ونهوا عنه ووعدوا وأوعدوا وَلَعَلَّهُمْ يَتَفَكَّرُونَ وإرادة أن يصغوا إلى تنبيهاته فيتنبهوا ويتأملوا.","surah_id":16,"source_id":9},{"ayah_number":45,"ayah_text":"أَفَأَمِنَ الَّذِينَ مَكَرُوا السَّيِّئاتِ أَنْ يَخْسِفَ اللَّهُ بِهِمُ الْأَرْضَ أَوْ يَأْتِيَهُمُ الْعَذابُ مِنْ حَيْثُ لا يَشْعُرُونَ (45) أَوْ يَأْخُذَهُمْ فِي تَقَلُّبِهِمْ فَما هُمْ بِمُعْجِزِينَ (46) أَوْ يَأْخُذَهُمْ عَلى تَخَوُّفٍ فَإِنَّ رَبَّكُمْ لَرَؤُفٌ رَحِيمٌ (47)","text":"مَكَرُوا السَّيِّئاتِ أى المكرات السيئات، وهم أهل مكة، وما مكروا به رسول الله صلى الله عليه وسلم فِي تَقَلُّبِهِمْ متقلبين في مسايرهم ومتاجرهم وأسباب دنياهم عَلى تَخَوُّفٍ متخوفين، وهو أن يهلك قوما قبلهم فيتخوّفوا فيأخذهم بالعذاب وهم متخوفون متوقعون، وهو خلاف قوله مِنْ حَيْثُ لا يَشْعُرُونَ وقيل: هو من قولك: تخوفنه وتخونته، إذا تنقصته:\n\nقال زهير:\n\nتَخَوَّفَ الرَّحْلُ مِنْهَا تَامِكاً قَرِداً ... كَمَا تَخَوَّفَ عُودَ النّبْعة السَّفَنُ أى يأخذهم على أن يتنقصهم شيئاً بعد شيء في أنفسهم وأموالهم حتى يهلكوا. وعن عمر رضى الله عنه. أنه قال على المنبر: ما تقولون فيها؟ فسكتوا فقام شيخ من هذيل فقال: هذه لغتنا: التخوّف التنقص. قال: فهل تعرف العرب ذلك في أشعارها؟ قال: نعم، قال شاعرنا. وأنشد البيت.\n\nفقال عمر: أيها الناس، عليكم بديوانكم لا يضل. قالوا: وما ديواننا؟ قال: شعر الجاهلية، فإن فيه تفسير كتابكم فَإِنَّ رَبَّكُمْ لَرَؤُفٌ رَحِيمٌ حيث يحلم عنكم، ولا يعاجلكم مع استحقاقكم.","surah_id":16,"source_id":9},{"ayah_number":48,"ayah_text":"أَوَلَمْ يَرَوْا إِلى ما خَلَقَ اللَّهُ مِنْ شَيْءٍ يَتَفَيَّؤُا ظِلالُهُ عَنِ الْيَمِينِ وَالشَّمائِلِ سُجَّداً لِلَّهِ وَهُمْ داخِرُونَ (48)","text":"قرئ: أو لم يروا. ويتفيؤا، بالياء والتاء. وما موصولة بخلق الله، وهو مبهم بيانه مِنْ شَيْءٍ يَتَفَيَّؤُا ظِلالُهُ واليمين، بمعنى الأيمان. وسُجَّداً حال من الظلال. وَهُمْ داخِرُونَ حال من الضمير في ظلاله، لأنه في معنى الجمع وهو ما خلق الله من كل شيء له ظل، وجمع بالواو، لأن الدخور من أوصاف العقلاء، أو لأن في جملة ذلك من يعقل فغلب. والمعنى: أو لم يروا إلى ما خلق الله من الأجرام التي لها ظلال متفيئة عن أيمانها وشمائلها، أى عن جانبي كل واحد منها. وشقيه استعارة من يمين الإنسان وشماله لجانبى الشيء، أى: ترجع الظلال من جانب إلى جانب منقادة لله، غير ممتنعة عليه فيما سخرها له من التفيؤ، والأجرام في أنفسها داخرة أيضاً، صاغرة منقادة لأفعال الله فيها، لا تمتنع.","surah_id":16,"source_id":9},{"ayah_number":49,"ayah_text":"وَلِلَّهِ يَسْجُدُ ما فِي السَّماواتِ وَما فِي الْأَرْضِ مِنْ دابَّةٍ وَالْمَلائِكَةُ وَهُمْ لا يَسْتَكْبِرُونَ (49) يَخافُونَ رَبَّهُمْ مِنْ فَوْقِهِمْ وَيَفْعَلُونَ ما يُؤْمَرُونَ (50)","text":"مِنْ دابَّةٍ يجوز أن يكون بيانا لما في السموات وما في الأرض جميعا، على أنّ في السموات خلقا لله يدبون فيها كما يدب الأناسى في الأرض، وأن يكون بيانا لما في الأرض وحده، ويراد بما في السموات: الملائكة. وكرّر ذكرهم على معنى: والملائكة خصوصا من بين الساجدين، لأنهم أطوع الخلق وأعبدهم. ويجوز أن يراد بما في السموات: ملائكتهنّ.\n\nوبقوله والملائكة: ملائكة الأرض من الحفظة وغيرهم، فإن قلت: سجود المكلفين مما انتظمه هذا الكلام خلاف سجود غيرهم، فكيف عبر عن النوعين بلفظ واحد؟ قلت: المراد بسجود المكلفين: طاعتهم وعبادتهم، وبسجود غيرهم: انقياده لإرادة الله وأنها غير ممتنعة عليها، وكلا السجودين يجمعها معنى الانقياد فلم يختلفا، فلذلك جاز أن يعبر عنهما بلفظ واحد. فإن قلت:\n\nفهلا جيء بمن دون «ما» تغليبا للعقلاء من الدواب على غيرهم؟ قلت: لأنه لو جيء بمن لم يكن فيه دليل على التغليب، فكان متناولا للعقلاء خاصة، فجيء بما هو صالح للعقلاء وغيرهم، إرادة العموم يَخافُونَ يجوز أن يكون حالا من الضمير في لا يَسْتَكْبِرُونَ أى: لا يستكبرون خائفين، وأن يكون بيانا لنفى الاستكبار وتأكيداً له، لأنّ من خاف الله لم يستكبر عن عبادته مِنْ فَوْقِهِمْ إن علقته بيخافون، فمعناه: يخافونه أن يرسل عليهم عذابا من فوقهم، وإن علقته بربهم حالا منه فمعناه: يخافون ربهم عاليا لهم قاهرا، كقوله وَهُوَ الْقاهِرُ فَوْقَ عِبادِهِ، وَإِنَّا فَوْقَهُمْ قاهِرُونَ وفيه دليل على أنّ الملائكة مكلفون مدارون على الأمر والنهى والوعد والوعيد كسائر المكلفين، وأنهم بين الخوف والرجاء.","surah_id":16,"source_id":9},{"ayah_number":51,"ayah_text":"وَقالَ اللَّهُ لا تَتَّخِذُوا إِلهَيْنِ اثْنَيْنِ إِنَّما هُوَ إِلهٌ واحِدٌ فَإِيَّايَ فَارْهَبُونِ (51)","text":"فإن قلت: إنما جمعوا بين العدد والمعدود فيما وراء الواحد والاثنين، فقالوا عندي رجال ثلاثة وأفراس أربعة، لأن المعدود عار عن الدلالة على العدد الخاص. وأما رجل ورجلان وفرس وفرسان، فمعدودان فيهما دلالة على العدد، فلا حاجة إلى أن يقال: رجل واحد ورجلان اثنان، فما وجه قوله إلهين اثنين ؟ قلت: الاسم الحامل لمعنى الإفراد والتثنية دال على شيئين: على الجنسية والعدد المخصوص، فإذا أريدت الدلالة على أنّ المعنىّ به منهما، والذي يساق إليه الحديث هو العدد شفع بما يؤكده، فدل به على القصد إليه والعنايه به. ألا ترى أنك لو قلت: إنما هو إله، ولم تؤكده بواحد: لم يحسن، وخيل أنك تثبت الإلهية لا الوحدانية فَإِيَّايَ فَارْهَبُونِ نقل للكلام عن الغيبة إلى التكلم، وجاز لأنّ الغالب هو المتكلم، وهو من طريقة الالتفات، وهو أبلغ في الترهيب من قوله: وإياه فارهبوه، ومن أن يجيء ما قبله على لفظ المتكلم.","surah_id":16,"source_id":9},{"ayah_number":52,"ayah_text":"وَلَهُ ما فِي السَّماواتِ وَالْأَرْضِ وَلَهُ الدِّينُ واصِباً أَفَغَيْرَ اللَّهِ تَتَّقُونَ (52)","text":"الدِّينُ الطاعة واصِباً حال عمل فيه الظرف. والواصب: الواجب الثابت، لأنّ كل نعمة منه فالطاعة واجبة له على كل منعم عليه. ويجوز أن يكون من الوصب، أى: وله الدين ذا كلفة ومشقة، ولذلك سمى تكليفا. أو: وله الجزاء ثابتا دائما سرمدا لا يزول، يعنى الثواب والعقاب.","surah_id":16,"source_id":9},{"ayah_number":53,"ayah_text":"وَما بِكُمْ مِنْ نِعْمَةٍ فَمِنَ اللَّهِ ثُمَّ إِذا مَسَّكُمُ الضُّرُّ فَإِلَيْهِ تَجْئَرُونَ (53) ثُمَّ إِذا كَشَفَ الضُّرَّ عَنْكُمْ إِذا فَرِيقٌ مِنْكُمْ بِرَبِّهِمْ يُشْرِكُونَ (54) لِيَكْفُرُوا بِما آتَيْناهُمْ فَتَمَتَّعُوا فَسَوْفَ تَعْلَمُونَ (55)","text":"وَما بِكُمْ مِنْ نِعْمَةٍ وأىّ شيء حل بكم، أو اتصل بكم من نعمة، فهو من الله فَإِلَيْهِ تَجْئَرُونَ فما تتضرعون إلا إليه، والجؤار: رفع الصوت بالدعاء والاستغاثة. قال الأعشى يصف راهبا:\n\nيُرَاوِحُ مِنْ صَلَوَاتِ الْمَلِيكِ طَوْراً سُجُوداً وَطَوْراً جُؤَارَا\n\nوقرئ: تجرون، بطرح الهمزة وإلقاء حركتها على الجيم. وقرأ قتادة: كاشف الضرّ على:\n\nفاعل بمعنى فعل، وهو أقوى من كشف، لأن بناء المغالبة يدل على المبالغة. فإن قلت: فما معنى قوله إِذا فَرِيقٌ مِنْكُمْ بِرَبِّهِمْ يُشْرِكُونَ؟ قلت: يجوز أن يكون الخطاب في قوله وَما بِكُمْ مِنْ نِعْمَةٍ فَمِنَ اللَّهِ عاما، ويريد بالفريق: فريق الكفرة وأن يكون الخطاب للمشركين ومنكم للبيان، لا للتبعيض، كأنه قال فإذا فريق كافر، وهم أنتم. ويجوز أن يكون فيهم من اعتبر، كقوله فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ فَمِنْهُمْ مُقْتَصِدٌ، لِيَكْفُرُوا بِما آتَيْناهُمْ من نعمة الكشف عنهم،\n\n كأنهم جعلوا غرضهم في الشرك كفران النعمة فَتَمَتَّعُوا فَسَوْفَ تَعْلَمُونَ تخلية ووعيد. وقرئ:\n\nفيمتعوا، بالياء مبنيا للمفعول، عطفا على لِيَكْفُرُوا ويجوز أن يكون: ليكفروا فيمتعوا، من الامر الوارد في معنى الخذلان والتخلية، واللام لام الأمر.","surah_id":16,"source_id":9},{"ayah_number":56,"ayah_text":"وَيَجْعَلُونَ لِما لا يَعْلَمُونَ نَصِيباً مِمَّا رَزَقْناهُمْ تَاللَّهِ لَتُسْئَلُنَّ عَمَّا كُنْتُمْ تَفْتَرُونَ (56)","text":"لِما لا يَعْلَمُونَ أى لآلهتهم. ومعنى لا يعلمونها: أنهم يسمونها آلهة، ويعتقدون فيها أنها تضر وتنفع وتشفع عند الله، وليس كذلك. وحقيقتها أنها جماد لا يضر ولا ينفع، فهم إذاً جاهلون بها. وقيل: الضمير في لا يَعْلَمُونَ للآلهة. أى: لأشياء غير موصوفة بالعلم، ولا تشعر اجعلوا لها نصيباً في أنعامهم وزروعهم أم لا؟ وكانوا يجعلون لهم ذلك تقربا إليهم لَتُسْئَلُنَّ وعيد عَمَّا كُنْتُمْ تَفْتَرُونَ من الإفك في زعمكم أنها آلهة، وأنها أهل للتقرب إليها.","surah_id":16,"source_id":9},{"ayah_number":57,"ayah_text":"وَيَجْعَلُونَ لِلَّهِ الْبَناتِ سُبْحانَهُ وَلَهُمْ ما يَشْتَهُونَ (57) وَإِذا بُشِّرَ أَحَدُهُمْ بِالْأُنْثى ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ (58) يَتَوارى مِنَ الْقَوْمِ مِنْ سُوءِ ما بُشِّرَ بِهِ أَيُمْسِكُهُ عَلى هُونٍ أَمْ يَدُسُّهُ فِي التُّرابِ أَلا ساءَ ما يَحْكُمُونَ (59)","text":"كانت خزاعة وكنانة تقول: الملائكة بنات الله سُبْحانَهُ تنزيه لذاته من نسبة الوالد إليه. أو تعجب من قولهم وَلَهُمْ ما يَشْتَهُونَ يعنى البنين. ويجوز في ما يَشْتَهُونَ الرفع على الابتداء، والنصب على أن يكون معطوفا على البنات، أى: وجعلوا لأنفسهم ما يشتهون من الذكور. وظَلَّ بمعنى صار كما يستعمل بات وأصبح وأمسى بمعنى الصيرورة. ويجوز أن يجيء ظل، لأن أكثر الوضع يتفق بالليل، فيظل نهاره مغتما مربد الوجه من الكآبة والحياء من الناس وَهُوَ كَظِيمٌ مملوء حنقاً على المرأة يَتَوارى مِنَ الْقَوْمِ يستخفى منهم مِنَ أجل سُوءِ المبشر به، ومن أجل تعييرهم ويحدث نفسه وينظر أيمسك ما بشر به عَلى هُونٍ على هوان وذل أَمْ يَدُسُّهُ فِي التُّرابِ أم يئده . وقرئ: أيمسكها على هون أم يدسها، على التأنيث. وقرئ: على هوان أَلا ساءَ ما يَحْكُمُونَ حيث يجعلون الولد الذي هذا محله عندهم لله، ويجعلون لأنفسهم من هو على عكس هذا الوصف.","surah_id":16,"source_id":9},{"ayah_number":60,"ayah_text":"لِلَّذِينَ لا يُؤْمِنُونَ بِالْآخِرَةِ مَثَلُ السَّوْءِ وَلِلَّهِ الْمَثَلُ الْأَعْلى وَهُوَ الْعَزِيزُ الْحَكِيمُ (60)","text":"مَثَلُ السَّوْءِ صفة السوء: وهي الحاجة إلى الأولاد الذكور وكراهة الإناث ووأدهن خشية الإملاق، وإقرارهم على أنفسهم بالشح البالغ وَلِلَّهِ الْمَثَلُ الْأَعْلى وهو الغنى عن العالمين، والنزاهة عن صفات المخلوقين وهو الجواد الكريم.","surah_id":16,"source_id":9},{"ayah_number":61,"ayah_text":"وَلَوْ يُؤاخِذُ اللَّهُ النَّاسَ بِظُلْمِهِمْ ما تَرَكَ عَلَيْها مِنْ دَابَّةٍ وَلكِنْ يُؤَخِّرُهُمْ إِلى أَجَلٍ مُسَمًّى فَإِذا جاءَ أَجَلُهُمْ لا يَسْتَأْخِرُونَ ساعَةً وَلا يَسْتَقْدِمُونَ (61)","text":"بِظُلْمِهِمْ بكفرهم ومعاصيهم ما تَرَكَ عَلَيْها أى على الأرض مِنْ دَابَّةٍ قط ولأهلكها كلها بشؤم ظلم الظالمين. وعن أبى هريرة: أنه سمع رجلا يقول: إن الظالم لا يضرّ إلا نفسه، فقال: بلى والله، حتى أنّ الحبارى لتموت في وكرها بظلم الظالم . وعن ابن مسعود: كاد الجعل يهلك في جحره بذنب ابن آدم . أو من دابة ظالمة. وعن ابن عباس مِنْ دَابَّةٍ من مشرك يدب عليها. وقيل: لو أهلك الآباء بكفرهم لم تكن الأبناء.","surah_id":16,"source_id":9},{"ayah_number":62,"ayah_text":"وَيَجْعَلُونَ لِلَّهِ ما يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ الْكَذِبَ أَنَّ لَهُمُ الْحُسْنى لا جَرَمَ أَنَّ لَهُمُ النَّارَ وَأَنَّهُمْ مُفْرَطُونَ (62)","text":"وَيَجْعَلُونَ لِلَّهِ ما يَكْرَهُونَ لأنفسهم من البنات ومن شركاء في رياستهم، ومن الاستخفاف برسلهم والتهاون برسالاتهم. ويجعلون له أرذل أموالهم ولأصنامهم أكرمها وَتَصِفُ أَلْسِنَتُهُمُ مع ذلك أَنَّ لَهُمُ الْحُسْنى عند الله كقوله وَلَئِنْ رُجِعْتُ إِلى رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنى. وعن بعضهم أنه قال لرجل من ذوى اليسار: كيف تكون يوم القيامة إذا قال الله تعالى: هاتوا ما دفع إلى السلاطين وأعوانهم، فيؤتى بالدواب والثياب وأنواع الأموال الفاخرة. وإذا قال: هاتوا ما دفع إلىّ فيؤتى بالكسر والخرق ومالا يؤبه له، أما تستحيي من ذلك الموقف؟ وقرأ هذه الآية.\n\nوعن مجاهد: أنّ لهم الحسنى، هو قول قريش: لنا البنون، وأن لهم الحسنى: بدل من الكذب.\n\nوقرئ الْكَذِبَ جمع كذوب، صفة للألسنة مُفْرَطُونَ قرئ مفتوح الراء ومكسورها مخففاً ومشدّداً، فالمفتوح بمعنى مقدّمون إلى النار معجلون إليها، من أفرطت فلانا، وفرّطته في طلب الماء، إذا قدمته. وقيل. منسيون متروكون، من أفرطت فلانا خلفي إذا خلفته ونسيته.\n\nوالمكسور المخفف، من الإفراط في المعاصي. والمشدّد، من التفريط في الطاعات وما يلزمهم.","surah_id":16,"source_id":9},{"ayah_number":63,"ayah_text":"تَاللَّهِ لَقَدْ أَرْسَلْنا إِلى أُمَمٍ مِنْ قَبْلِكَ فَزَيَّنَ لَهُمُ الشَّيْطانُ أَعْمالَهُمْ فَهُوَ وَلِيُّهُمُ الْيَوْمَ وَلَهُمْ عَذابٌ أَلِيمٌ (63)","text":"فَهُوَ وَلِيُّهُمُ الْيَوْمَ حكاية الحال الماضية التي كان يزين لهم الشيطان أعمالهم فيها. أو فهو وليهم في الدنيا فجعل اليوم عبارة عن زمان الدنيا. ومعنى وَلِيُّهُمُ قرينهم وبئس القرين. أو يجعل فَهُوَ وَلِيُّهُمُ الْيَوْمَ حكاية للحال الآتية، وهي حال كونهم معذبين في النار، أى فهو ناصرهم اليوم لا ناصر لهم غيره، نفياً للناصر لهم على أبلغ الوجوه. ويجوز أن يرجع الضمير إلى مشركي قريش، أنه زين للكفار قبلهم أعمالهم، فهو ولى وهؤلاء، لأنهم منهم. ويجوز أن يكون على حذف المضاف، أى: فهو ولى أمثالهم اليوم.","surah_id":16,"source_id":9},{"ayah_number":64,"ayah_text":"وَما أَنْزَلْنا عَلَيْكَ الْكِتابَ إِلاَّ لِتُبَيِّنَ لَهُمُ الَّذِي اخْتَلَفُوا فِيهِ وَهُدىً وَرَحْمَةً لِقَوْمٍ يُؤْمِنُونَ (64) وَاللَّهُ أَنْزَلَ مِنَ السَّماءِ ماءً فَأَحْيا بِهِ الْأَرْضَ بَعْدَ مَوْتِها إِنَّ فِي ذلِكَ لَآيَةً لِقَوْمٍ يَسْمَعُونَ (65)","text":"وَهُدىً وَرَحْمَةً معطوفان على محل لِتُبَيِّنَ إلا أنهما انتصبا على أنهما مفعول لهما، لأنهما فعلا الذي أنزل الكتاب. ودخل اللام على لتبين: لأنه فعل المخاطب لا فعل المنزل. وإنما ينتصب مفعولا له ما كان فعل فاعل الفعل المعلل. والذي اختلفوا فيه: البعث، لأنه كان فيهم من يؤمن به، ومنهم عبد المطلب، وأشياء من التحريم والتحليل والإنكار والإقرار لِقَوْمٍ يَسْمَعُونَ سماع إنصاف وتدبر، لأنّ من لم يسمع بقلبه، فكأنه أصم لا يسمع.","surah_id":16,"source_id":9},{"ayah_number":66,"ayah_text":"وَإِنَّ لَكُمْ فِي الْأَنْعامِ لَعِبْرَةً نُسْقِيكُمْ مِمَّا فِي بُطُونِهِ مِنْ بَيْنِ فَرْثٍ وَدَمٍ لَبَناً خالِصاً سائِغاً لِلشَّارِبِينَ (66)","text":"ذكر سيبويه الأنعام في باب مالا ينصرف في الأسماء المفردة الواردة على أفعال، كقولهم:\n\nثوب أكياش، ولذلك رجع الضمير إليه مفرداً. وأمّا فِي بُطُونِها في سورة المؤمنين، فلأنّ معناه الجمع. ويجوز أن يقال في الأنعام وجهان، أحدهما: أن يكون تكثير نعم كأجبال في جبل، وأن يكون اسماً مفرداً مقتضياً لمعنى الجمع كنعم، فإذا ذكر فكما يذكر «نعم» في قوله:\n\nفِى كُلِّ عَامٍ نَعَمٌ تَحْوُونَه ... يُلْقِحُهُ قَوْمٌ وَتَنْتِجُونَهْ\n\nوإذا أنث ففيه وجهان: أنه تكسير نعم. وأنه في معنى الجمع. وقرئ نُسْقِيكُمْ بالفتح والضم، وهو استئناف، كأنه قيل: كيف العبرة، فقيل نسقيكم مِنْ بَيْنِ فَرْثٍ وَدَمٍ أى يخلق الله اللبن وسيطاً بين الفرث والدم يكتنفانه، وبينه وبينهما برزخ من قدرة الله لا يبغى أحدهما عليه بلون ولا طعم ولا رائحة، بل هو خالص من ذلك كله. قيل: إذا أكلت البهيمة العلف فاستقرّ في كرشها طبخته، فكان أسفله فرثا، وأوسطه لبنا، وأعلاه دما. والكبد مسلطة على هذه الأصناف الثلاثة تقسمها، فتجرى الدم في العروق، واللبن في الضرع، وتبقى الفرث في الكرش.\n\nفسبحان الله ما أعظم قدرته وألطف حكمته لمن تفكر وتأمّل. وسئل شقيق عن الإخلاص فقال: تمييز العمل من العيوب، كتمييز اللبن من بين فرث ودم سائِغاً سهل المرور في الحلق.\n\nويقال: لم يغص أحد باللبن قط. وقرئ: سيغاً، بالتشديد. وسيغاً، بالتخفيف. كهين ولين.\n\nفإن قلت: أى فرق بين «من» الأولى والثانية؟ قلت: الأولى للتبعيض، لأن اللبن بعض ما في بطونها، كقولك: أخذت من مال زيد ثوباً. والثانية لابتداء الغاية، لأن بين الفرث والدم مكان الإسقاء الذي منه يبتدأ، فهو صلة لنسقيكم، كقولك: سقيته من الحوض، ويجوز أن يكون حالا من قوله لَبَناً مقدما عليه، فيتعلق بمحذوف، أى: كائناً من بين فرث ودم.\n\nألا ترى أنه لو تأخر فقيل: لبناً من بين فرث ودم كان صفة له، وإنما قدم لأنه موضع العبرة، فهو قمن بالتقديم. وقد احتج بعض من يرى أن المنى طاهر على من جعله نجسا، لجريه في مسلك البول بهذه الآية، وأنه ليس بمستنكر أن يسلك مسلك البول وهو طاهر، كما خرج اللبن من بين فرث ودم طاهراً.","surah_id":16,"source_id":9},{"ayah_number":67,"ayah_text":"وَمِنْ ثَمَراتِ النَّخِيلِ وَالْأَعْنابِ تَتَّخِذُونَ مِنْهُ سَكَراً وَرِزْقاً حَسَناً إِنَّ فِي ذلِكَ لَآيَةً لِقَوْمٍ يَعْقِلُونَ (67)","text":"فإن قلت: بم تعلق قوله وَمِنْ ثَمَراتِ النَّخِيلِ وَالْأَعْنابِ؟ قلت: بمحذوف تقديره:\n\nونسقيكم من ثمرات النخيل والأعناب، أى: من عصيرها، وحذف لدلالة نسقيكم قبله عليه، وقوله تَتَّخِذُونَ مِنْهُ سَكَراً بيان وكشف عن كنه الإسقاء. أو يتعلق بتتخذون، ومنه من تكرير الظرف للتوكيد، كقولك: زيد في الدار فيها. ويجوز أن يكون تَتَّخِذُونَ صفة موصوف محذوف، كقوله:\n\n... بِكَفّىْ كَانَ مِنْ أرْمَى الْبَشَرْ تقديره: ومن ثمرات النخيل والأعناب ثمر تتخذون منه سكراً ورزقا حسناً، لأنهم يأكلون بعضها ويتخذون من بعضها السكر. فإن قلت: فإلام يرجع الضمير في منه إذا جعلته ظرفا مكرّراً؟\n\nقلت: إلى المضاف المحذوف الذي هو العصير كما رجع في قوله تعالى أَوْ هُمْ قائِلُونَ إلى الأهل المحذوف، والسكر: الخمر، سميت بالمصدر من سكر سكراً وسكراً. نحو رشد رشداً ورشداً. قال:\n\nوَجَاؤُنَا بهم سَكَرٌ عَلَيْنَا ... فَأَجْلَى اليَوْمُ وَالسَّكْرَانُ صَاحِى\n\nوفيه وجهان: أحدهما أن تكون منسوخة. وممن قال بنسخها: الشعبي والنخعي. والثاني أن يجمع بين العتاب والمنة. وقيل: السكر النبيذ، وهو عصير العنب والزبيب والتمر إذا طبخ حتى يذهب ثلثاه، ثم يترك حتى يشتدّ، وهو حلال عند أبى حنيفة إلى حدّ السكر ويحتج بهذه الآية وبقوله صلى الله عليه وسلم «الخمر حرام لعينها والسكر من كل شراب» وبأخبار جمة. ولقد صنف شيخنا أبو على الجبائي قدّس الله روحه غير كتاب في تحليل النبيذ، فلما شيخ وأخذت منه السنّ العالية قيل له: لو شربت منه ما تتقوى به، فأبى. فقيل له: فقد صنفت في تحليله، فقال:\n\nتناولته الدعارة فسمج في المروءة. وقيل: السكر الطعم وأنشد:\n\nجَعَلْتُ أَعْرَاضَ الكِرَامِ سَكَرَا\n\nأى تنقلت بأعراضهم . وقيل هو من الخمر، وإنه إذا ابترك في أعراض الناس، فكأنه تخمر بها. والرزق الحسن: الخل والرب والتمر والزبيب وغير ذلك. ويجوز أن يجعل السكر رزقاً حسناً، كأنه قيل: تتخذون منه ما هو سكر ورزق حسن.","surah_id":16,"source_id":9},{"ayah_number":68,"ayah_text":"وَأَوْحى رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبالِ بُيُوتاً وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ (68) ثُمَّ كُلِي مِنْ كُلِّ الثَّمَراتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلاً يَخْرُجُ مِنْ بُطُونِها شَرابٌ مُخْتَلِفٌ أَلْوانُهُ فِيهِ شِفاءٌ لِلنَّاسِ إِنَّ فِي ذلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ (69)","text":"الإيحاء إلى النحل: إلهامها والقذف في قلوبها وتعليمها على وجه هو أعلم به، لا سبيل لأحد إلى الوقوف عليه، وإلا فنيقتها في صنعتها، ولطفها في تدبير أمرها، وإصابتها فيما يصلحها، دلائل بينة شاهدة على أنّ الله أودعها علماً بذلك وفطنها، كما أولى أولى العقول عقولهم. وقرأ يحيى بن وثاب إِلَى النَّحْلِ بفتحتين. وهو مذكر كالنخل، وتأنيثه على المعنى أَنِ اتَّخِذِي هي أن المفسرة، لأنّ الإيحاء فيه معنى القول. وقرئ: «بيوتا» بكسر الباء لأجل الياء. ويَعْرِشُونَ بكسر الراء وضمها: يرفعون من سقوف البيوت. وقيل: ما يبنون للنحل في الجبال والشجر والبيوت من الأماكن التي تتعسل فيها. والضمير في يَعْرِشُونَ للناس. فإن قلت: ما معنى «من» في قوله أَنِ اتَّخِذِي مِنَ الْجِبالِ بُيُوتاً وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ وهلا قيل في الجبال وفي الشجر؟ قلت: أريد معنى البعضية، وأن لا تبنى بيوتها في كل جبل وكل شجر وكل ما يعرش ولا في كل مكان منها مِنْ كُلِّ الثَّمَراتِ إحاطة بالثمرات التي تجرسها النحل وتعتاد أكلها، أى ابني البيوت، ثم كلى من كل ثمرة تشتهينها، فإذا أكلتها فَاسْلُكِي سُبُلَ رَبِّكِ أى الطرق التي ألهمك وأفهمك في عمل العسل. أو فاسلكي ما أكلت في سبل ربك، أى في مسالكه التي يحيل فيها بقدرته النور المرّ عسلا من أجوافك ومنافذ مآكلك. أو إذا أكلت الثمار في المواضع البعيدة من بيوتك، فاسلكي إلى بيوتك راجعة سبل ربك، لا تتوعر عليك ولا تضلين فيها،  فقد بلغني أنها ربما أجدب عليها ما حولها فتسافر إلى البلد البعيد في طلب النجعة. أو أراد بقوله ثُمَّ كُلِي ثم اقصدي أكل الثمرات فاسلكي في طلبها في مظانها سبل ربك ذُلُلًا جمع ذلول، وهي حال من السبل، لأنّ الله ذللها لها ووطأها وسهلها، كقوله هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا أو من الضمير في فَاسْلُكِي أى: وأنت ذلل منقادة لما أمرت به غير ممتنعة شَرابٌ يريد العسل، لأنه مما يشرب مُخْتَلِفٌ أَلْوانُهُ منه أبيض وأسود وأصفر وأحمر فِيهِ شِفاءٌ لِلنَّاسِ لأنه من جملة الأشفية والأدوية المشهورة النافعة، وقلّ معجون من المعاجين لم يذكر الأطباء فيه العسل، وليس الغرض أنه شفاء لكل مريض، كما أن كل دواء كذلك.\n\nوتنكيره إمّا لتعظيم الشفاء الذي فيه، أو لأن فيه بعض الشفاء، وكلاهما محتمل. وعن النبي صلى الله عليه وسلم أن رجلا جاء إليه فقال: إن أخى يشتكى بطنه، فقال: «اذهب واسقه العسل» فذهب ثم رجع فقال: قد سقيته فما نفع، فقال: «اذهب واسقه عسلا» فقد صدق الله وكذب بطن أخيك، فسقاه فشفاه الله فبرأ، كأنما أنشط من عقال . وعن عبد الله بن مسعود:\n\nالعسل شفاء من كل داء، والقرآن شفاء لما في الصدور، فعليكم بالشفاءين: القرآن والعسل .\n\nومن بدع تأويلات الرافضة: أن المراد بالنحل علىّ وقومه: وعن بعضهم أنه قال عند المهدى:\n\nإنما النحل بنو هاشم، يخرج من بطونهم العلم، فقال له رجل: جعل الله طعامك وشرابك مما يخرج من بطونهم فضحك المهدى وحدث به المنصور، فاتخذوه أضحوكة من أضاحيكهم.","surah_id":16,"source_id":9},{"ayah_number":70,"ayah_text":"وَاللَّهُ خَلَقَكُمْ ثُمَّ يَتَوَفَّاكُمْ وَمِنْكُمْ مَنْ يُرَدُّ إِلى أَرْذَلِ الْعُمُرِ لِكَيْ لا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئاً إِنَّ اللَّهَ عَلِيمٌ قَدِيرٌ (70)","text":"إِلى أَرْذَلِ الْعُمُرِ إلى أخسه وأحقره وهو خمس وسبعون سنة عن علىّ رضى الله عنه.\n\nوتسعون سنة عن قتادة، لأنه لا عمر أسوأ حالا من عمر الهرم لِكَيْ لا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئاً ليصير إلى حالة شبيهة بحال الطفولة في النسيان، وأن يعلم شيئا ثم يسرع في نسيانه فلا يعلمه إن سئل عنه. وقيل: لئلا يعقل من بعد عقله الأوّل شيئاً: وقيل: لئلا يعلم زيادة علم على علمه.","surah_id":16,"source_id":9},{"ayah_number":71,"ayah_text":"وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلى بَعْضٍ فِي الرِّزْقِ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلى ما مَلَكَتْ أَيْمانُهُمْ فَهُمْ فِيهِ سَواءٌ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ (71)","text":"أى: جعلكم متفاوتين في الرزق، فرزقكم أفضل مما رزق مماليككم وهم بشر مثلكم وإخوانكم فكان ينبغي أن تردوا فضل ما رزقتموه عليهم، حتى تتساووا في الملبس والمطعم، كما يحكى عن أبى ذرّ أنه سمع النبي صلى الله عليه وسلم يقول: إنما هم إخوانكم، فاكسوهم مما تلبسون، وأطعموهم مما تطعمون فما رئي عبده بعد ذلك إلا ورداؤه رداؤه وإزاره إزاره من عير تفاوت أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ فجعل ذلك من جملة جحود النعمة. وقيل: هو مثل ضربه الله للذين جعلوا له شركاء، فقال لهم: أنتم لا تسوّون بينكم وبين عبيدكم فيما أنعمت به عليكم، ولا تجعلونهم فيه شركاء، ولا ترضون ذلك لأنفسكم فكيف رضيتم أن تجعلوا عبيدي لي شركاء. وقيل المعنى أنّ الموالي والمماليك أنا رازقهم جميعاً، فهم في رزقي سواء، فلا تحسبن الموالي أنهم يردون على مماليكهم من عندهم شيئاً من الرزق. فإنما ذلك رزقي أجريه إليهم على أيديهم. وقرئ: يجحدون، بالتاء والياء.","surah_id":16,"source_id":9},{"ayah_number":72,"ayah_text":"وَاللَّهُ جَعَلَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْواجاً وَجَعَلَ لَكُمْ مِنْ أَزْواجِكُمْ بَنِينَ وَحَفَدَةً وَرَزَقَكُمْ مِنَ الطَّيِّباتِ أَفَبِالْباطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ اللَّهِ هُمْ يَكْفُرُونَ (72)","text":"مِنْ أَنْفُسِكُمْ من جنسكم. وقيل: هو خلق حواء من ضلع آدم. والحفدة: جمع حافد، وهو الذي يحفد، أى يسرع في الطاعة والخدمة. ومنه قول القانت. وإليك نسعى ونحفد وقال:\n\nحَفَدَ الْوَلَائِدَ بَيْنَهُنَّ وَأُسْلِمَتْ ... بِأَكُفِّهِنَّ أزِمَّةَ الأَجْمَالِ\n\nواختلف فيهم فقيل: هم الأختان على البنات وقيل: أولاد الأولاد. وقيل: أولاد المرأة من الزوج الأوّل. وقيل: المعنى وجعل لكم حفدة، أى خدما يحفدون في مصالحكم ويعينونكم ويجوز أن يراد بالحفدة: البنون أنفسهم، كقوله سَكَراً وَرِزْقاً حَسَناً كأنه قيل: وجعل لكم منهنّ أولاداً هم بنون وهم حافدون، أى جامعون بين الأمرين مِنَ الطَّيِّباتِ يريد بعضها، لأنّ كل الطيبات في الجنة، وما طيبات الدنيا إلا أنموذج منها أَفَبِالْباطِلِ يُؤْمِنُونَ وهو ما يعتقدون من منفعة الأصنام وبركتها وشفاعتها، وما هو إلا وهم باطل لم يتوصلوا إليه بدليل ولا أمارة، فليس لهم إيمان إلا به، كأنه شيء معلوم مستيقن. ونعمة الله المشاهدة المعاينة التي لا شبهة فيها لذي عقل وتمييز: هم كافرون بها منكرون لها كما ينكر المحال الذي لا يتصوره العقول.\n\nوقيل: الباطل ما يسوّل لهم الشيطان من تحريم البحيرة والسائبة وغيرهما. ونعمة الله: ما أحل لهم.","surah_id":16,"source_id":9},{"ayah_number":73,"ayah_text":"وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ ما لا يَمْلِكُ لَهُمْ رِزْقاً مِنَ السَّماواتِ وَالْأَرْضِ شَيْئاً وَلا يَسْتَطِيعُونَ (73)","text":"الرزق يكون بمعنى المصدر، وبمعنى ما يرزق، فإن أردت المصدر نصبت به شَيْئاً كقوله أَوْ إِطْعامٌ...... يَتِيماً على: لا يملك أن يرزق شيئاً. وإن أردت المرزوق كان شيئا بدلا منه بمعنى قليلا. ويجوز أن يكون تأكيداً للا يملك: أى لا يملك شيئاً من. الملك. ومِنَ السَّماواتِ وَالْأَرْضِ: صلة للرزق إن كان مصدراً بمعنى: لا يرزق من السموات مطرا، ولا من الأرض نباتاً. أو صفة إن كان اسما لما يرزق. والضمير في وَلا يَسْتَطِيعُونَ لما، لأنه في معنى الآلهة، بعد ما قيل لا يَمْلِكُ على اللفظ. ويجوز أن يكون للكفار، يعنى: ولا يستطيع هؤلاء- مع أنهم أحياء متصرفون أولو ألباب- من ذلك شيئا، فكيف بالجماد الذي لا حسن به.\n\nفإن قلت: ما معنى قوله وَلا يَسْتَطِيعُونَ بعد قوله لا يَمْلِكُ؟ وهل هما إلا شيء واحد؟ قلت:\n\nليس في لا يَسْتَطِيعُونَ تقدير راجع، وإنما المعنى: لا يملكون أن يرزقوا، والاستطاعة منفية عنهم أصلا، لأنهم موات، إلا أن يقدر الراجع ويراد بالجمع بين نفى الملك والاستطاعة للتوكيد أو يراد: أنهم لا يملكون الرزق ولا يمكنهم أن يملكوه، ولا يتأتى ذلك منهم ولا يستقيم.","surah_id":16,"source_id":9},{"ayah_number":74,"ayah_text":"فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ اللَّهَ يَعْلَمُ وَأَنْتُمْ لا تَعْلَمُونَ (74)","text":"فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ تمثيل للإشراك بالله والتشبيه به ، لأنّ من يضرب الأمثال مشبه حالا بحال وقصة بقصة إِنَّ اللَّهَ يَعْلَمُ كنه ما تفعلون وعظمه، وهو معاقبكم عليه بما يوازيه في العظم، لأنّ العقاب على مقدار الإثم وَأَنْتُمْ لا تَعْلَمُونَ كنهه وكنه عقابه، فذاك هو الذي جرّكم إليه وجرأكم عليه، فهو تعليل للنهى عن الشرك. ويجوز أن يراد: فلا تضربوا لله الأمثال، إنّ الله يعلم كيف يضرب الأمثال، وأنتم لا تعلمون.","surah_id":16,"source_id":9},{"ayah_number":75,"ayah_text":"ضَرَبَ اللَّهُ مَثَلاً عَبْداً مَمْلُوكاً لا يَقْدِرُ عَلى شَيْءٍ وَمَنْ رَزَقْناهُ مِنَّا رِزْقاً حَسَناً فَهُوَ يُنْفِقُ مِنْهُ سِرًّا وَجَهْراً هَلْ يَسْتَوُونَ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لا يَعْلَمُونَ (75)","text":"ثم علمهم كيف تضرب فقال: مثلكم في إشراككم بالله الأوثان: مثل من سوّى بين عبد مملوك عاجز عن التصرف، وبين حرّ مالك قد رزقه الله مالا فهو يتصرف فيه وينفق منه كيف شاء.\n\nفإن قلت: لم قال مَمْلُوكاً لا يَقْدِرُ عَلى شَيْءٍ وكل عبد مملوك، وغير قادر على التصرف؟\n\nقلت: أما ذكر المملوك فليميز من الحرّ، لأن اسم العبد يقع عليهما جميعا، لأنهما من عباد الله.\n\nوأما لا يَقْدِرُ عَلى شَيْءٍ فليجعل غير مكاتب ولا مأذون له، لأنهما يقدران على التصرف. واختلفوا في العبد هل يصح له ملك؟ والمذهب الظاهر أنه لا يصحّ له. فإن قلت: مَنْ في قوله وَمَنْ رَزَقْناهُ ما هي؟ قلت: الظاهر أنها موصوفة، كأنه قيل: وحراً رزقناه، ليطابق عبداً. ولا يمتنع أن تكون موصولة. فإن قلت: لم قيل يَسْتَوُونَ على الجمع؟ قلت: معناه:\n\nهل يستوي الأحرار والعبيد؟","surah_id":16,"source_id":9},{"ayah_number":76,"ayah_text":"وَضَرَبَ اللَّهُ مَثَلاً رَجُلَيْنِ أَحَدُهُما أَبْكَمُ لا يَقْدِرُ عَلى شَيْءٍ وَهُوَ كَلٌّ عَلى مَوْلاهُ أَيْنَما يُوَجِّهْهُ لا يَأْتِ بِخَيْرٍ هَلْ يَسْتَوِي هُوَ وَمَنْ يَأْمُرُ بِالْعَدْلِ وَهُوَ عَلى صِراطٍ مُسْتَقِيمٍ (76)","text":"الأبكم الذي ولد أخرس، فلا يَفهم ولا يُفهم وَهُوَ كَلٌّ عَلى مَوْلاهُ أى ثقل وعيال على من يلي أمره ويعوله أَيْنَما يُوَجِّهْهُ حيثما يرسله ويصرفه في مطلب حاجة أو كفاية مهم، لم ينفع ولم يأت بنجح هَلْ يَسْتَوِي هُوَ وَمَنْ هو سليم الحواس نفاعا ذو كفايات، مع رشد وديانة، فهو يَأْمُرُ الناس بِالْعَدْلِ والخير وَهُوَ في نفسه عَلى صِراطٍ مُسْتَقِيمٍ على سيرة صالحة ودين قويم. وهذا مثل ثان ضربه الله لنفسه ولما يفيض على عباده ويشملهم من آثار رحمته وألطافه ونعمه الدينية والدنيوية، وللأصنام التي هي أموات لا تضر ولا تنفع وقرئ: أينما يوجه، بمعنى أينما يتوجه، من قولهم: أينما أوجه ألق سعداً: وقرأ ابن مسعود:\nأينما يوجه، على البناء للمفعول.","surah_id":16,"source_id":9},{"ayah_number":77,"ayah_text":"وَلِلَّهِ غَيْبُ السَّماواتِ وَالْأَرْضِ وَما أَمْرُ السَّاعَةِ إِلاَّ كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ إِنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ (77)","text":"وَلِلَّهِ غَيْبُ السَّماواتِ وَالْأَرْضِ أى يختصّ به علم ما غاب فيهما عن العباد وخفى عليهم علمه. أو أراد بغيب السموات والأرض: يوم القيامة، على أن علمه غائب عن أهل السموات والأرض لم يطلع عليه أحد منهم إِلَّا كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ أى هو عند الله وإن تراخى، كما تقولون أنتم في الشيء الذي تستقربونه: هو كلمح البصر أو هو أقرب، إذا بالغتم في استقرابه.\n\nونحوه قوله: وَيَسْتَعْجِلُونَكَ بِالْعَذابِ وَلَنْ يُخْلِفَ اللَّهُ وَعْدَهُ وَإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ أى هو عنده دان وهو عندكم بعيد. وقيل: المعنى أن إقامة الساعة وإماتة الأحياء وإحياء الأموات من الأولين والآخرين، يكون في أقرب وقت وأوحاه ، إِنَّ اللَّهَ عَلى كُلِّ شَيْءٍ قَدِيرٌ فهو يقدر على أن يقيم الساعة ويبعث الخلق، لأنه بعض المقدورات. ثم دل على قدرته بما بعده.","surah_id":16,"source_id":9},{"ayah_number":78,"ayah_text":"وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهاتِكُمْ لا تَعْلَمُونَ شَيْئاً وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصارَ وَالْأَفْئِدَةَ لَعَلَّكُمْ تَشْكُرُونَ (78)","text":"قرئ أُمَّهاتِكُمْ بضم الهمزة وكسرها، والهاء مزيدة في أمات، كما زيدت في أراق، فقيل: أهراق. وشذت زيادتها في الواحدة قال:\n\nأُمَّهَتِى خِنْدِفٌ وَإلْيَاسُ أبىِ\n\nلا تَعْلَمُونَ شَيْئاً في موضع الحال. ومعناه: غير عالمين شيئاً من حق المنعم الذي خلقكم في البطون، وسوّاكم وصوّركم، ثم أخرجكم من الضيق إلى السعة. وقوله وَجَعَلَ لَكُمُ معناه:\n\nوما ركب فيكم هذه الأشياء إلا آلات لإزالة الجهل الذي ولدتم عليه واجتلاب العلم والعمل به، من شكر المنعم وعبادته، والقيام بحقوقه، والترقي إلى ما يسعدكم. والأفئدة في فؤاد، كالأغربة في غراب، وهو من جموع القلة التي جرت مجرى جموع الكثرة، والقلة إذا لم يرد في السماع غيرها، كما جاء شسوع في جمع شسع لا غير، فجرت ذلك المجرى.","surah_id":16,"source_id":9},{"ayah_number":79,"ayah_text":"أَلَمْ يَرَوْا إِلَى الطَّيْرِ مُسَخَّراتٍ فِي جَوِّ السَّماءِ ما يُمْسِكُهُنَّ إِلاَّ اللَّهُ إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يُؤْمِنُونَ (79)","text":"قرئ: لم يروا، بالتاء والياء مُسَخَّراتٍ مذللات للطيران بما خلق لها من الأجنحة والأسباب المواتية لذلك. والجوّ: الهواء المتباعد من الأرض في سمت العلوّ والسكاك أبعد منه، واللوح مثله ما يُمْسِكُهُنَّ في قبضهن وبسطهن ووقوفهن إِلَّا اللَّهُ بقدرته.","surah_id":16,"source_id":9},{"ayah_number":80,"ayah_text":"وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَناً وَجَعَلَ لَكُمْ مِنْ جُلُودِ الْأَنْعامِ بُيُوتاً تَسْتَخِفُّونَها يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقامَتِكُمْ وَمِنْ أَصْوافِها وَأَوْبارِها وَأَشْعارِها أَثاثاً وَمَتاعاً إِلى حِينٍ (80)","text":"مِنْ بُيُوتِكُمْ التي تسكنونها من الحجر والمدر والأخبية وغيرها. والسكن: فعل بمعنى مفعول، وهو ما يسكن إليه وينقطع إليه من بيت أو إلف بُيُوتاً هي القباب والأبنية من الأدم والأنطاع تَسْتَخِفُّونَها ترونها خفيفة المحمل في الضرب والنقض والنقل يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقامَتِكُمْ أى يوم ترحلون خف عليكم حملها ونقلها ، ويوم تنزلون وتقيمون في مكان لم يثقل عليكم ضربها. أو هي خفيفة عليكم في أوقات السفر والحضر جميعاً، على أنّ اليوم بمعنى الوقت وَمَتاعاً وشيئاً ينتفع به إِلى حِينٍ إلى أن تقضوا منه أوطاركم. أو إلى أن يبلى ويفنى، أو إلى أن تموتوا. وقرئ: يوم ظعنكم، بالسكون.","surah_id":16,"source_id":9},{"ayah_number":81,"ayah_text":"وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ ظِلالاً وَجَعَلَ لَكُمْ مِنَ الْجِبالِ أَكْناناً وَجَعَلَ لَكُمْ سَرابِيلَ تَقِيكُمُ الْحَرَّ وَسَرابِيلَ تَقِيكُمْ بَأْسَكُمْ كَذلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ (81)","text":"مِمَّا خَلَقَ من الشجر وسائر المستظلات أَكْناناً جمع كنّ، وهو ما يستكنّ به من البيوت المنحوتة في الجبال والغيران والكهوف سَرابِيلَ هي القمصان والثياب من الصوف والكتان والقطن وغيرها تَقِيكُمُ الْحَرَّ لم يذكر البرد، لأنّ الوقاية من الحرّ أهمّ عندهم، وقلما يهمهم البرد لكونه يسيراً محتملا. وقيل: ما يقي من الحرّ يقي من البرد فدل ذكر الحرّ على البرد وَسَرابِيلَ تَقِيكُمْ بَأْسَكُمْ يريد الدروع والجواشن والسربال عامّ يقع على كل ما كان من حديد وغيره لَعَلَّكُمْ تُسْلِمُونَ أى تنظرون في نعمه الفائضة فتؤمنون به وتنقادون له. وقرئ: تسلمون، من السلامة: أى تشكرون فتسلمون من العذاب. أو تسلم قلوبكم من الشرك. وقيل: تسلمون من الجراح بلبس الدروع.","surah_id":16,"source_id":9},{"ayah_number":82,"ayah_text":"فَإِنْ تَوَلَّوْا فَإِنَّما عَلَيْكَ الْبَلاغُ الْمُبِينُ (82) يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنْكِرُونَها وَأَكْثَرُهُمُ الْكافِرُونَ (83)","text":"فَإِنْ تَوَلَّوْا فلم يقبلوا منك فقد تمهد عذرك بعد ما أدّيت ما وجب عليك من التبليغ، فذكر سبب العذر وهو البلاغ ليدل على المسبب يَعْرِفُونَ نِعْمَتَ اللَّهِ التي عددناها حيث يعترفون بها وأنها من الله ثُمَّ يُنْكِرُونَها بعبادتهم غير المنعم بها وقولهم: هي من الله ولكنها بشفاعة آلهتنا. وقيل: إنكارهم قولهم ورثناها من آبائنا. وقيل: قولهم لولا فلان ما أصبت كذا لبعض نعم الله. وإنما لا يجوز التكلم بنحو هذا إذا لم يعتقد أنها من الله وأنه أجراها على يد فلان وجعله سبباً في نيلها وَأَكْثَرُهُمُ الْكافِرُونَ أى الجاحدون غير المعترفين. وقيل نِعْمَتَ اللَّهِ نبوّة محمد عليه السلام، كانوا يعرفونها ثم ينكرونها عناداً، وأكثرهم الجاحدون المنكرون بقلوبهم. فإن قلت: ما معنى ثم؟ قلت: الدلالة على أن إنكارهم أمر مستبعد بعد حصول المعرفة، لأنّ حق من عرف النعمة أن يعترف لا أن ينكر.","surah_id":16,"source_id":9},{"ayah_number":84,"ayah_text":"وَيَوْمَ نَبْعَثُ مِنْ كُلِّ أُمَّةٍ شَهِيداً ثُمَّ لا يُؤْذَنُ لِلَّذِينَ كَفَرُوا وَلا هُمْ يُسْتَعْتَبُونَ (84) وَإِذا رَأَى الَّذِينَ ظَلَمُوا الْعَذابَ فَلا يُخَفَّفُ عَنْهُمْ وَلا هُمْ يُنْظَرُونَ (85)","text":"شَهِيداً نبيها يشهد لهم وعليهم بالإيمان والتصديق، والكفر والتكذيب ثُمَّ لا يُؤْذَنُ لِلَّذِينَ كَفَرُوا في الاعتذار. والمعنى. لا حجة لهم، فدل بترك الإذن على أن لا حجة لهم ولا عذر، وكذا عن الحسن وَلا هُمْ يُسْتَعْتَبُونَ ولا هم يسترضون، أى: لا يقال لهم أرضوا ربكم:\n\nلأن الآخرة ليست بدار عمل. فإن قلت: فما معنى ثم هذه؟ قلت: معناها أنهم يمنون بعد شهادة الأنبياء بما هو أطم منها، وهو أنهم يمنعون الكلام فلا يؤذن لهم في إلقاء معذرة ولا إدلاء بحجة. وانتصاب اليوم بمحذوف تقديره: واذكر يوم نبعث، أو يوم نبعث وقعوا فيما وقعوا فيه، وكذلك إذا رأوا العذاب بغتهم وثقل عليهم فَلا يُخَفَّفُ عَنْهُمْ وَلا هُمْ يُنْظَرُونَ كقوله بَلْ تَأْتِيهِمْ بَغْتَةً فَتَبْهَتُهُمْ ... الآية.","surah_id":16,"source_id":9},{"ayah_number":86,"ayah_text":"وَإِذا رَأَى الَّذِينَ أَشْرَكُوا شُرَكاءَهُمْ قالُوا رَبَّنا هؤُلاءِ شُرَكاؤُنَا الَّذِينَ كُنَّا نَدْعُوا مِنْ دُونِكَ فَأَلْقَوْا إِلَيْهِمُ الْقَوْلَ إِنَّكُمْ لَكاذِبُونَ (86) وَأَلْقَوْا إِلَى اللَّهِ يَوْمَئِذٍ السَّلَمَ وَضَلَّ عَنْهُمْ ما كانُوا يَفْتَرُونَ (87)","text":"إن أرادوا بالشركاء آلهتهم، فمعنى شُرَكاؤُنَا آلهتنا التي دعوناها شركاء. وإن أرادوا الشياطين، فلأنهم شركاؤهم في الكفر وقرناؤهم في الغىّ: ونَدْعُوا بمعنى نعبد. فإن قلت: لم قالوا إِنَّكُمْ لَكاذِبُونَ وكانوا يعبدونهم على الصحة؟ قلت: لما كانوا غير راضين بعبادتهم فكأن عبادتهم لم تكن عبادة. والدليل عليه قول الملائكة كانُوا يَعْبُدُونَ الْجِنَّ يعنون أن الجن كانوا راضين بعبادتهم لا نحن، فهم المعبودون دوننا. أو كذبوهم في تسميتهم شركاء وآلهة تنزيها لله من الشريك. وإن أريد بالشركاء الشياطين، جاز أن يكون «كاذبين» في قولهم إِنَّكُمْ لَكاذِبُونَ كما يقول الشيطان: إنى كفرت بما أشركتمونى من قبل وَأَلْقَوْا يعنى الذين ظلموا. وإلقاء السلم: الاستسلام لأمر الله وحكمه بعد الإباء والاستكبار في الدنيا وَضَلَّ عَنْهُمْ وبطل عنهم ما كانُوا يَفْتَرُونَ من أن لله شركاء، وأنهم ينصرونهم ويشفعون لهم حين كذبوهم وتبرؤا منهم.","surah_id":16,"source_id":9},{"ayah_number":88,"ayah_text":"الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ بِما كانُوا يُفْسِدُونَ (88)","text":"الَّذِينَ كَفَرُوا في أنفسهم، وحملوا غيرهم على الكفر: يضاعف الله عقابهم كما ضاعفوا كفرهم. وقيل في زيادة عذابهم حيات أمثال البخت وعقارب أمثال البغال تلسع إحداهن اللسعة فيجد صاحبها حمتها أربعين خريفا. وقيل: يخرجون من النار إلى الزمهرير فيبادرون من شدة برده إلى النار بِما كانُوا يُفْسِدُونَ بكونهم مفسدين الناس بصدّهم عن سبيل الله.","surah_id":16,"source_id":9},{"ayah_number":89,"ayah_text":"وَيَوْمَ نَبْعَثُ فِي كُلِّ أُمَّةٍ شَهِيداً عَلَيْهِمْ مِنْ أَنْفُسِهِمْ وَجِئْنا بِكَ شَهِيداً عَلى هؤُلاءِ وَنَزَّلْنا عَلَيْكَ الْكِتابَ تِبْياناً لِكُلِّ شَيْءٍ وَهُدىً وَرَحْمَةً وَبُشْرى لِلْمُسْلِمِينَ (89)","text":"شَهِيداً عَلَيْهِمْ مِنْ أَنْفُسِهِمْ يعنى نبيهم، لأنه كان يبعث أنبياء الأمم فيهم منهم وَجِئْنا بِكَ يا محمد شَهِيداً عَلى هؤُلاءِ على أمتك تِبْياناً بيانا بليغاً ونظير «تبيان» «تلقاء» في كسر أوله، وقد جوز الزجاج فتحه في غير القرآن. فإن قلت: كيف كان القرآن تبيانا لِكُلِّ شَيْءٍ؟\n\nقلت: المعنى أنه بين كل شيء من أمور الدين، حيث كان نصا على بعضها وإحالة على السنة، حيث أمر فيه باتباع رسول الله صلى الله عليه وسلم وطاعته. وقيل: وما ينطق عن الهوى. وحثاً على الإجماع في قوله وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ وقد رضى رسول الله صلى الله عليه وسلم لأمته اتباع أصحابه، والاقتداء بآثارهم في قوله صلى الله عليه وسلم «أصحابى كالنجوم بأيهم اقتديتم اهتديتم» وقد اجتهدوا وقاسوا ووطئوا طرق القياس والاجتهاد، فكانت السنة والإجماع والقياس والاجتهاد، مستندة إلى تبيان الكتاب، فمن ثمّ كان تبيانا لكل شيء.","surah_id":16,"source_id":9},{"ayah_number":90,"ayah_text":"إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسانِ وَإِيتاءِ ذِي الْقُرْبى وَيَنْهى عَنِ الْفَحْشاءِ وَالْمُنْكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ (90)","text":"العدل هو الواجب، لأن الله تعالى عدل فيه على عباده فجعل ما فرضه عليهم واقعاً تحت طاقتهم وَالْإِحْسانِ الندب، وإنما علق أمره بهما جميعاً، لأنّ الفرض لا بدّ من أن يقع فيه تفريط فيجبره الندب، ولذلك قال رسول الله صلى الله عليه وسلم- لمن علمه الفرائض فقال: والله لا زدت فيها ولا نقصت-: «أفلح إن صدق» فعقد الفلاح بشرط الصدق والسلامة من التفريط وقال صلى الله عليه وسلم «استقيموا ولن تحصوا» فما ينبغي أن يترك ما يجبر كسر التفريط ممن النوافل. والفواحش: ما جاوز حدود الله وَالْمُنْكَرِ ما تنكره العقول وَالْبَغْيِ طلب التطاول بالظلم، وحين أسقطت من الخطب لعنة الملاعين على أمير المؤمنين علىّ رضى الله عنه، أقيمت هذه الآية مقامها. ولعمري إنها كانت فاحشة ومنكراً وبغياً، ضاعف الله لمن سنها غضباً ونكالا وخزيا، إجابة لدعوة نبيه: «وعاد من عاداه» وكانت سبب إسلام عثمان بن مظعون.","surah_id":16,"source_id":9},{"ayah_number":91,"ayah_text":"وَأَوْفُوا بِعَهْدِ اللَّهِ إِذا عاهَدْتُمْ وَلا تَنْقُضُوا الْأَيْمانَ بَعْدَ تَوْكِيدِها وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلاً إِنَّ اللَّهَ يَعْلَمُ ما تَفْعَلُونَ (91) وَلا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَها مِنْ بَعْدِ قُوَّةٍ أَنْكاثاً تَتَّخِذُونَ أَيْمانَكُمْ دَخَلاً بَيْنَكُمْ أَنْ تَكُونَ أُمَّةٌ هِيَ أَرْبى مِنْ أُمَّةٍ إِنَّما يَبْلُوكُمُ اللَّهُ بِهِ وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيامَةِ ما كُنْتُمْ فِيهِ تَخْتَلِفُونَ (92)","text":"عهد الله: هي البيعة لرسول الله صلى الله عليه وسلم على الإسلام إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ اللَّهَ. وَلا تَنْقُضُوا أيمان البيعة بَعْدَ تَوْكِيدِها أى بعد توثيقها باسم الله. وأكد ووكد: لغتان فصيحتان، والأصل الواو، والهمزة بدل كَفِيلًا شاهداً ورقيباً، لأن الكفيل مراع لحال المكفول به مهيمن عليه وَلا تَكُونُوا في نقض الأيمان كالمرأة التي أنحت على غزلها بعد أَن أحكمته وأبرمته فجعلته أَنْكاثاً جمع نكث وهو ما ينكث فتله. قيل: هي ريطة بنت سعد بن تيم وكانت خرقاء، اتخذت مغزلا قدر ذراع وصنارة مثل أصبع وفلكة عظيمة على قدرها، فكانت تغزل هي وجواريها من الغداة إلى الظهر، ثم تأمرهنّ فينقضن ما غزلن تَتَّخِذُونَ حال ودَخَلًا أحد مفعولي اتخذ. يعنى: ولا تنقضوا أيمانكم متخذيها دخلا بَيْنَكُمْ أى مفسدة ودغلا أَنْ تَكُونَ أُمَّةٌ بسبب أن تكون أمة يعنى جماعة قريش هِيَ أَرْبى مِنْ أُمَّةٍ هي أزيد عدداً وأوفر مالا. من أمة من جماعة المؤمنين إِنَّما يَبْلُوكُمُ اللَّهُ بِهِ الضمير لقوله: أن تكون أمة، لأنه في معنى المصدر، أى: إنما يختبركم بكونهم أربى، لينظر أتتمسكون بحيل الوفاء بعهد الله وما عقدتم على أنفسكم ووكدتم من أيمان البيعة لرسول الله صلى الله عليه وسلم، أم تغترون بكثرة قريش وثروتهم وقوّتهم وقلة المؤمنين وفقرهم وضعفهم؟ وَلَيُبَيِّنَنَّ لَكُمْ إنذار وتحذير من مخالفة ملة الإسلام.","surah_id":16,"source_id":9},{"ayah_number":93,"ayah_text":"وَلَوْ شاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً واحِدَةً وَلكِنْ يُضِلُّ مَنْ يَشاءُ وَيَهْدِي مَنْ يَشاءُ وَلَتُسْئَلُنَّ عَمَّا كُنْتُمْ تَعْمَلُونَ (93)","text":"وَلَوْ شاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً واحِدَةً حنيفة مسلمة على طريق الإلجاء والاضطرار، وهو قادر على ذلك وَلكِنْ الحكمة اقتضت أن يضلّ مَنْ يَشاءُ وهو أن يخذل من علم أنه يختار الكفر ويصمم عليه وَيَهْدِي مَنْ يَشاءُ وهو أن يلطف بمن علم أنه يختار الإيمان.\n\nيعنى: أنه بنى الأمر على الاختيار وعلى ما يستحق به اللطف والخذلان، والثواب والعقاب، ولم يبنه على الإجبار الذي لا يستحق به شيء من ذلك، وحققه بقوله وَلَتُسْئَلُنَّ عَمَّا كُنْتُمْ تَعْمَلُونَ ولو كان هو المضطرّ إلى الضلال والاهتداء، لما أثبت لهم عملا يسئلون عنه .","surah_id":16,"source_id":9},{"ayah_number":94,"ayah_text":"وَلا تَتَّخِذُوا أَيْمانَكُمْ دَخَلاً بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِها وَتَذُوقُوا السُّوءَ بِما صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ وَلَكُمْ عَذابٌ عَظِيمٌ (94)","text":"ثم كرر النهى عن اتخاذ الأيمان دخلا بينهم، تأكيداً عليهم وإظهاراً لعظم ما يركب منه فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِها فتزلّ أقدامكم عن محجة الإسلام بعد ثبوتها عليها وَتَذُوقُوا السُّوءَ في الدنيا بصدودكم عَنْ سَبِيلِ اللَّهِ وخروجكم من الدين. أو بصدّكم غيركم، لأنهم لو نقضوا أيمان البيعة وارتدّوا، لاتخذوا نقضها سنة لغيرهم يستنون بها وَلَكُمْ عَذابٌ عَظِيمٌ في الآخرة.","surah_id":16,"source_id":9},{"ayah_number":95,"ayah_text":"وَلا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَناً قَلِيلاً إِنَّما عِنْدَ اللَّهِ هُوَ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (95)","text":"كان قوما ممن أسلم بمكة زين لهم الشيطان- لجزعهم مما رأوا من غلبة قريش واستضعافهم المسلمين، وإيذائهم لهم، ولما كانوا يعدونهم إن رجعوا من المواعيد- أن ينقضوا ما بايعوا عليه رسول الله صلى الله عليه وسلم، فثبتهم الله، وَلا تَشْتَرُوا ولا تستبدلوا بِعَهْدِ اللَّهِ وبيعة رسول الله صلى الله عليه وسلم ثَمَناً قَلِيلًا عرضاً من الدنيا يسيراً، وهو ما كانت قريش يعدونهم ويمنونهم إن رجعوا إِنَّما عِنْدَ اللَّهِ من إظهاركم وتغنيمكم، ومن ثواب الآخرة خَيْرٌ لَكُمْ.","surah_id":16,"source_id":9},{"ayah_number":96,"ayah_text":"ما عِنْدَكُمْ يَنْفَدُ وَما عِنْدَ اللَّهِ باقٍ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُمْ بِأَحْسَنِ ما كانُوا يَعْمَلُونَ (96)","text":"ما عِنْدَكُمْ من أعراض الدنيا يَنْفَدُ وَما عِنْدَ اللَّهِ من خزائن رحمته باقٍ لا ينفد.\nوقرئ لَنَجْزِيَنَّ بالنون والياء الَّذِينَ صَبَرُوا على أذى المشركين ومشاقّ الإسلام. فإن قلت: لم وحدت القدم ونكرت؟ «1» قلت: لاستعظام أن تزلّ قدم واحدة عن طريق الحق بعد أن ثبتت عليه، فكيف بأقدام كثيرة؟","surah_id":16,"source_id":9},{"ayah_number":97,"ayah_text":"مَنْ عَمِلَ صالِحاً مِنْ ذَكَرٍ أَوْ أُنْثى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَياةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ ما كانُوا يَعْمَلُونَ (97)","text":"فإن قلت: مَنْ متناول في نفسه للذكر والأنثى، فما معنى تبيينه بهما؟ قلت: هو مبهم صالح على الإطلاق للنوعين إلا أنه إذا ذكر كان الظاهر تناوله للذكور، فقيل مِنْ ذَكَرٍ أَوْ أُنْثى على التبيين، ليعمّ الموعد النوعين جميعاً حَياةً طَيِّبَةً يعنى في الدنيا وهو الظاهر، لقوله وَلَنَجْزِيَنَّهُمْ وعده الله ثواب الدنيا والآخرة، كقوله فَآتاهُمُ اللَّهُ ثَوابَ الدُّنْيا وَحُسْنَ ثَوابِ الْآخِرَةِ وذلك أنّ المؤمن مع العمل الصالح موسراً كان أو معسراً يعيش عيشاً طيباً إن كان موسراً، فلا مقال فيه. وإن كان معسراً، فمعه ما يطيب عيشه وهو القناعة والرضا بقسمة الله. وأمّا الفاجر فأمره على العكس: إن كان معسراً فلا إشكال في أمره، وإن كان موسراً فالحرص لا يدعه أن يتهنأ بعيشه. وعن ابن عباس رضى الله عنه: الحياة الطيبة: الرزق الحلال.\n\nوعن الحسن: القناعة. وعن قتادة: يعنى في الجنة. وقيل: هي حلاوة الطاعة والتوفيق في قلبه.","surah_id":16,"source_id":9},{"ayah_number":98,"ayah_text":"فَإِذا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطانِ الرَّجِيمِ (98) إِنَّهُ لَيْسَ لَهُ سُلْطانٌ عَلَى الَّذِينَ آمَنُوا وَعَلى رَبِّهِمْ يَتَوَكَّلُونَ (99) إِنَّما سُلْطانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُمْ بِهِ مُشْرِكُونَ (100)","text":"لما ذكر العمل الصالح ووعد عليه، وصل به قوله فَإِذا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ إيذاناً بأن الاستعاذة من جمله الأعمال الصالحة التي يجزل الله عليها الثواب. والمعنى: فإذا أردت قراءة القرآن فاستعذ كقوله إِذا قُمْتُمْ إِلَى الصَّلاةِ فَاغْسِلُوا وُجُوهَكُمْ وكقولك: إذا أكلت فسمّ الله. فإن قلت: لم عبر عن إرادة الفعل بلفظ الفعل؟ قلت: لأن الفعل يوجد عند القصد والإرادة بغير فاصل وعلى حسبه، فكان منه بسبب قوىّ وملابسة ظاهرة. وعن عبد الله بن مسعود رضى الله عنه: قرأت على رسول الله صلى الله عليه وسلم فقلت: أعوذ بالسميع العليم من الشيطان الرجيم،\n\n فقال لي: «يا ابن أمّ عبد. قل: أعوذ بالله من الشيطان الرجيم، هكذا أقرأنيه جبريل عليه السلام عن القلم عن اللوح المحفوظ» لَيْسَ لَهُ سُلْطانٌ أى تسلط وولاية على أولياء الله، يعنى:\n\nأنهم لا يقبلون منه ولا يطيعونه فيما يريد منهم من اتباع خطواته إِنَّما سُلْطانُهُ على من يتولاه ويطيعه بِهِ مُشْرِكُونَ الضمير يرجع إلى ربهم. ويجوز أن يرجع إلى الشيطان، على معنى:\n\nبسببه وغروره ووسوسته.","surah_id":16,"source_id":9},{"ayah_number":101,"ayah_text":"وَإِذا بَدَّلْنا آيَةً مَكانَ آيَةٍ وَاللَّهُ أَعْلَمُ بِما يُنَزِّلُ قالُوا إِنَّما أَنْتَ مُفْتَرٍ بَلْ أَكْثَرُهُمْ لا يَعْلَمُونَ (101)","text":"تبديل الآية مكان الآية: هو النسخ، والله تعالى ينسخ الشرائع بالشرائع لأنها مصالح، وما كان مصلحة أمس يجوز أن يكون مفسدة اليوم، وخلافه مصلحة. والله تعالى عالم بالمصالح والمفاسد، فيثبت ما يشاء وينسخ ما يشاء بحكمته. وهذا معنى قوله وَاللَّهُ أَعْلَمُ بِما يُنَزِّلُ قالُوا إِنَّما أَنْتَ مُفْتَرٍ وجدوا مدخلا للطعن فطعنوا، وذلك لجهلهم وبعدهم عن العلم بالناسخ والمنسوخ وكانوا يقولون: إن محمدا يسخر من أصحابه: يأمرهم اليوم بأمر وينهاهم عنه غدا، فيأتيهم بما هو أهون، ولقد افتروا، فقد كان ينسخ الأشق بالأهون، والأهون بالأشق، والأهون بالأهون، والأشق بالأشق، لأنّ الغرض المصلحة، لا الهوان والمشقة. فإن قلت: هل في ذكر تبديل الآية بالآية دليل على أن القرآن إنما ينسخ بمثله، ولا يصح بغيره من السنة والإجماع والقياس؟\n\nقلت: فيه أن قرآناً ينسخ بمثله وليس فيه نفى نسخه بغيره، على أن السنة المكشوفة المتواترة مثل القرآن في إيجاب العلم، فنسخه بها كنسخه بمثله، وأمّا الإجماع والقياس والسنة غير المقطوع بها فلا يصح نسخ القرآن بها.","surah_id":16,"source_id":9},{"ayah_number":102,"ayah_text":"قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ مِنْ رَبِّكَ بِالْحَقِّ لِيُثَبِّتَ الَّذِينَ آمَنُوا وَهُدىً وَبُشْرى لِلْمُسْلِمِينَ (102)","text":"في يُنَزِّلُ ونَزَّلَهُ وما فيهما من التنزيل شيئاً فشيئاً على حسب الحوادث والمصالح: إشارة إلى أن التبديل من باب المصالح كالتنزيل، وأنّ ترك النسخ بمنزلة إنزاله دفعة واحدة في خروجه عن الحكمة. ورُوحُ الْقُدُسِ جبريل عليه السلام، أضيف إلى القدس وهو الطهر، كما يقال:\n\nحاتم الجود وزيد الخير، والمراد الروح المقدّس، وحاتم الجواد، وزيد الخير. والمقدّس: المطهر من المآثم. وقرئ: بضم الدال وسكونها بِالْحَقِّ في موضع الحال، أى نزله ملتبساً بالحكمة، يعنى أن النسخ من جملة الحق لِيُثَبِّتَ الَّذِينَ آمَنُوا ليبلوهم بالنسخ، حتى إذا قالوا فيه: هو الحق من ربنا والحكمة، حكم لهم بثبات القدم وصحة اليقين وطمأنينة القلوب، على أن الله حكيم فلا يفعل إلا ما هو حكمة وصواب وَهُدىً وَبُشْرى مفعول لهما معطوفان على محل ليثبت. والتقدير: تثبيتا لهم وإرشادا وبشارة، وفيه تعريض بحصول أضداد هذه الخصال لغيرهم. وقرئ: ليثبت، بالتخفيف.","surah_id":16,"source_id":9},{"ayah_number":103,"ayah_text":"وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّما يُعَلِّمُهُ بَشَرٌ لِسانُ الَّذِي يُلْحِدُونَ إِلَيْهِ أَعْجَمِيٌّ وَهذا لِسانٌ عَرَبِيٌّ مُبِينٌ (103)","text":"أرادوا بالبشر: غلاما كان لحويطب بن عبد العزى قد أسلم وحسن إسلامه اسمه عائش أو يعيش وكان صاحب كتب. وقيل: هو جبر، غلام رومي كان لعامر بن الحضرمي. وقيل عبدان: جبر ويسار، كانا يصنعان السيوف بمكة ويقرآن التوراة والإنجيل، فكان رسول الله صلى الله عليه وسلم إذا مرّ وقف عليهما يسمع ما يقرآن، فقالوا: يعلمانه، فقيل لأحدهما، فقال: بل هو يعلمني.\n\nوقيل: هو سلمان الفارسي. واللسان: اللغة. ويقال: ألحد القبر ولحده، وهو ملحد وملحود، إذا أمال حفره عن الاستقامة، فحفر في شق منه ثم استعير لكل إمالة عن استقامة، فقالوا:\n\nألحد فلان في قوله، وألحد في دينه. ومنه الملحد، لأنه أمال مذهبه عن الأديان كلها، لم يمله عن دين إلى دين. والمعنى: لسان الرجل الذي يميلون قولهم عن الاستقامة إليه لسان أَعْجَمِيٌّ غير بين وَهذا القرآن لِسانٌ عَرَبِيٌّ مُبِينٌ ذو بيان وفصاحة ردّا لقولهم وإبطالا لطعنهم. وقرئ يُلْحِدُونَ بفتح الياء والحاء. وفي قراءة الحسن: اللسان الذي يلحدون إليه بتعريف اللسان.\n\nفإن قلت: الجملة التي هي قوله لِسانُ الَّذِي يُلْحِدُونَ إِلَيْهِ أَعْجَمِيٌّ ما محلها؟ قلت: لا محل لها، لأنها مستأنفة جواب لقولهم. ومثله قوله اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسالَتَهُ بعد قوله وَإِذا جاءَتْهُمْ آيَةٌ قالُوا لَنْ نُؤْمِنَ حَتَّى نُؤْتى مِثْلَ ما أُوتِيَ رُسُلُ اللَّهِ.","surah_id":16,"source_id":9},{"ayah_number":104,"ayah_text":"إِنَّ الَّذِينَ لا يُؤْمِنُونَ بِآياتِ اللَّهِ لا يَهْدِيهِمُ اللَّهُ وَلَهُمْ عَذابٌ أَلِيمٌ (104) إِنَّما يَفْتَرِي الْكَذِبَ الَّذِينَ لا يُؤْمِنُونَ بِآياتِ اللَّهِ وَأُولئِكَ هُمُ الْكاذِبُونَ (105)","text":"إِنَّ الَّذِينَ لا يُؤْمِنُونَ بِآياتِ اللَّهِ أى يعلم الله منهم أنهم لا يؤمنون لا يَهْدِيهِمُ اللَّهُ لا يلطف بهم، لأنهم من أهل الخذلان في الدنيا والعذاب في الآخرة، لا من أهل اللطف والثواب إِنَّما يَفْتَرِي الْكَذِبَ ردّ لقولهم إِنَّما أَنْتَ مُفْتَرٍ يعنى: إنما يليق افتراء الكذب بمن لا يؤمن، لأنه لا يترقب عقاباً عليه وَأُولئِكَ إشارة إلى قريش هُمُ الْكاذِبُونَ أى هم الذين لا يؤمنون فهم الكاذبون. أو إلى الذين لا يؤمنون. أى أولئك هم الكاذبون على الحقيقة الكاملون في الكذب، لأنّ تكذيب آيات الله أعظم الكذب: أو أولئك هم الذين عادتهم الكذب لا يبالون به في كل شيء، لا تحجبهم عنه مروءة ولا دين. أو أولئك هم الكاذبون في قولهم إِنَّما أَنْتَ مُفْتَرٍ.","surah_id":16,"source_id":9},{"ayah_number":106,"ayah_text":"مَنْ كَفَرَ بِاللَّهِ مِنْ بَعْدِ إِيمانِهِ إِلاَّ مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ وَلكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْراً فَعَلَيْهِمْ غَضَبٌ مِنَ اللَّهِ وَلَهُمْ عَذابٌ عَظِيمٌ (106) ذلِكَ بِأَنَّهُمُ اسْتَحَبُّوا الْحَياةَ الدُّنْيا عَلَى الْآخِرَةِ وَأَنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الْكافِرِينَ (107) أُولئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلى قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصارِهِمْ وَأُولئِكَ هُمُ الْغافِلُونَ (108) لا جَرَمَ أَنَّهُمْ فِي الْآخِرَةِ هُمُ الْخاسِرُونَ (109)","text":"مَنْ كَفَرَ بدل من الذين لا يؤمنون بآيات الله، على أن يجعل وَأُولئِكَ هُمُ الْكاذِبُونَ اعتراضاً بين البدل والمبدل منه. والمعنى: إنما يفترى الكذب من كفر بالله من بعد إيمانه.\n\nواستثنى منهم المكره فلم يدخل تحت حكم الافتراء، ثم قال وَلكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْراً أى طاب به نفسا واعتقده فَعَلَيْهِمْ غَضَبٌ مِنَ اللَّهِ ويجوز أن يكون بدلا من المبتدإ الذي هو أُولئِكَ على: ومن كفر بالله من بعد إيمانه هم الكاذبون. أو من الخبر الذي هو الكاذبون، على: وأولئك هم من كفر بالله من بعد إيمانه. ويجوز أن ينتصب على الذمّ. وقد جوّزوا أن يكون مَنْ كَفَرَ بِاللَّهِ شرطاً مبتدأ، ويحذف جوابه، لأنّ جواب مَنْ شَرَحَ دال عليه، كأنه قيل: من كفر بالله فعليهم غضب، إلا من أكره، ولكن من شرح بالكفر صدراً فعليهم غضب. روى أنّ ناساً من أهل مكة فتنوا فارتدوا عن الإسلام بعد دخولهم فيه، وكان فيهم من أكره فأجرى كلمة الكفر على لسانه وهو معتقد للإيمان، منهم عمار، وأبواه- ياسر وسمية- وصهيب، وبلال، وخباب، وسالم: عذبوا، فأمّا سمية فقد ربطت بين بعيرين وو جيء في قبلها بحربة، وقالوا: إنك أسلمت من أجل الرجال فقتلت، وقتل ياسر وهما أول قتيلين في الإسلام، وأما عمار فقد أعطاهم ما أرادوا بلسانه مكرها، فقيل يا رسول الله، إن عماراً كفر، فقال: «كلا، إنّ عماراً مليء إيماناً من قرنه إلى قدمه، واختلط الإيمان بلحمه ودمه» فأتى عمار رسول الله صلى الله عليه وسلم وهو يبكى، فجعل النبي صلى الله عليه وسلم يمسح عينيه، وقال: «مالك! إن عادوا لك فعد لهم بما قلت» ومنهم جبر مولى الحضرمي، أكرهه سيده فكفر ثم أسلم مولاه وأسلم، وحسن إسلامهما، وهاجرا . فإن قلت: أى الأمرين أفضل، أفعل عمار أم فعل أبويه؟ قلت: بل فعل أبويه، لأنّ في ترك التقية والصبر على القتل إعزازاً للإسلام. وقد روى أنّ مسيلمة أخذ رجلين فقال لأحدهما: ما تقول في محمد؟ قال: رسول الله. قال: فما تقول فىّ؟\n\nقال أنت أيضاً، فخلاه. وقال للآخر: ما تقول في محمد؟ قال: رسول الله. قال: فما تقول فىّ؟\n\nقال أنا أصمّ. فأعاد عليه ثلاثاً، فأعاد جوابه، فقتله، فبلغ ذلك رسول الله صلى الله عليه وسلم فقال: «أما الأوّل فقد أخذ برخصة الله. وأمّا الثاني فقد صدع بالحق فهنيئاً له » ذلِكَ إشارة إلى الوعيد، وأنّ الغضب والعذاب يلحقانهم بسبب استحبابهم الدنيا على الآخرة، واستحقاقهم خذلان الله بكفرهم وَأُولئِكَ هُمُ الْغافِلُونَ الكاملون في الغفلة، الذين لا أحد أغفل منهم، لأنّ الغفلة عن تدبر العواقب هي غاية الغفلة ومنتهاها.","surah_id":16,"source_id":9},{"ayah_number":110,"ayah_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هاجَرُوا مِنْ بَعْدِ ما فُتِنُوا ثُمَّ جاهَدُوا وَصَبَرُوا إِنَّ رَبَّكَ مِنْ بَعْدِها لَغَفُورٌ رَحِيمٌ (110) يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجادِلُ عَنْ نَفْسِها وَتُوَفَّى كُلُّ نَفْسٍ ما عَمِلَتْ وَهُمْ لا يُظْلَمُونَ (111)","text":"ثُمَّ إِنَّ رَبَّكَ دلالة على تباعد حال هؤلاء من حال أولئك، وهم عمار وأصحابه. ومعنى:\n\nإنّ ربك لهم، أنه لهم لا عليهم، بمعنى أنه وليهم وناصرهم لا عدوّهم وخاذلهم، كما يكون الملك الرجل لا عليه، فيكون محمياً منفوعا غير مضرور مِنْ بَعْدِ ما فُتِنُوا بالعذاب والإكراه على الكفر. وقرئ فُتِنُوا على البناء للفاعل، أى: بعد ما عذبوا المؤمنين كالحضرمى وأشباهه مِنْ بَعْدِها من بعد هذه الأفعال وهي الهجرة والجهاد والصبر يَوْمَ تَأْتِي منصوب برحيم. أو بإضمار اذكر. فإن قلت: ما معنى النفس المضافة إلى النفس؟ قلت: يقال لعين الشيء وذاته نفسه، وفي نقيضه غيره، والنفس الجملة كما هي، فالنفس الأولى هي الجملة، والثانية عينها وذاتها، فكأنه قيل: يوم يأتى كل إنسان يجادل عن ذاته لا يهمه شأن غيره، كل يقول:\n\nنفسي نفسي. ومعنى المجادلة عنها: الاعتذار عنها كقوله هؤُلاءِ أَضَلُّونا، ما كُنَّا مُشْرِكِينَ ونحو ذلك.","surah_id":16,"source_id":9},{"ayah_number":112,"ayah_text":"وَضَرَبَ اللَّهُ مَثَلاً قَرْيَةً كانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيها رِزْقُها رَغَداً مِنْ كُلِّ مَكانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذاقَهَا اللَّهُ لِباسَ الْجُوعِ وَالْخَوْفِ بِما كانُوا يَصْنَعُونَ (112) وَلَقَدْ جاءَهُمْ رَسُولٌ مِنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ الْعَذابُ وَهُمْ ظالِمُونَ (113)","text":"وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً أى جعل القرية التي هذه حالها مثلا لكل قوم أنعم الله عليهم فأبطرتهم النعمة، فكفروا وتولوا، فأنزل الله بهم نقمته. فيجوز أن تراد قرية مقدرة على هذه الصفة، وأن تكون في قرى الأوّلين قرية كانت هذه حالها، فضربها الله مثلا لمكة إنذاراً من مثل عاقبتها مُطْمَئِنَّةً لا يزعجها خوف، لأن الطمأنينة مع الأمن، والانزعاج والقلق مع الخوف رَغَداً واسعاً. والأنعم: جمع نعمة، على ترك الاعتداد بالتاء، كدرع وأدرع.\n\nأو جمع نعم، كبؤس وأبؤس. وفي الحديث. نادى منادى النبي صلى الله عليه وسلم بالموسم بمنى:\n\n«إنها أيام طعم ونعم فلا تصوموا » . فإن قلت: الإذاقة واللباس استعارتان، فما وجه صحتهما؟ والإذاقة المستعارة موقعة على اللباس المستعار، فما وجه صحة إيقاعها عليه ؟ قلت: أما الإذاقة فقد جرت عندهم مجرى الحقيقة لشيوعها في البلايا والشدائد وما يمسّ الناس منها، فيقولون: ذاق فلان البؤس والضر، وأذاقه العذاب: شبه ما يدرك من أثر الضرر والألم بما يدرك من طعم المرّ والبشع . وأما اللباس فقد شبه به لاشتماله على اللابس: ما غشى الإنسان والتبس به من بعض الحوادث. وأما إيقاع الإذاقة على لباس الجوع والخوف، فلأنه لما وقع عبارة عما يغشى منهما ويلابس، فكأنه قيل: فأذاقه ما غشيهم من الجوع والخوف، ولهم في نحو هذا طريقان لا بد من الإحاطة بهما، فإن الاستنكار لا يقع إلا لمن فقدهما، أحدهما:\n\nأن ينظروا فيه إلى المستعار له، كما نظر إليه هاهنا. ونحوه قول كثير:\n\nغَمْرُ الرِّدَاءِ إذَا تَبَسَّمَ ضَاحِكاً ... غَلِقَتْ لِضِحْكَتِهِ رِقَابُ المَالِ\n\nاستعارة الرداء للمعروف، لأنه يصون عرض صاحبه صون الرداء لما يلقى عليه. ووصفه بالغمر الذي هو وصف المعروف والنوال، لا صفة الرداء، نظر إلى المستعار له. والثاني:\n\nأن ينظروا فيه إلى المستعار، كقوله:\n\nيُنَازِعُنِى رِدَائِى عَبْدُ عَمْرٍو ... رُوَيْدَكَ يَا أَخَا عَمْرِو بْنِ بَكْر\n\nلِىَ الشّطْرُ الَّذِى مَلَكَتْ يَمِينِى ... وَدُونَكَ فَاعْتَجِرْ مِنْهُ بِشَطْرِ\n\n أراد بردائه سيفه، ثم قال: فاعتجر منه بشطر، فنظر إلى المستعار في لفظ الاعتجار، ولو نظر إليه فيما نحن فيه لقيل: فكساهم لباس الجوع والخوف، ولقال كثير: ضافى الرداء إذا تبسم ضاحكا وَهُمْ ظالِمُونَ في حال التباسهم بالظلم، كقوله الَّذِينَ تَتَوَفَّاهُمُ الْمَلائِكَةُ ظالِمِي أَنْفُسِهِمْ نعوذ بالله من مفاجأة النقمة والموت على الغفلة. وقرئ وَالْخَوْفِ عطفاً على اللباس، أو على تقدير حذف المضاف وإقامة المضاف إليه مقامه. أصله: ولباس الخوف. وقرئ: لباس الخوف والجوع.","surah_id":16,"source_id":9},{"ayah_number":114,"ayah_text":"فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلالاً طَيِّباً وَاشْكُرُوا نِعْمَتَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ (114) إِنَّما حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَما أُهِلَّ لِغَيْرِ اللَّهِ بِهِ فَمَنِ اضْطُرَّ غَيْرَ باغٍ وَلا عادٍ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (115)","text":"لما وعظهم بما ذكر من حال القرية وما أوتيت به من كفرها وسوء صنيعها، وصل بذلك بالفاء في قوله فَكُلُوا صدّهم عن أفعال الجاهلية ومذاهبهم الفاسدة التي كانوا عليها، بأن أمرهم بأكل ما رزقهم الله من الحلال الطيب، وشكر إنعامه بذلك، وقال إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ يعنى تطيعون. أو إن صحّ زعمكم أنكم تعبدون الله بعبادة الآلهة، لأنها شفعاؤكم عنده. ثم عدد عليهم محرمات الله، ونهاهم عن تحريمهم وتحليلهم بأهوائهم وجهالاتهم، دون اتباع ما شرع الله على لسان أنبيائه.","surah_id":16,"source_id":9},{"ayah_number":116,"ayah_text":"وَلا تَقُولُوا لِما تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هذا حَلالٌ وَهذا حَرامٌ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لا يُفْلِحُونَ (116) مَتاعٌ قَلِيلٌ وَلَهُمْ عَذابٌ أَلِيمٌ (117)","text":"وانتصاب الْكَذِبَ بلا تقولوا، على: ولا تقولوا الكذب لما تصفه ألسنتكم من البهائم بالحل والحرمة في قولكم ما فِي بُطُونِ هذِهِ الْأَنْعامِ خالِصَةٌ لِذُكُورِنا وَمُحَرَّمٌ عَلى أَزْواجِنا من غير استناد ذلك الوصف إلى وحى من الله أو إلى قياس مستند إليه. واللام مثلها في قولك:\n\nولا تقولوا لما أحل الله هو حرام. وقوله هذا حَلالٌ وَهذا حَرامٌ بدل من الكذب.\n\nويجوز أن يتعلق بتصف على إرادة القول، أى: ولا تقولوا الكذب لما تصفه ألسنتكم، فتقول هذا حلال وهذا حرام. ولك أن تنصب الكذب بتصف، وتجعل «ما» مصدرية، وتعلق هذا حَلالٌ وَهذا حَرامٌ بلا تقولوا، على: ولا تقولوا هذا حلال وهذا حرام لوصف ألسنتكم الكذب، أى: لا تحرموا ولا تحللوا لأجل قول تنطق به ألسنتكم ويجول في أفواهكم، لا لأجل حجة وبينة، ولكن قول ساذج ودعوى فارغة. فإن قلت: ما معنى وصف ألسنتهم الكذب؟ قلت: هو من فصيح الكلام وبليغه، جعل قولهم كأنه عين الكذب ومحضه، فإذا نطقت به ألسنتهم فقد حلت الكذب بحليته وصوّرته بصورته، كقولهم: ووجهها يصف الجمال. وعينها تصف السحر، وقرئ «الكذب» بالجرّ صفة لما المصدرية، كأنه قيل: لوصفها الكذب، بمعنى الكاذب، كقوله تعالى بِدَمٍ كَذِبٍ والمراد بالوصف: وصفها البهائم بالحل والحرمة. وقرئ «الكذب» جمع كذوب بالرفع، صفة للألسنة، وبالنصب على الشتم. أو بمعنى: الكلم الكواذب، أو هو جمع الكذاب من قولك: كذب كذابا، ذكره ابن جنى.\n\nواللام في لِتَفْتَرُوا من التعليل الذي لا يتضمن معنى الغرض مَتاعٌ قَلِيلٌ خبر مبتدأ محذوف، أى منفعتهم فيما هم عليه من أفعال الجاهلية منفعة قليلة وعقابها عظيم.","surah_id":16,"source_id":9},{"ayah_number":118,"ayah_text":"وَعَلَى الَّذِينَ هادُوا حَرَّمْنا ما قَصَصْنا عَلَيْكَ مِنْ قَبْلُ وَما ظَلَمْناهُمْ وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ (118)","text":"ما قَصَصْنا عَلَيْكَ يعنى في سورة الأنعام.","surah_id":16,"source_id":9},{"ayah_number":119,"ayah_text":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا السُّوءَ بِجَهالَةٍ ثُمَّ تابُوا مِنْ بَعْدِ ذلِكَ وَأَصْلَحُوا إِنَّ رَبَّكَ مِنْ بَعْدِها لَغَفُورٌ رَحِيمٌ (119)","text":"بِجَهالَةٍ في موضع الحال، أى: عملوا السوء جاهلين غير عارفين بالله وبعقابه، أو غير متدبرين للعاقبة لغلبة الشهوة عليهم مِنْ بَعْدِها من بعد التوبة.","surah_id":16,"source_id":9},{"ayah_number":120,"ayah_text":"إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ حَنِيفاً وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ (120) شاكِراً لِأَنْعُمِهِ اجْتَباهُ وَهَداهُ إِلى صِراطٍ مُسْتَقِيمٍ (121) وَآتَيْناهُ فِي الدُّنْيا حَسَنَةً وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ (122)","text":"كانَ أُمَّةً فيه وجهان، أحدهما: أنه كان وحده أمّة من الأمم لكماله في جميع صفات\n\n الخير، كقوله:\n\nوَلَيْسَ عَلَى اللَّهِ بِمُسْتَنْكَرٍ ... أنْ يَجْمَعَ الْعَالَمَ فِى وَاحِدِ\n\nوعن مجاهد: كان مؤمناً وحده والناس كلهم كفار. والثاني: أن يكون أمّة بمعنى مأموم، أى: يؤمّه الناس ليأخذوا منه الخير، أو بمعنى مؤتم به كالرحلة والنخبة، وما أشبه ذلك مما جاء من فعلة بمعنى مفعول، فيكون مثل قوله قالَ إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً وروى الشعبي عن فروة بن نوفل الأشجعى عن ابن مسعود أنه قال: إنّ معاذاً كان أمّة قانتاً لله، فقلت: غلطت، إنما هو إبراهيم. فقال: الأمّة: الذي يعلم الخير. والقانت المطيع لله ورسوله ، وكان معاذ كذلك. وعن عمر رضى الله عنه أنه قال- حين قيل له: ألا تستخلف؟ -: لو كان أبو عبيدة حياً لاستخلفته، ولو كان معاذ حيا لاستخلفته. ولو كان سالم حيا لاستخلفته فإنى سمعت رسول الله صلى الله تعالى عليه وعلى آله وسلم يقول: «أبو عبيدة أمين هذه الأمّة، ومعاذ أمّة قانت لله، ليس بينه وبين الله يوم القيامة إلا المرسلون، وسالم شديد الحب لله، لو كان لا يخاف الله لم يعصه . وهو ذلك المعنى، أى: كان إماما في الدين، لأنّ الأئمة معلمو الخير.\n\n والقانت: القائم بما أمره الله. والحنيف: المائل إلى ملة الإسلام غير الزائل عنه. ونفى عنه الشرك تكذيبا لكفار قريش في زعمهم أنهم على ملة أبيهم إبراهيم شاكِراً لِأَنْعُمِهِ روى أنه كان لا يتغدّى إلا مع ضيف، فلم يجد ذات يوم ضيفاً، فأخر غداءه، فإذا هو بفوج من الملائكة في صورة البشر، فدعاهم إلى الطعام فخيلوا له أنّ بهم جذاماً؟ فقال: الآن وجبت مواكلتكم شكراً لله على أنه عافاني وابتلاكم اجْتَباهُ اختصه واصطفاه للنبوّة وَهَداهُ إِلى صِراطٍ مُسْتَقِيمٍ إلى ملة الإسلام حَسَنَةً عن قتادة: هي تنوبه الله بذكره، حتى ليس من أهل دين إلا وهم يتولونه. وقيل: الأموال والأولاد، وقيل: قول المصلى منا: كما صليت على إبراهيم لَمِنَ الصَّالِحِينَ لمن أهل الجنة.","surah_id":16,"source_id":9},{"ayah_number":123,"ayah_text":"ثُمَّ أَوْحَيْنا إِلَيْكَ أَنِ اتَّبِعْ مِلَّةَ إِبْراهِيمَ حَنِيفاً وَما كانَ مِنَ الْمُشْرِكِينَ (123)","text":"ثُمَّ أَوْحَيْنا إِلَيْكَ في «ثم» هذه ما فيها من تعظيم منزلة رسول الله»\n\nصلى الله عليه وسلم، وإجلال محله، والإيذان بأنّ أشرف ما أوتى خليل الله إبراهيم من الكرامة، وأجلّ ما أولى من النعمة: اتباع رسول الله صلى الله عليه وسلم ملته، من قبل أنها دلت على تباعد هذا النعت في المرتبة من بين سائر النعوت التي أثنى الله عليه بها.","surah_id":16,"source_id":9},{"ayah_number":124,"ayah_text":"إِنَّما جُعِلَ السَّبْتُ عَلَى الَّذِينَ اخْتَلَفُوا فِيهِ وَإِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيامَةِ فِيما كانُوا فِيهِ يَخْتَلِفُونَ (124)","text":"السَّبْتُ مصدر سبتت اليهود إذا عظمت سبتها. والمعنى: إنما جعل وبال السبت وهو المسخ عَلَى الَّذِينَ اخْتَلَفُوا فِيهِ واختلافهم فيه أنهم أحلوا الصيد فيه تارة وحرّموه تارة، وكان الواجب عليهم أن يتفقوا في تحريمه على كلمة واحدة بعد ما حتم الله عليهم الصبر عن الصيد فيه وتعظيمه.\n\nوالمعنى في ذكر ذلك، نحو المعنى في ضرب القرية التي كفرت بأنعم الله مثلا، وغير ما ذكر، وهو الإنذار من سخط الله على العصاة والمخالفين لأوامره والخالعين ربقة طاعته. فإن قلت:\n\nما معنى الحكم بينهم إذا كانوا جميعاً محلين أو محرّمين؟ قلت: معناه أنه يجازيهم جزاء اختلاف فعلهم في كونهم محلين تارة ومحرّمين أخرى ووجه آخر: وهو أنّ موسى عليه السلام أمرهم أن يجعلوا في الأسبوع يوما للعبادة وأن يكون يوم الجمعة، فأبوا عليه وقالوا: نريد اليوم الذي فرغ الله فيه من خلق السموات والأرض وهو السبت، إلا شر ذمة منهم قد رضوا بالجمعة، فهذا اختلافهم في السبت لأن بعضهم اختاره وبعضهم اختار عليه الجمعة، فأذن الله لهم في السبت وابتلاهم بتحريم الصيد فيه، فأطاع أمر الله الراضون بالجمعة، فكانوا لا يصيدون فيه، وأعقابهم لم يصبروا عن الصيد فمسخهم الله دون أولئك، وهو يحكم بَيْنَهُمْ يَوْمَ الْقِيامَةِ فيجازى كل واحد من الفريقين بما يستوجبه. ومعنى جعل السبت: فرض عليهم تعظيمه وترك الاصطياد فيه. وقرئ: إنما جعل السبت، على البناء للفاعل. وقرأ عبد الله: إنا أنزلنا السبت.","surah_id":16,"source_id":9},{"ayah_number":125,"ayah_text":"ادْعُ إِلى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَجادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ (125)","text":"إِلى سَبِيلِ رَبِّكَ إلى الإسلام بِالْحِكْمَةِ بالمقالة المحكمة الصحيحة، وهي الدليل الموضح للحق المزيل للشبهة وَالْمَوْعِظَةِ الْحَسَنَةِ وهي التي لا يخفى عليهم أنك تناصحهم بها وتقصد ما ينفعهم فيها. ويجوز أن يريد القرآن، أى: ادعهم بالكتاب الذي هو حكمة وموعظة حسنة وَجادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ بالطريقة التي هي أحسن طرق المجادلة من الرفق واللين، من غير فظاظة ولا تعنيف إِنَّ رَبَّكَ هُوَ أَعْلَمُ بهم فمن كان فيه خير كفاه الوعظ القليل والنصيحة اليسيرة، ومن لا خير فيه عجزت عنه الحيل، وكأنك تضرب منه في حديد بارد.","surah_id":16,"source_id":9},{"ayah_number":126,"ayah_text":"وَإِنْ عاقَبْتُمْ فَعاقِبُوا بِمِثْلِ ما عُوقِبْتُمْ بِهِ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ (126) وَاصْبِرْ وَما صَبْرُكَ إِلاَّ بِاللَّهِ وَلا تَحْزَنْ عَلَيْهِمْ وَلا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ (127) إِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوْا وَالَّذِينَ هُمْ مُحْسِنُونَ (128)","text":"سمى الفعل الأول باسم الثاني للمزاوجة. والمعنى: إن صنع بكم صنيع سوء من قتل أو نحوه، فقابلوه بمثله ولا تزيدوا عليه. وقرئ: وإن عقبتم فعقبوا، أى: وإن قفيتم بالانتصار فقفوا بمثل ما فعل بكم.\n\nروى أن المشركين مثلوا بالمسلمين يوم أحد: بقروا بطونهم وقطعوا مذاكيرهم، ما تركوا أحداً غير ممثول به إلا حنظلة بن الراهب، فوقف رسول الله صلى الله عليه وسلم على حمزة وقد مثل به، وروى: فرآه مبقور البطن فقال: «أما والذي أحلف به، لئن أظفرنى الله بهم لأمثلن بسبعين مكانك » فنزلت، فكفر عن يمينه وكفّ عما أراده، ولا خلاف في تحريم المثلة. وقد وردت الأخبار بالنهى عنها حتى بالكلب العقور. إما أن رجع الضمير في لَهُوَ إلى صبرهم وهو مصدر صبرتم. ويراد بالصابرين: المخاطبون، أى: ولئن صبرتم لصبركم خير لكم، فوضع الصابرون موضع الضمير ثناء من الله عليهم بأنهم صابرون على الشدائد. أو وصفهم بالصفة التي تحصل لهم إذا صبروا عن المعاقبة. وإما أن يرجع إلى جنس الصبر- وقد دل عليه صبرتم- ويراد بالصابرين جنسهم، كأنه قيل: وللصبر خير للصابرين. ونحوه قوله تعالى فَمَنْ عَفا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ، وَأَنْ تَعْفُوا أَقْرَبُ لِلتَّقْوى ثم قال لرسول الله صلى الله عليه وسلم وَاصْبِرْ أنت فعزم عليه بالصبر وَما صَبْرُكَ إِلَّا بِاللَّهِ أى بتوفيقه وتثبيته وربطه على قلبك وَلا تَحْزَنْ عَلَيْهِمْ أى على الكافرين، كقوله فَلا تَأْسَ عَلَى الْقَوْمِ الْكافِرِينَ أو على المؤمنين وما فعل بهم الكافرون وَلا تَكُ فِي ضَيْقٍ وقرئ: ولا تكن في ضيق، أى: ولا يضيقن صدرك من مكرهم. والضيق: تخفيف الضيق، أى في أمر ضيق. ويجوز أن يكون الضيق والضيق مصدرين، كالقيل والقول إِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوْا أى هو ولىّ الذين اجتنبوا المعاصي وَولى الَّذِينَ هُمْ مُحْسِنُونَ في أعمالهم. وعن هرم بن حيان أنه قيل له حين احتضر: أوص.\n\nفقال: إنما الوصية من المال ولا مال لي، وأوصيكم بخواتم سورة النحل.\n\nعن رسول الله صلى الله عليه وسلم: «من قرأ سورة النحل لم يحاسبه الله بما أنعم عليه في دار الدنيا وإن مات في يوم تلاها أو ليلته، كان له من الأجر كالذي مات وأحسن الوصية»","surah_id":16,"source_id":9}]